[{"author":"Jennifer O'Connell","content":"All of a sudden cannabidiol better known as CBD is everywhere, purporting to cure assorted ills from insomnia to inflammation and anxiety to acne. You can vape it, drink it as a tea or hot chocolate. You can apply it as a lip balm, moisturiser or mascara. You… [+8831 chars]","description":"All of a sudden cannabidiol – better known as CBD – is everywhere, purporting to cure assorted ills from insomnia to inflammation and anxiety to acne. You can vape it, drink it as a tea or hot chocolate. You can apply it as a lip balm, moisturiser or mascara.…","publishedAt":"2018-12-01T00:00:00Z","source":{"id":"the-irish-times","name":"The Irish Times"},"title":"CBD: What’s the story with this legal cannabis constituent?","url":"https:\/\/www.irishtimes.com\/life-and-style\/health-family\/cbd-what-s-the-story-with-this-legal-cannabis-constituent-1.3705619","urlToImage":"https:\/\/www.irishtimes.com\/image-creator\/?id=1.3705618&origw=1440","relevancy":65},{"author":"Russell Campbell","content":"With the rising growth of Blockchain and cryptocurrencies, its easy to see why traders and investors are flocking to these technologies like a burn victim to a hospital. This means that there is plenty of obvious advice, such as buying low and selling high. H… [+3253 chars]","description":"With the rising growth of Blockchain and cryptocurrencies, it’s easy to see why traders and investors are flocking to these technologies like a burn victim to a hospital. This means that there is plenty of obvious advice, such as buying low and selling high. …","publishedAt":"2018-12-01T00:00:54Z","source":{"id":null,"name":"Bitrebels.com"},"title":"7 Useful Tips To Become A Successful Crypto Trader","url":"http:\/\/www.bitrebels.com\/business\/7-tips-successful-crypto-trader\/","urlToImage":"http:\/\/www.bitrebels.com\/wp-content\/uploads\/2018\/11\/7-tips-bitcoin-trader-header-image.jpeg","relevancy":27},{"author":"Bess Levin","content":"In their quest to ascertain Matthew Whitaker’s qualifications to serve as acting attorney general of the United States, journalists have uncovered several interesting biographical details. Before he was Jeff Sessions’s chief of staff, Whitaker was an Iowa law… [+5086 chars]","description":"New reports show Matthew Whitaker allegedly tried to stonewall an investigation into his time with World Patent Marketing.","publishedAt":"2018-12-01T00:09:30Z","source":{"id":null,"name":"Vanityfair.com"},"title":"Trump A.G.’s Toilet-Scamming Days Come Back to Haunt Him","url":"https:\/\/www.vanityfair.com\/news\/2018\/11\/matthew-whitaker-world-patent-marketing-scam","urlToImage":"https:\/\/media.vanityfair.com\/photos\/5be5f7ae9d778a5931ffddfe\/16:9\/w_1200,h_630,c_limit\/Matthew-Whitaker-Mueller-Lede.jpg","relevancy":34},{"author":"Sam Ouimet","content":"Bitcoin just ended its worst-performing month in seven years in terms of month-over-month price declines. The world’s largest cryptocurrency began November at an average price across exchanges of $6,341, but as of 0:00 UTC on December 1 is trading at just $3,… [+2025 chars]","description":"The price of bitcoin is on its way to recording its worst monthly performance since August of 2011.","publishedAt":"2018-12-01T00:17:48Z","source":{"id":null,"name":"Coindesk.com"},"title":"Bitcoin Price Ends November With Worst Monthly Decline in 7 Years","url":"https:\/\/www.coindesk.com\/bitcoin-price-ends-november-with-worst-monthly-decline-in-7-years","urlToImage":"https:\/\/www.coindesk.com\/wp-content\/uploads\/2018\/11\/bitcoin-chips.jpg","relevancy":3},{"author":"Aaron van Wirdum","content":"In what may well have been the most watched cryptocurrency event of 2018, Bitcoin Cash two weeks ago hard forked (split) into two different coins. The big block project that itself forked away from the Bitcoin blockchain in August 2017 fragmented into Bitcoin… [+5539 chars]","description":"In what may well have been the most watched cryptocurrency event of 2018, Bitcoin Cash two weeks ago “ hard forked ” (split) into two different coins. The “big block” project that itself forked away from the Bitcoin blockchain in August 2017 fragmented into “…","publishedAt":"2018-12-01T00:23:59Z","source":{"id":null,"name":"Bitcoinmagazine.com"},"title":"Week 2: How the Bitcoin Cash “Hash War” Came and Went and Not Much Happened","url":"https:\/\/bitcoinmagazine.com\/articles\/week-2-how-bitcoin-cash-hash-war-came-and-went-and-not-much-happened\/","urlToImage":"https:\/\/fs.bitcoinmagazine.com\/img\/images\/final_bch_split.max-800x800.jpg","relevancy":2},{"author":null,"content":"Congress House opposition starts to take shape A change of party control and a wave of retirements are changing the makeup of Republican representation on key committees of Congress for the session kicking off in January 2019, with some familiar faces being e… [+2896 chars]","description":"A change of party control and a wave of retirements are changing the makeup of Republican representation on key committees of Congress for the session kicking off in January 2019, with some familiar faces being elevated to more senior roles. Rep. Jim Jordan (…","publishedAt":"2018-12-01T00:52:00Z","source":{"id":null,"name":"Fcw.com"},"title":"House opposition starts to take shape","url":"https:\/\/fcw.com\/articles\/2018\/11\/30\/gop-committee-ranking-johnson.aspx","urlToImage":"https:\/\/fcw.com\/~\/media\/GIG\/EDIT_SHARED\/Buildings\/Congress\/Congress_House_Side.jpg","relevancy":57},{"author":"David Cotle,, David Cotle","content":"Fundamental Australian Dollar Forecast: Neutral The Australian Dollar could gain if the weekend G20 offers a trade breakthrough However the issue is complex and markets could be hoping for too much The RBA sets policy Tuesday, may fret AUD resurgence Find out… [+3345 chars]","description":"The Australian Dollar remains buoyed up against its US rival, and any signs of a trade thaw between Washington and Beijing could lift it further","publishedAt":"2018-12-01T03:00:00Z","source":{"id":null,"name":"Dailyfx.com"},"title":"Australian Dollar Looks To Trump, Xi In Argentina, RBA Policy Meet","url":"https:\/\/www.dailyfx.com\/forex\/fundamental\/forecast\/weekly\/aud\/2018\/11\/30\/Australian-Dollar-Looks-To-TrumpXi-In-Argentina-RBA-Policy-Meet.html","urlToImage":null,"relevancy":37},{"author":"Tony Spilotro","content":"During last nights airing of the popular TV game show Jeopardy, cryptocurrency was featured among the categories contestants could choose from. Ill Take Cryptocurrency for $1,000, Alex On Thursday nights episode of the iconic TV game show hosted by Alex Trebe… [+2661 chars]","description":"During last night’s airing of the popular TV game show Jeopardy, cryptocurrency was featured among the categories contestants could choose from. I’ll Take Cryptocurrency for $1,000, Alex On Thursday night’s episode of the iconic TV game show hosted by Alex Tr…","publishedAt":"2018-12-01T03:00:16Z","source":{"id":null,"name":"Newsbtc.com"},"title":"What Is Bitcoin? Crypto Featured as Category on Jeopardy","url":"https:\/\/www.newsbtc.com\/2018\/12\/01\/what-is-bitcoin-crypto-featured-as-category-on-jeopardy\/","urlToImage":"https:\/\/www.newsbtc.com\/wp-content\/uploads\/2018\/11\/Bitcoin-Crudele.jpg","relevancy":54},{"author":"Lawrence Abrams","content":"Been a pretty interesting week when it comes to ransomware. First, we had two Iranians who were indicted by the U.S. government for their involvement in the SamSam operation. Then, the U.S. government, for the first time, attributed two Iran-based individuals… [+3494 chars]","description":"Been a pretty interesting week when it comes to ransomware. We had two Iranians who were indicted by the U.S. government for their involvement in the SamSam operation. We also had two bitcoin addresses used by ransomware added to the U.S. sanctions list, so t…","publishedAt":"2018-12-01T03:00:43Z","source":{"id":null,"name":"Bleepingcomputer.com"},"title":"The Week in Ransomware - November 30th 2018 - Indictments, Sanctions, & More","url":"https:\/\/www.bleepingcomputer.com\/news\/security\/the-week-in-ransomware-november-30th-2018-indictments-sanctions-and-more\/","urlToImage":"https:\/\/www.bleepstatic.com\/images\/news\/web-browsers\/firefox\/DoH\/sdn-list.jpg","relevancy":22},{"author":"Tim_K","content":"Are you a true IT support person? Meaning, do you look for ways to slack off on the job? Here's some of my finest moments: I've been doing desktop support jobs since 2012. in 2017 I finally started getting into better data center and eventually network admin … [+2829 chars]","description":"How well do you slack off at your IT job? - posted in General Chat: Are you a true IT support person?  Meaning, do you look for ways to slack off on the job?  Heres some of my finest moments:\n \nIve been doing desktop support jobs since 2012.  in 2017 I finall…","publishedAt":"2018-12-01T05:26:32Z","source":{"id":null,"name":"Bleepingcomputer.com"},"title":"How well do you slack off at your IT job?","url":"https:\/\/www.bleepingcomputer.com\/forums\/t\/687552\/how-well-do-you-slack-off-at-your-it-job\/","urlToImage":"https:\/\/www.bleepingcomputer.com\/forums\/public\/style_images\/master\/meta_image.png","relevancy":60},{"author":null,"content":"An investigator who helped catch two hackers in Iran who made a $20,000 ransom demand from the University of Calgary says it was a sophisticated operation. \"They would use encryption to conceal themselves. They used Tor and Bitcoin to allow for payments that … [+1858 chars]","description":"“They would use encryption to conceal themselves. They used Tor and Bitcoin to allow for payments that could not be easily traced,” said James Silver, deputy chief for litigation in the computer crime and intellectual property section of the U.S. Department o…","publishedAt":"2018-12-01T05:58:00Z","source":{"id":"cbc-news","name":"CBC News"},"title":"Hackers used sophisticated operation to target U of C in 2016","url":"https:\/\/www.cbc.ca\/news\/canada\/calgary\/calgary-university-ransom-hacker-1.4927996","urlToImage":"https:\/\/i.cbc.ca\/1.4888302.1541107180!\/fileImage\/httpImage\/image.jpg_gen\/derivatives\/16x9_620\/hands-on-keyboard.jpg","relevancy":49},{"author":null,"content":"For decades, American public schools included a course on \"civics\" as an integral and fundamental part of their curriculum. Civics teaches what it is to be a citizen; how government is structured, organized, and perpetuated; the history of the country and its… [+10434 chars]","description":"We live in the greatest country in the world. Fight for it.","publishedAt":"2018-12-01T06:00:00Z","source":{"id":null,"name":"Americanthinker.com"},"title":"10 Ways to Be a Good Citizen...and Fight Bad Ones","url":"https:\/\/www.americanthinker.com\/articles\/2018\/12\/10_ways_to_be_a_good_citizenand_fight_bad_ones.html","urlToImage":"https:\/\/www.americanthinker.com\/images\/bucket\/2018-11\/210629.jpg","relevancy":43},{"author":"Dalmas Ngetich","content":"After severe draw downs that has so far clipped investor confidence, the founder of Binance Changpeng Zhao is confident of what next year holds. Of course much has been talked about entry of institutional investors and facilitatorsread Fidelity, NASDAQ and ot… [+3283 chars]","description":"After severe draw downs that has so far clipped investor confidence, the founder of Binance Changpeng Zhao is confident of what next year holds. Of course much has been talked about entry of institutional investors and facilitators—read Fidelity, NASDAQ and o…","publishedAt":"2018-12-01T07:21:52Z","source":{"id":null,"name":"Newsbtc.com"},"title":"BTC\/USD Price Analysis: “I want People to Think Binance as a Verb” says CZ","url":"https:\/\/www.newsbtc.com\/2018\/12\/01\/bitcoin-price-analysis-google-binance-verb-changpeng-zhao\/","urlToImage":"https:\/\/www.newsbtc.com\/wp-content\/uploads\/2018\/08\/techanalysis-btc9.jpg","relevancy":28},{"author":"Cointelegraph By Rakesh Upadhyay","content":null,"description":"Some say the current pullback in the market is a dead cat bounce, while others say it is the start of a base building process. Let’s see what the market says!","publishedAt":"2018-12-01T07:37:00Z","source":{"id":null,"name":"Cointelegraph.com"},"title":"Bitcoin, Ripple, Ethereum, Bitcoin Cash, Stellar, EOS, Litecoin, Cardano, Monero, TRON: Price Analysis, December 1","url":"https:\/\/cointelegraph.com\/news\/bitcoin-ripple-ethereum-bitcoin-cash-stellar-eos-litecoin-cardano-monero-tron-price-analysis-december-1","urlToImage":"https:\/\/images.cointelegraph.com\/images\/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy84YzY3NTcwZWU0ZDFlYTAwYjg2NTU4OWI4NWNlYWM3Zi5qcGc=.jpg","relevancy":9},{"author":"Dalmas Ngetich","content":"Overly, market participants are apprehensive and after 11 months of straight losses, traders are cautious to commit until clear bull signals print. Stellar Lumens look likely to expand thanks to rejection of lower lows below 15 cents. Meanwhile, the uncertain… [+5471 chars]","description":"Overly, market participants are apprehensive and after 11 months of straight losses, traders are cautious to commit until clear bull signals print. Stellar Lumens look likely to expand thanks to rejection of lower lows below 15 cents. Meanwhile, the uncertain…","publishedAt":"2018-12-01T07:48:28Z","source":{"id":null,"name":"Newsbtc.com"},"title":"Altcoins Price Analysis: Dan Larimer Project Hopping Ruffling for EOS Investors","url":"https:\/\/www.newsbtc.com\/2018\/12\/01\/altcoins-price-analysis-dan-larimer-project-hopping-ruffling-eos-investors\/","urlToImage":"https:\/\/www.newsbtc.com\/wp-content\/uploads\/2018\/08\/techanalysis-alts5.jpg","relevancy":30},{"author":"Reuters, AFP, Entertainment Desk, AFP, Entertainment Desk, AFP, Reuters., Entertainment Desk, APP, Our Correspondent","content":"A copy of bitcoin standing on PC motherboard is seen in this illustration picture, October 26, 2017. PHOTO: REUTERS LONDON: Bitcoin fell as much as 7 per cent on Friday BTC=BTSP, heading towards a recent one-year low in a broad-based selloff in cryptocurrenci… [+622 chars]","description":"Heading towards a recent one-year low in a broad-based selloff in cryptocurrencies The post Bitcoin falls over 7 per cent appeared first on The Express Tribune.","publishedAt":"2018-12-01T08:14:29Z","source":{"id":null,"name":"Tribune.com.pk"},"title":"Bitcoin falls over 7 per cent","url":"https:\/\/tribune.com.pk\/story\/1858125\/8-bitcoin-falls-over-7-per-cent\/","urlToImage":"https:\/\/c.tribune.com.pk\/2018\/12\/1858125-download-1543651793-617-640x480.jpg","relevancy":14},{"author":"Getty Images","content":"NEW YORK: Speculators' net long bets on the US dollar rose in the latest week to the largest position since December 2016, according to calculations by Reuters and Commodity Futures Trading Commission data released on Friday. The value of the net long dollar … [+2614 chars]","description":"​​The value of the net long dollar position was $29.53 billion in the week ended Nov. 27.","publishedAt":"2018-12-01T08:22:02Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"Speculators' net long dollar bets at highest since December 2016","url":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/speculators-net-long-dollar-bets-at-highest-since-december-2016\/articleshow\/66893691.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66893700,width-1070,height-580,imgsize-849018,overlay-etmarkets\/photo.jpg","relevancy":56},{"author":"","content":"After reports of North Koreans using Bitcoin to evade sanctions and hackers involved in stealing half a billion dollars in cryptos from exchanges emerged, now experts say, they are targeting individual investors. North Korean hackers have taken to stealing cr… [+1754 chars]","description":"After reports of North Koreans using Bitcoin to evade sanctions and hackers involved in stealing half a billion dollars in cryptos from exchanges emerged, now experts say, they are targeting individual investors. North Korean hackers have taken to stealing cr…","publishedAt":"2018-12-01T08:23:00Z","source":{"id":null,"name":"Brica.de"},"title":"North Korean hackers are coming for your bitcoin","url":"https:\/\/brica.de\/alerts\/alert\/public\/1238695\/north-korean-hackers-are-coming-for-your-bitcoin\/","urlToImage":null,"relevancy":44},{"author":"Samuel Potter, Eddie van der Walt & Vildana Hajric, Bloomberg","content":"London\/New York: US stocks posted the strongest rally in eight months on Wednesday, just a few days after the largest Bitcoin slump since February. That followed the biggest crude-oil drop for three years. In October, tech shares had their worst day since 201… [+4664 chars]","description":"People may just need to get some perspective. Turbulence in today’s markets is a blip compared to the past decade","publishedAt":"2018-12-01T08:33:44Z","source":{"id":null,"name":"Livemint.com"},"title":"Yes, market moves are more extreme. But it’s not the apocalypse","url":"https:\/\/www.livemint.com\/Money\/nJX42VpwLwg2BEW26FGIkL\/Yes-market-moves-are-more-extreme-But-its-not-the-apocaly.html","urlToImage":"https:\/\/www.livemint.com\/rf\/Image-621x414\/LiveMint\/Period2\/2018\/12\/03\/Photos\/Processed\/jeromepowell-kcRC--621x414@LiveMint.jpg","relevancy":50},{"author":"Dalmas Ngetich","content":"Latest Tron News The Tron network describes itself as a protocol that is laying down the infrastructure for a truly decentralized internet. Like other smart contracting and dApp development platforms, it relies on blockchain. Whats more, the team behind this … [+4029 chars]","description":"Latest Tron News The Tron network describes itself as a protocol that is laying down the infrastructure for a truly decentralized internet. Like other smart contracting and dApp development platforms, it relies on blockchain. What’s more, the team behind this…","publishedAt":"2018-12-01T08:38:55Z","source":{"id":null,"name":"Newsbtc.com"},"title":"Tron Price Analysis: TRX\/USD Bear Breakout Pattern, Liquidation at 1.5 Cents","url":"https:\/\/www.newsbtc.com\/2018\/12\/01\/tron-price-analysis-trx-usd-bear-breakout-pattern-liquidation-1-5-cents\/","urlToImage":"https:\/\/www.newsbtc.com\/wp-content\/uploads\/2018\/08\/techanalysis-trx2.jpg","relevancy":52},{"author":"Martin Young","content":"Crypto markets predictably dumping this weekend, Bitcoin SV, Cardano and Neo getting hurt. As predicted crypto markets have dumped again after a few days of solid gains and the dead cat has bounced. Over $10 billion has flooded out wiping out all progress mad… [+1962 chars]","description":"FOMO Moments Crypto markets predictably dumping this weekend, Bitcoin SV, Cardano and Neo getting hurt. As predicted crypto markets have dumped again after a few days of solid gains and the dead cat has bounced. Over $10 billion has flooded out wiping out all…","publishedAt":"2018-12-01T09:00:46Z","source":{"id":null,"name":"Newsbtc.com"},"title":"Cryptocurrency Market Update: $10 Billion Dumped as The Dead Cat Bounces","url":"https:\/\/www.newsbtc.com\/2018\/12\/01\/cryptocurrency-market-update-10-billion-dumped-as-the-dead-cat-bounces\/","urlToImage":"https:\/\/www.newsbtc.com\/wp-content\/uploads\/2018\/06\/bearchart.jpg","relevancy":24},{"author":"Mfonobong Nsehe, Contributor, Mfonobong Nsehe, Contributor https:\/\/www.forbes.com\/sites\/mfonobongnsehe\/","content":"Share to facebook Share to twitter Share to linkedin Blockchain, Network Server, Technology, Bitcoin, Biometrics Getty Riyada Group, a Bahraini diversified conglomerate, is partnering with AVC Global, a Washington-based agricultural value chain company, to de… [+8073 chars]","description":"Riyada Group off Bahrain is partnering AVC Global to create an African agricultural supply blockchain","publishedAt":"2018-12-01T09:30:00Z","source":{"id":null,"name":"Forbes.com"},"title":"Riyada Group Partners AVC Global To Create An African Agricultural Supply Blockchain Company","url":"https:\/\/www.forbes.com\/sites\/mfonobongnsehe\/2018\/12\/01\/riyada-group-partners-avc-global-to-create-an-african-agricultural-supply-blockchain-company\/","urlToImage":"https:\/\/thumbor.forbes.com\/thumbor\/600x315\/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1072325336%2F960x0.jpg%3Ffit%3Dscale","relevancy":17},{"author":"Bernard Lunn","content":"How many times have you read one of our posts and thought I would like to pick up the phone and talk to the person with that knowledge and network. Well now you can. You can book one hour for CHF 380 by simply sending an email to our Chief Commercial Officer … [+3832 chars]","description":"How many times have you read one of our posts and thought “I would like to pick up the phone and talk to the person with that knowledge and network”. Well now you can. You can book one hour for CHF 380 by simply sending an email to our Chief Commercial Office…","publishedAt":"2018-12-01T10:00:34Z","source":{"id":null,"name":"Dailyfintech.com"},"title":"Announcing the Daily Fintech Book an Expert for an Hour Service","url":"https:\/\/dailyfintech.com\/2018\/12\/01\/announcing-the-daily-fintech-book-an-expert-for-an-hour-service\/","urlToImage":"https:\/\/fintech4us.files.wordpress.com\/2018\/10\/cropped-dailyfintech_logo_blue_2016-04-14-01.png","relevancy":55},{"author":"Bernard Lunn","content":"People who geek out on code is law and law is code (I plead guilty as charged your honour), will love this. Busy entrepreneurs and executives may want to jump to the practical takeaway about international arbitration clauses. The problem today is summed in th… [+4190 chars]","description":"People who geek out on code is law and law is code (I plead “guilty as charged your honour”), will love this. Busy entrepreneurs and executives may want to jump to the practical takeaway about international arbitration clauses. The problem today is summed in …","publishedAt":"2018-12-01T10:10:29Z","source":{"id":null,"name":"Dailyfintech.com"},"title":"From Treaty of Westphalia (start of national sovereignty) to global Blockchain governance to a more practical outcome = arbitration clauses","url":"https:\/\/dailyfintech.com\/2018\/12\/01\/37526\/","urlToImage":"https:\/\/fintech4us.files.wordpress.com\/2018\/12\/peace_of_westphalia_treaty_of_osnabrucc88ck.jpg","relevancy":48},{"author":"By EYTAN HALON","content":"X Dear Reader, As you can imagine, more people are reading The Jerusalem Post than ever before. Nevertheless, traditional business models are no longer sustainable and high-quality publications, like ours, are being forced to look for new ways to keep going. … [+3514 chars]","description":"\"In an increasingly insecure digital world, where hackers in all corners of the globe are out to steal whatever they can, consumers need a product that gives them confidence their data is safe.\"","publishedAt":"2018-12-01T10:35:15Z","source":{"id":"the-jerusalem-post","name":"The Jerusalem Post"},"title":"Israel-based Sirin Labs unveils 'world's first blockchain smartphone'","url":"https:\/\/www.jpost.com\/Israel-News\/Israel-based-Sirin-Labs-unveils-worlds-first-blockchain-smartphone-573260","urlToImage":"https:\/\/images.jpost.com\/image\/upload\/f_auto,fl_lossy\/t_Article2016_ControlFaceDetect\/432346","relevancy":47},{"author":"Tom McKay","content":"Bitcoin, as well as smaller cryptocurrencies like XRP and ether, had a terrible November that saw $US70 ($96) billion in value wiped off the market, CNBC reported on Friday. Bitcoin closed at $US3878 ($5304), well below $US6000 ($8206), which proponents had l… [+3112 chars]","description":"Bitcoin, as well as smaller cryptocurrencies like XRP and ether, had a terrible November that saw $US70 ($96) billion in value wiped off the market, CNBC reported on Friday. More »","publishedAt":"2018-12-01T11:00:00Z","source":{"id":null,"name":"Gizmodo.com.au"},"title":"Bitcoin, And Cryptocurrency In General, Had A Terrible November","url":"https:\/\/www.gizmodo.com.au\/2018\/12\/bitcoin-and-cryptocurrency-in-general-had-a-terrible-november\/","urlToImage":"https:\/\/i.kinja-img.com\/gawker-media\/image\/upload\/c_lfill,w_768,q_90\/nohdjhahrp47nwogocku.jpg","relevancy":11},{"author":"Detroit Free Press, JC Reindl, Detroit Free Press","content":"There are fewer and fewer businesses that only take cash. JC Reindl, Detroit Free Press None of them accept Bitcoin, either Dutch Girl Donuts on Woodward Avenue in Detroit, Tuesday, Nov. 27, 2018. (Photo: Junfu Han, Detroit Free Press) Buy Photo Admission is … [+9227 chars]","description":"There is a dwindling number of businesses in metro Detroit that do not take credit cards and require payment in cash.","publishedAt":"2018-12-01T11:00:01Z","source":{"id":null,"name":"Freep.com"},"title":"No credit cards at these 10 cash-only businesses in metro Detroit","url":"https:\/\/www.freep.com\/story\/money\/business\/2018\/12\/01\/cash-only-businesses-detroit\/2142238002\/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https:\/\/www.gannett-cdn.com\/presto\/2018\/11\/30\/PDTF\/414785bc-bc93-49c6-a9be-3ef7767cf1c2-11272018_cashonlybiz-7.jpg?crop=2399,1343,x0,y0&width=3200&height=1680&fit=bounds","relevancy":59},{"author":"Shaun Nichols","content":"Roundup November ended with a week of medical mishaps, near disaster at Dell, and the introduction of Pesky Pepper. Here are a few more bits that went under the radar. Researchers with Dr Web took credit for the discovery of Linux.BtcMine.174. If the malware … [+6917 chars]","description":"Plus, South Carolina convicts go catfishing Roundup November ended with a week of medical mishaps, near disaster at Dell, and the introduction of Pesky Pepper.… <!--#include virtual='\/data_centre\/_whitepaper_textlinks_top.html' -->","publishedAt":"2018-12-01T11:01:13Z","source":{"id":null,"name":"Theregister.co.uk"},"title":"AWS has a security hub, Open SSL has a new license, London has a problem with cryptocoins, and more","url":"https:\/\/www.theregister.co.uk\/2018\/12\/01\/security_roundup_301118\/","urlToImage":"https:\/\/regmedia.co.uk\/2016\/06\/20\/london_defence_images_database.jpg","relevancy":15},{"author":"Rachel Rose O'Leary","content":"Is this really what Satoshi expected 10 years ago? That was the question asked by activist Pavol Luptak, at the opening of a new centre for crypto-anarchy the Paralelni Polis in Bratislava, Slovakia in October. Citing new surveillance infrastructures, relentl… [+10227 chars]","description":"A new centre for \"crypto-anarchy\" based in Slovakia is pushing for a return to what they believe are the technology's core political tenets.","publishedAt":"2018-12-01T11:15:20Z","source":{"id":null,"name":"Coindesk.com"},"title":"Crypto Anarchists Are Building Tools to Resist the State in Eastern Europe","url":"https:\/\/www.coindesk.com\/crypto-anarchists-are-building-tools-to-resist-the-state-in-eastern-europe","urlToImage":"https:\/\/www.coindesk.com\/wp-content\/uploads\/2018\/11\/PP2.jpg","relevancy":16},{"author":"CanonChain","content":"HANGZHOU, China, Dec. 1, 2018 \/PRNewswire\/ -- On November 28, 2018, Dr. Chong Li, Chief Architect and Head of Research at CanonChain, announced plans to launch CanonChain MainNet by the end of the year. Under the protocol of CanonChain, a decentralized superc… [+4478 chars]","description":"HANGZHOU, China, Dec. 1, 2018 \/PRNewswire\/ -- On November 28, 2018, Dr. Chong Li, Chief Architect and Head of Research at CanonChain, announced plans to launch CanonChain MainNet by the end of the year. Under the protocol of CanonChain, a decentralized superc…","publishedAt":"2018-12-01T11:22:00Z","source":{"id":null,"name":"Prnewswire.com"},"title":"CanonChain MainNet Launched by the end of 2018","url":"https:\/\/www.prnewswire.com\/news-releases\/canonchain-mainnet-launched-by-the-end-of-2018-300758587.html","urlToImage":"\/content\/dam\/prnewswire\/common\/prn_facebook_sharing_logo.jpg","relevancy":58},{"author":null,"content":"HANGZHOU, China, Dec. 1, 2018 \/PRNewswire\/ -- On November 28, 2018, Dr. Chong Li, Chief Architect and Head of Research at CanonChain, announced plans to launch CanonChain MainNet by the end of the year. Under the protocol of CanonChain, a decentralized superc… [+4760 chars]","description":"HANGZHOU, China, Dec. 1, 2018 \/PRNewswire\/ -- On November 28, 2018, Dr. Chong Li, Chief Architect and Head of Research at CanonChain, announced plans to launch CanonChain MainNet by the end of the year. Under the protocol of CanonChain, a decentralized superc…","publishedAt":"2018-12-01T11:22:39Z","source":{"id":null,"name":"Sys-con.com"},"title":"CanonChain MainNet Launched by the end of 2018","url":"http:\/\/news.sys-con.com\/node\/4352741","urlToImage":"","relevancy":64},{"author":"Andrew Hecht","content":"The Story of This Week: Chairman Powell Changes His Tune - the Dollar Index Backs Off Its High After months of taking a hawkish position when it comes to tightening credit, the Chairman of the U.S. Federal Reserve seemed to backtrack last week in a speech bef… [+11376 chars]","description":"It’s all about trade and Argentina for the coming week. The dollar remains around the 97 level despite comments by Fed Chairman Powell. Platinum back below $800","publishedAt":"2018-12-01T11:30:00Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"Commodities Recap For The Week Of Nov. 30, 2018","url":"https:\/\/seekingalpha.com\/article\/4225726-commodities-recap-week-nov-30-2018","urlToImage":"https:\/\/static1.seekingalpha.com\/images\/marketing_images\/industry_construction\/commodities4_min.jpeg","relevancy":62},{"author":"Douglas A. McIntyre","content":"AT&amp;T Inc (NYSE: T) will launch a three tiered streaming service via its Time Warner division. According to The Wall Street Journal: AT&amp;T Inc., trying to reassure investors it can capitalize on its big acquisition of Time Warner, said it plans to offer… [+1643 chars]","description":"Source: Ethan Miller \/ Getty ImagesAT&T Inc (NYSE: T) will launch a three tiered streaming service via its Time Warner division. According to The Wall Street Journal: AT&T Inc., trying to reassure investors it can capitalize on its big acquisition of Time War…","publishedAt":"2018-12-01T11:31:14Z","source":{"id":null,"name":"247wallst.com"},"title":"4 Most Important Things In Business Today","url":"http:\/\/247wallst.com\/media\/2018\/12\/01\/4-most-important-things-in-business-today-3\/","urlToImage":"https:\/\/s2.wp.com\/wp-content\/themes\/vip\/247wallst\/images\/247-50x50.png","relevancy":23},{"author":"Leigh Cuen","content":"Its been a long journey for Alan Lane since the Silvergate Bank CEO bought his first bitcoin in 2013. That was around the time his small, deposit-hungry bank, based in La Jolla, California, took on its first crypto exchange as a client. It was a gutsy move fo… [+4576 chars]","description":"Silvergate Bank CEO Alan Lane shared his approach to serving the cryptocurrency industry with bankers at the Block FS conference.","publishedAt":"2018-12-01T12:00:21Z","source":{"id":null,"name":"Coindesk.com"},"title":"How Silvergate Became the Leading Bank for Crypto Startups","url":"https:\/\/www.coindesk.com\/silvergate-bank-coinbase-bitcoin-crypto-startups","urlToImage":"https:\/\/www.coindesk.com\/wp-content\/uploads\/2018\/11\/IMG_8049.jpg","relevancy":7},{"author":"Martin Young","content":"Bitcoin has just emerged from its worst month in terms of price declines for seven years. The big daddy of crypto has shed almost 40% in this one month alone as it pulled the entire crypto market down to new yearly lows. Starting out at over $6,500 on Novembe… [+2094 chars]","description":"Bitcoin has just emerged from its worst month in terms of price declines for seven years. The big daddy of crypto has shed almost 40% in this one month alone as it pulled the entire crypto market down to new yearly lows. Bitcoin Dumps Over a Third of its Valu…","publishedAt":"2018-12-01T12:00:48Z","source":{"id":null,"name":"Newsbtc.com"},"title":"November Has Been Bitcoin’s Worst Month for Seven Years","url":"https:\/\/www.newsbtc.com\/2018\/12\/01\/november-has-been-bitcoins-worst-month-for-seven-years\/","urlToImage":"https:\/\/www.newsbtc.com\/wp-content\/uploads\/2018\/11\/bitcoincrash2.jpg","relevancy":18},{"author":"Michael Barnard","content":"CleanTechnica Published on December 1st, 2018 | by Michael Barnard 0 December 1st, 2018 by Michael Barnard Along with our regular daily clean tech news coverage, CleanTechnica also produces in-depth reports on various aspects of clean energy and clean transpo… [+13372 chars]","description":"It’s safe to say that cleantech is going to involve blockchain and similar distributed ledger approaches. And it’s also safe to say that each of the technologies and approaches represented here have better and worse uses. If someone tells you that the answer …","publishedAt":"2018-12-01T12:00:52Z","source":{"id":null,"name":"Cleantechnica.com"},"title":"Major Blockchain Technologies, Part 2 Of 2 (Blockchain Report Excerpt)","url":"https:\/\/cleantechnica.com\/2018\/12\/01\/major-blockchain-technologies-part-2-blockchain-report-excerpt\/","urlToImage":"https:\/\/cleantechnica.com\/files\/2018\/06\/Blockchain-x-Cleantech-Report-CleanTechnica.png","relevancy":51},{"author":"Beldex","content":"HONG KONG, Dec. 1, 2018 \/PRNewswire\/ -- In the constant effort to stay on top of the crypto game, Beldex has yet again done what other cryptocurrency companies have failed to do. Beldex has gained the trust of the crypto community by exhibiting great potentia… [+3378 chars]","description":"HONG KONG, Dec. 1, 2018 \/PRNewswire\/ -- In the constant effort to stay on top of the crypto game, Beldex has yet again done what other cryptocurrency companies have failed to do. Beldex has gained the trust of the crypto community by exhibiting great potentia…","publishedAt":"2018-12-01T12:11:00Z","source":{"id":null,"name":"Prnewswire.com"},"title":"Beldex Raises The Bar For Crypto Organisations","url":"https:\/\/www.prnewswire.com\/news-releases\/beldex-raises-the-bar-for-crypto-organisations-300758543.html","urlToImage":"\/content\/dam\/prnewswire\/common\/prn_facebook_sharing_logo.jpg","relevancy":61},{"author":null,"content":"HONG KONG, Dec. 1, 2018 \/PRNewswire\/ -- In the constant effort to stay on top of the crypto game, Beldex has yet again done what other cryptocurrency companies have failed to do. Beldex has gained the trust of the crypto community by exhibiting great potentia… [+3660 chars]","description":"HONG KONG, Dec. 1, 2018 \/PRNewswire\/ -- In the constant effort to stay on top of the crypto game, Beldex has yet again done what other cryptocurrency companies have failed to do. Beldex has gained the trust of the crypto community by exhibiting great potentia…","publishedAt":"2018-12-01T12:11:25Z","source":{"id":null,"name":"Sys-con.com"},"title":"Beldex Raises The Bar For Crypto Organisations","url":"http:\/\/news.sys-con.com\/node\/4352743","urlToImage":"","relevancy":63},{"author":"Katherine Mangu-Ward","content":"We're smack in the middle Reason 's webathon. We've already met one of our matching grants. (Thanks so much!) But we have another matching grant that's specifically for new donors or people who increase their donations from the previous year. So if you've nev… [+2473 chars]","description":"Plus, donate to find out the secrets behind my cryptic tweets.","publishedAt":"2018-12-01T13:00:00Z","source":{"id":null,"name":"Reason.com"},"title":"No Other Magazine Will Help You Choose a School System AND Hire an Escort: Support Reason !","url":"https:\/\/reason.com\/blog\/2018\/12\/01\/no-other-magazine-will-help-you-choose-a","urlToImage":"https:\/\/d1jn4vzj53eli5.cloudfront.net\/db\/1543592546782.jpg","relevancy":36},{"author":"BambouClub","content":"For example the Dec18 6250 Put did 18x from 4 November to 26 November (so why is NO ONE on Crypto Twitter talking about Bitcoin Options???): Sign up to Deribit to trade Bitcoin Options. Use this link for reduced fees and to receive your affiliate code. This i… [+6397 chars]","description":"This is Part 1 of a 2-part Primer to Trading Bitcoin Options. It is about buying Bitcoin Options. Buying Options is a limited risk trade.","publishedAt":"2018-12-01T13:41:30Z","source":{"id":null,"name":"Hackernoon.com"},"title":"Trading Bitcoin Options at Deribit (Part 1)","url":"https:\/\/hackernoon.com\/trading-bitcoin-options-at-deribit-part-1-155e9b7fc5dc","urlToImage":"https:\/\/cdn-images-1.medium.com\/max\/1200\/1*0REAGU5-m-pxTxwER47JCw.png","relevancy":32},{"author":null,"content":"Bitcoin registered its biggest monthly decline in more than seven years as investors reevaluate the prospects of digital money following last year’s euphoria. The biggest cryptocurrency dropped 6.1% to $3 930 on Friday, bringing its monthly loss to 37%. That’… [+860 chars]","description":"Bitcoin registered its biggest monthly decline in more than seven years as investors reevaluate the prospects of digital money following last year’s euphoria.","publishedAt":"2018-12-01T13:49:47Z","source":{"id":null,"name":"Fin24.com"},"title":"Fin24.com | Bitcoin slide makes monthly loss the biggest in seven years","url":"https:\/\/www.fin24.com\/Companies\/ICT\/bitcoin-slide-makes-monthly-loss-the-biggest-in-seven-years-20181201","urlToImage":"http:\/\/cdn.24.co.za\/files\/Cms\/General\/d\/6936\/3e5f132c7a364f09b579f9e3794d37df.jpg","relevancy":53},{"author":"Gerald Fenech, Contributor, Gerald Fenech, Contributor https:\/\/www.forbes.com\/sites\/geraldfenech\/","content":"Share to facebook Share to twitter Share to linkedin Game Theory and Blockchain Supporting Better Banking Networks Shutterstock Banking today is far from what it used to be. Increasingly, in order to power the services that consumers demand, banks need to hav… [+16584 chars]","description":"Modern banking, the type that you access on your phone when you deposit a check with a photo or when you send money using Venmo, often functions according to a Banking as a Service (BaaS) model. We examine how Gaming Theory and Blockchain can support a better…","publishedAt":"2018-12-01T14:00:00Z","source":{"id":null,"name":"Forbes.com"},"title":"How Game Theory and Blockchain Can Help Support a Better Banking Network","url":"https:\/\/www.forbes.com\/sites\/geraldfenech\/2018\/12\/01\/how-game-theory-and-blockchain-can-help-support-a-better-banking-network\/","urlToImage":"https:\/\/thumbor.forbes.com\/thumbor\/600x315\/https%3A%2F%2Fblogs-images.forbes.com%2Fgeraldfenech%2Ffiles%2F2018%2F11%2FAL1-1200x663.jpg","relevancy":21},{"author":null,"content":"The United States Treasury Department broke new ground this week as it included cryptocurrency addresses for two targets of U.S. sanctions related to an Iranian ransomware scheme. The sanctions were placed on two men who allegedly laundered millions in Bitcoi… [+1785 chars]","description":"The United States Treasury Department broke new ground this week as it included cryptocurrency addresses for two targets of U.S. sanctions related to an Iranian ransomware scheme. The sanctions were placed on two men who allegedly laundered millions in Bitcoi…","publishedAt":"2018-12-01T14:22:00Z","source":{"id":null,"name":"Dcebrief.com"},"title":"US Treasury Includes Crypto Address Identifiers in New Sanctions - DCEBrief","url":"https:\/\/dcebrief.com\/us-treasury-includes-crypto-address-identifiers-in-new-sanctions\/","urlToImage":"https:\/\/dcebrief.com\/wp-content\/uploads\/2018\/11\/0-sanctions-iran-1024x683.jpg","relevancy":46},{"author":"Marc Prosser","content":"Ripples of change are starting to spread throughout the $108.9 billion computer gaming industry, as blockchain technology looks set to change core aspects of games enjoyed by 2.2 billion people around the world. Better security as well as new opportunities an… [+6969 chars]","description":"Ripples of change are starting to spread throughout the $108.9 billion computer gaming industry, as blockchain technology looks set to change core aspects of games enjoyed by 2.2 billion people around the world. Better security as well as new opportunities an…","publishedAt":"2018-12-01T15:00:56Z","source":{"id":null,"name":"Singularityhub.com"},"title":"How Blockchain Is Changing Computer Gaming","url":"https:\/\/singularityhub.com\/2018\/12\/01\/how-blockchain-is-changing-computer-gaming-for-the-better\/","urlToImage":"https:\/\/singularityhub.com\/wp-content\/uploads\/2018\/11\/young-gamer-playing-video-game_shutterstock_624801452.jpg","relevancy":19},{"author":"Joseph Young","content":"CCN is expanding. Are you our next full-time journalist from the West Coast USA? Send us your CV and examples here. In the past 24 hours, the cryptocurrency market added $7 billion to its valuation as Bitcoin and Ethereum rebounded by around five percent. Bit… [+3367 chars]","description":"In the past 24 hours, the cryptocurrency market added $7 billion to its valuation as Bitcoin and Ethereum rebounded by around five percent. Bitcoin (BTC) successfully defended a relatively weak support level at $4,000 with strength and Ethereum (ETH) prevente…","publishedAt":"2018-12-01T15:24:22Z","source":{"id":"crypto-coins-news","name":"Crypto Coins News"},"title":"Crypto Market Adds $7 Billion as Bitcoin and Ethereum Rebound by 5%","url":"https:\/\/www.ccn.com\/crypto-market-adds-7-billion-as-bitcoin-and-ethereum-rebound-by-5\/","urlToImage":"https:\/\/www.ccn.com\/wp-content\/uploads\/2018\/12\/ethereum-bitcoin-litecoin.jpg","relevancy":5},{"author":"EditorDavid","content":"\"Bitcoin miners hit hard by the cryptocurrency's crash may be throwing in the towel,\" reports Bloomberg: The Bitcoin network's hash rate, one way of gauging the computing power dedicated to mining the digital currency, dropped about 24 percent from an all-tim… [+1652 chars]","description":"\"Bitcoin miners hit hard by the cryptocurrency's crash may be throwing in the towel,\" reports Bloomberg: The Bitcoin network's hash rate, one way of gauging the computing power dedicated to mining the digital currency, dropped about 24 percent from an all-tim…","publishedAt":"2018-12-01T15:34:00Z","source":{"id":null,"name":"Slashdot.org"},"title":"Bitcoin Miners Bail, While Cryptocurrency Capitalization Drops 83% Since January","url":"https:\/\/news.slashdot.org\/story\/18\/12\/01\/0414201\/bitcoin-miners-bail-while-cryptocurrency-capitalization-drops-83-since-january","urlToImage":"https:\/\/a.fsdn.com\/sd\/topics\/money_64.png","relevancy":1},{"author":"Jennifer Kite-Powell, Contributor, Jennifer Kite-Powell, Contributor https:\/\/www.forbes.com\/sites\/jenniferhicks\/","content":"Share to facebook Share to twitter Share to linkedin Solar Bankers uses blockchain technology to develop digitalized electricity systems. Decentralised energy system on the foundation of new solar modules can create highly efficient energy, even in places wit… [+16657 chars]","description":"Can blockchain technologies help save the environment? These experts weigh in.","publishedAt":"2018-12-01T15:41:00Z","source":{"id":null,"name":"Forbes.com"},"title":"Can Blockchain Technology Save The Environment?","url":"https:\/\/www.forbes.com\/sites\/jenniferhicks\/2018\/12\/01\/can-blockchain-technology-save-the-environment\/","urlToImage":"https:\/\/thumbor.forbes.com\/thumbor\/600x315\/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F5a87de83d7c147eaa2674329528f80fb%2F960x0.jpg%3Ffit%3Dscale","relevancy":29},{"author":"Chuck Jaffe","content":"There is no denying that the recent Bitwise survey showing that more than 80 percent of financial advisers had received questions from clients about crypto is one of many polls showing that average folks want to figure crypto out and profit from it. No one ha… [+5866 chars]","description":"There is no denying that the recent Bitwise survey showing that more than 80 percent of financial advisers had received questions from clients about crypto is one of many polls showing that average folks want to figure crypto out and profit from it.","publishedAt":"2018-12-01T16:00:00Z","source":{"id":null,"name":"Seattletimes.com"},"title":"Now that bitcoin prices are ugly, decide if it’s worth an investment","url":"https:\/\/www.seattletimes.com\/business\/now-that-bitcoin-prices-are-ugly-decide-if-its-worth-an-investment\/","urlToImage":"https:\/\/www.seattletimes.com\/wp-content\/themes\/st_refresh\/img\/st-meta-facebook.png","relevancy":39},{"author":"Logan Booker","content":"On November 20, developer Ayrton Sparling posted an issue on the GitHub repo for \"event-stream\" — a JavaScript package that enjoys 1-1.5 million downloads per week and is used in some rather high-profile projects. The issue, simply titled \"I don't know what t… [+1358 chars]","description":"On November 20, developer Ayrton Sparling posted an issue on the GitHub repo for \"event-stream\" — a JavaScript package that enjoys 1-1.5 million downloads per week and is used in some rather high-profile projects. The issue, simply titled \"I don't know what t…","publishedAt":"2018-12-01T16:00:34Z","source":{"id":null,"name":"Lifehacker.com.au"},"title":"Bitcoin-Stealing Malware Discovered In Popular JavaScript Package Used By The BBC, Microsoft","url":"https:\/\/www.lifehacker.com.au\/2018\/12\/bitcoin-stealing-malware-discovered-in-popular-javascript-package-linked-to-the-bbc-microsoft\/","urlToImage":"https:\/\/edge.alluremedia.com.au\/m\/l\/2018\/12\/bcoin-768x432.jpg","relevancy":38},{"author":"JakeTheCryptoKing","content":"WePower (WPR) is in the spotlight this week for bridging green energy and blockchain technology. WPR looks like a solid contender to outperform Bitcoin returns in December. Niche Cryptocurrencies Every week provides new opportunities to find undervalued crypt… [+6550 chars]","description":"WePower (WPR) is in the spotlight this week for bridging green energy and blockchain technology. WPR looks like a solid contender to outperform Bitcoin returns in December. Niche Cryptocurrencies Every week provides new opportunities to find undervalued crypt…","publishedAt":"2018-12-01T16:00:37Z","source":{"id":null,"name":"Bitcoinist.com"},"title":"WePower (WPR) – Why It’s Poised to Outmuscle Bitcoin in December","url":"https:\/\/bitcoinist.com\/wepower-wpr-outperform-bitcoin\/","urlToImage":"https:\/\/bitcoinist.com\/wp-content\/uploads\/2018\/07\/isp-windfarm.jpg","relevancy":25},{"author":"Bogdan Petrovan","content":"Hodl (hdl; verb; often written HODL): Slang for holding a cryptocurrency rather than selling it. Can also mean Hold On For Dear Life. Weve seen a few weird and wonderful phones this year, but the Finney is probably the most bizarre yet. The creation of Israel… [+9225 chars]","description":"We’ve seen a few weird and wonderful phones this year, but the Finney is probably the most bizarre yet.","publishedAt":"2018-12-01T16:09:50Z","source":{"id":null,"name":"Androidauthority.com"},"title":"Sirin Finney hands-on: Only for the HODLers","url":"https:\/\/www.androidauthority.com\/sirin-labs-finney-review-930302\/","urlToImage":"https:\/\/cdn57.androidauthority.net\/wp-content\/uploads\/2018\/11\/sirin-finney-sirin-labs-blockchain-phone-android-authority-22-920x470.jpg","relevancy":8},{"author":"Cointelegraph By Helen Partz","content":null,"description":"Crypto markets go green on the first day of December, with Bitcoin breaking and holding the $4,200 threshold.","publishedAt":"2018-12-01T16:39:00Z","source":{"id":null,"name":"Cointelegraph.com"},"title":"Crypto Markets Meet December in Green, Bitcoin Trades Above $4,200","url":"https:\/\/cointelegraph.com\/news\/crypto-markets-meet-december-in-green-bitcoin-trades-above-4-200","urlToImage":"https:\/\/images.cointelegraph.com\/images\/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9iYzFlOTQyZDllOTg0ZWRjYjVlMDI3NjVmYjQ3NWVjMi5qcGc=.jpg","relevancy":13},{"author":"P. H. Madore","content":"CCN is expanding. Are you our next full-time journalist from the West Coast USA? Send us your CV and examples here. Well, heres something we didnt expect this early in the century. Ohio’s state government is now accepting Bitcoin and Bitcoin Cash via its paym… [+3493 chars]","description":"Well, here’s something we didn’t expect this early in the century. Ohio’s state government is now accepting Bitcoin and Bitcoin Cash via its payment portal, serviced by BitPay. As CCN reported: “Ohio will become the first state in the US to officially accept …","publishedAt":"2018-12-01T17:35:57Z","source":{"id":"crypto-coins-news","name":"Crypto Coins News"},"title":"Op-Ed: Ohio’s Crypto Play Proves Bitcoin is Becoming a Currency","url":"https:\/\/www.ccn.com\/op-ed-ohios-crypto-play-proves-bitcoin-is-becoming-a-currency\/","urlToImage":"https:\/\/www.ccn.com\/wp-content\/uploads\/2018\/11\/ohio-bitcoin-crypto-welcome-sign.jpg","relevancy":4},{"author":"Tom McKay","content":"Bitcoin, as well as smaller cryptocurrencies like XRP and ether, had a terrible November that saw $70 billion in value wiped off the market, CNBC reported on Friday. Bitcoin closed at $3,878, well below $6,000, which proponents had long insisted was its floor… [+2985 chars]","description":"Bitcoin, as well as smaller cryptocurrencies like XRP and ether, had a terrible November that saw $70 billion in value wiped off the market, CNBC reported on Friday. Read more...","publishedAt":"2018-12-01T19:00:00Z","source":{"id":null,"name":"Gizmodo.com"},"title":"Bitcoin, and Cryptocurrency in General, Had a Terrible November","url":"https:\/\/gizmodo.com\/bitcoin-and-cryptocurrency-in-general-had-a-terrible-1830795708","urlToImage":"https:\/\/i.kinja-img.com\/gawker-media\/image\/upload\/s--PNvLT0lH--\/c_fill,fl_progressive,g_center,h_900,q_80,w_1600\/nohdjhahrp47nwogocku.jpg","relevancy":0},{"author":"Samantha Chang","content":"CCN is expanding. Are you our next full-time journalist from the West Coast USA? Send us your CV and examples here. German investment firm Xolaris has launched a European private-equity fund focused on bitcoin mining. Xolaris expects to raise $34 million to $… [+4005 chars]","description":"German investment firm Xolaris has launched a European private-equity fund focused on bitcoin mining. Xolaris expects to raise $34 million to $57 million for the four-year project, the company announced in a press release. “Professional investors kept asking …","publishedAt":"2018-12-01T19:05:48Z","source":{"id":"crypto-coins-news","name":"Crypto Coins News"},"title":"German Firm Xolaris Launches Two Bitcoin Mining Investment Funds","url":"https:\/\/www.ccn.com\/german-firm-xolaris-launches-two-bitcoin-mining-investment-funds\/","urlToImage":"https:\/\/www.ccn.com\/wp-content\/uploads\/2018\/12\/germany-flag-map-bitcoin.jpg","relevancy":10},{"author":"Joseph Young","content":null,"description":"Throughout the past eleven months, the Bitcoin price has dropped from $19,500 to $3,000, by nearly 85 percent. The dominant cryptocurrency fell by 85 percent on average in its four past major corrections, so a similar drop from its all-time high was expected …","publishedAt":"2018-12-01T20:07:37Z","source":{"id":"crypto-coins-news","name":"Crypto Coins News"},"title":"Why the Bitcoin Price Could Take a Very Long Time to Reach All-Time High Again","url":"https:\/\/www.ccn.com\/why-the-bitcoin-price-could-take-a-very-long-time-to-reach-all-time-high-again\/","urlToImage":null,"relevancy":6},{"author":"Reuters","content":"By Julia Payne LONDON (Reuters) - Oil majors and trading firms can start finalising crude oil deals on a live blockchain-based platform for the first time, in a move that could revolutionise the market. Commodities trading firms have piloted similar schemes i… [+2413 chars]","description":"By Julia Payne LONDON (Reuters) - Oil majors and trading firms can start finalising crude oil deals on a live blockchain-based platform for the first time, in a move that could revolutionise the market. Commodities trading firms have piloted similar schemes i…","publishedAt":"2018-12-01T20:35:07Z","source":{"id":null,"name":"Firstpost.com"},"title":"Blockchain platform goes live for North Sea crude oil trading","url":"https:\/\/www.firstpost.com\/business\/blockchain-platform-goes-live-for-north-sea-crude-oil-trading-5655901.html","urlToImage":"https:\/\/images.firstpost.com\/wp-content\/uploads\/reuters\/12-2018\/02\/2018-12-01T195531Z_1_LYNXNPEEB02JI_RTROPTP_2_BRITAIN-SCOTLAND-ECONOMY.jpg","relevancy":31},{"author":"Jimmy Aki","content":"CCN is expanding. Are you our next full-time journalist from the West Coast USA? Send us your CV and examples here. Tech giant Asus is now making it possible for gamers to use the excess processing power of their graphics cards to earn some profit from crypto… [+2663 chars]","description":"Tech giant Asus is now making it possible for gamers to use the excess processing power of their graphics cards to earn some profit from crypto mining. In an announcement made on Thursday, the Taiwan-based tech company stated that it has entered into a partne…","publishedAt":"2018-12-01T21:15:19Z","source":{"id":"crypto-coins-news","name":"Crypto Coins News"},"title":"Asus Wants to Let Gamers to Mine Crypto with Idle GPU Power","url":"https:\/\/www.ccn.com\/asus-wants-to-let-gamers-to-mine-crypto-with-idle-gpu-power\/","urlToImage":"https:\/\/www.ccn.com\/wp-content\/uploads\/2018\/11\/asus-gpu-crypto-mining.jpg","relevancy":33},{"author":"EditorDavid","content":"\"[O]n Nov. 26 it was publicly revealed that a widely deployed open-source Node.js programming language module known as event-stream had been injected with malicious code that looked to steal cryptocurrency wallets,\" reports eWeek, adding \"The event-stream lib… [+2044 chars]","description":"\"[O]n Nov. 26 it was publicly revealed that a widely deployed open-source Node.js programming language module known as event-stream had been injected with malicious code that looked to steal cryptocurrency wallets,\" reports eWeek, adding \"The event-stream lib…","publishedAt":"2018-12-01T21:18:00Z","source":{"id":null,"name":"Slashdot.org"},"title":"Node.js Event-Stream Hack Reveals Open Source 'Developer Infrastructure' Exploit","url":"https:\/\/it.slashdot.org\/story\/18\/12\/01\/2217231\/nodejs-event-stream-hack-reveals-open-source-developer-infrastructure-exploit","urlToImage":"https:\/\/a.fsdn.com\/sd\/topics\/security_64.png","relevancy":40},{"author":"ravenise","content":"Josh Sigurdson talks with Richard Gage AIA of Architects &amp; Engineers For 9\/11 Truth as well as Barbara Honegger who famously exposed the truth behind the Iran Contra scandal in the 1980s as a member of the Reagan White House with her book 'October Surpris… [+2765 chars]","description":"Trump had promised a re-investigation into 911. Evidence debunking the official government lies will be seeing criminal grand jury! LCfor9\/11 got a letter back from a US attorney agreeing to comply with a Federal law requiring submission to a special grand ju…","publishedAt":"2018-12-01T21:58:24Z","source":{"id":null,"name":"Youtube.com"},"title":"MASSIVE Breakthrough In 9\/11 Investigation! - Must WATCH (with Richard Gage & Barbara Honegger)","url":"https:\/\/www.youtube.com\/watch?v=2V3cfCX1s1Y","urlToImage":"https:\/\/i.ytimg.com\/vi\/2V3cfCX1s1Y\/maxresdefault.jpg","relevancy":45},{"author":"Waqas","content":"The first cable-car service was launched in Moscow this Tuesday, and free rides to and from Luzhniki Stadium were promised to the visitors throughout the first month. Naturally, people were eager to ride the cable-car and thronged the location. However, much … [+2290 chars]","description":"By Waqas The first cable-car service was launched in Moscow this Tuesday, and free rides to and from Luzhniki Stadium were promised to the visitors throughout the first month. Naturally, people were eager to ride the cable-car and thronged the location. Howev…","publishedAt":"2018-12-01T22:07:18Z","source":{"id":null,"name":"Hackread.com"},"title":"Moscow’s cable car service shuts down in 2 days after ransomware attack","url":"https:\/\/www.hackread.com\/moscow-cable-car-service-ransomware-attack\/","urlToImage":"https:\/\/www.hackread.com\/wp-content\/uploads\/2018\/12\/moscow-cable-car-service-ransomware-attack.jpg","relevancy":26},{"author":"Pedro Febrero","content":"CCN is expanding. Are you our next full-time journalist from the West Coast USA? Send us your CV and examples here. The fact that the bitcoin price has been crashing for the past month has led some people to have some hilarious reactions. From rage-quitting c… [+9976 chars]","description":"The fact that the bitcoin price has been crashing for the past month has led some people to have some hilarious reactions. From rage-quitting crypto-trading and investing to astonishing doomsday predictions, it’s really fun to sit back and watch all madness. …","publishedAt":"2018-12-01T22:17:35Z","source":{"id":"crypto-coins-news","name":"Crypto Coins News"},"title":"Bitcoin Opinion: Why Context is Important When Talking about the ‘Crypto Bubble’","url":"https:\/\/www.ccn.com\/bitcoin-opinion-why-context-is-important-when-talking-about-the-crypto-bubble\/","urlToImage":"https:\/\/www.ccn.com\/wp-content\/uploads\/2014\/07\/5-16-12-bubble-pop-copy.jpg","relevancy":12},{"author":"TheInsertus","content":"As the Blockchain revolution rages around us, you may be feeling left behind as the technology and coin values continue to develop at breakneck speed. As budding JavaScript developers, breaking into Blockchain tech is something weve most likely wanted as we d… [+823 chars]","description":"As the Blockchain revolution rages around us, you may be feeling left behind as the technology and coin values continue to develop at breakneck speed. As budding JavaScript developers, breaking into Blockchain tech is something we’ve most likely wanted as we …","publishedAt":"2018-12-01T22:51:58Z","source":{"id":null,"name":"Rlslog.net"},"title":"Learn JavaScript: Build Your Own Blockchain [Video]-P2P","url":"http:\/\/www.rlslog.net\/learn-javascript-build-your-own-blockchain-video-p2p\/","urlToImage":null,"relevancy":42},{"author":"Ana Farr","content":"Bitcoin has come a long way to become the most celebrated and traded cryptocurrency. But as you may already know, its still grappling with many issues the major ones being scalability and privacy. When the concept of digital currencies started to make sense, … [+6492 chars]","description":"Bitcoin has come a long way to become the most celebrated and traded cryptocurrency. But as you may already know, it’s still grappling with many issues the major ones being scalability and privacy. When the concept of digital currencies started to make sense,…","publishedAt":"2018-12-01T23:00:07Z","source":{"id":null,"name":"Bitrebels.com"},"title":"Three Major Bitcoin Improvement Proposals You Should Know","url":"http:\/\/www.bitrebels.com\/business\/three-bitcoin-improvement-proposals\/","urlToImage":"http:\/\/www.bitrebels.com\/wp-content\/uploads\/2018\/12\/bitcoin-improvement-proposal-header-image.jpg","relevancy":20},{"author":"Josiah Wilmoth","content":"CCN is expanding. Are you our next full-time journalist from the West Coast USA? Send us your CV and examples here. Sirin Labs, the blockchain startup funded by nearly $158 million in initial coin offering (ICO) proceeds, has released its much-anticipated blo… [+12152 chars]","description":"Sirin Labs, the blockchain startup funded by nearly $158 million in initial coin offering (ICO) proceeds, has released its much-anticipated “blockchain smartphone,” the FINNEY. The firm unveiled the device on Thursday at a release party in Barcelona, which fe…","publishedAt":"2018-12-01T23:40:31Z","source":{"id":"crypto-coins-news","name":"Crypto Coins News"},"title":"Hands-on with the Sirin Labs FINNEY, the World’s First Crypto-Native Smartphone","url":"https:\/\/www.ccn.com\/hands-on-with-the-sirin-labs-finney-the-worlds-first-crypto-native-smartphone\/","urlToImage":"https:\/\/www.ccn.com\/wp-content\/uploads\/2018\/11\/DSC_0119-1024x678.jpg","relevancy":41},{"author":"Jeff John Roberts","content":"The market for cryptocurrency has seen better times as Bitcoin struggles to stay above $4,000 and crypto hedge funds shut up shop. But one corner of the market seems to be weathering the downturn just fine: Ledger, which makes crypto hardware wallets, says sa… [+1953 chars]","description":"\"I'm happy to report Black Friday '18 was almost on par with Black Friday '17,\" said Pascal Gauthier, President of hardware maker Ledger.","publishedAt":"2018-12-01T23:51:29Z","source":{"id":"fortune","name":"Fortune"},"title":"Crypto Wallet Sales Still Going Strong, Says Ledger CEO","url":"http:\/\/fortune.com\/2018\/12\/01\/ledger-hardware\/","urlToImage":"https:\/\/fortunedotcom.files.wordpress.com\/2018\/12\/screenshot-2018-12-01-18-45-22.png","relevancy":35}]