[{"author":"https:\/\/www.facebook.com\/bbcnews","content":"Image copyright Reuters Image caption Donald Trump has signed a document that reinstates sanctions against Iran The re-imposition of the full panoply of sanctions against Iran that were waived under the Joint Comprehensive Plan of Action (JCPOA) nuclear agree… [+8607 chars]","description":"BBC News Trump re-imposes Iran sanctions: Now what? BBC News The re-imposition of the full panoply of sanctions against Iran that were waived under the Joint Comprehensive Plan of Action (JCPOA) nuclear agreement marks a high-point for President Donald Trump'…","publishedAt":"2018-11-03T00:04:54Z","source":{"id":null,"name":"Bbc.com"},"title":"Trump re-imposes Iran sanctions: Now what? - BBC News","url":"https:\/\/www.bbc.com\/news\/world-middle-east-46075179","urlToImage":"https:\/\/ichef.bbci.co.uk\/news\/1024\/branded_news\/148F7\/production\/_104151248_050339639.jpg","relevancy":16},{"author":"SA Transcripts","content":"DHT Holdings, Inc. (NYSE: DHT ) Q3 2018 Earnings Conference Call November 2, 2018 8:00 AM ET Executives Laila Halvorsen Chief Financial Officer Svein Harfjeld Co-Chief Executive Officer Trygve Munthe Co-Chief Executive Officer Analysts Jon Chappell Evercore R… [+42689 chars]","description":"DHT Holdings, Inc. (NYSE:DHT) Q3 2018 Earnings Conference Call November 2, 2018 8:00 AM ET Executives Laila Halvorsen – Chief Financial Officer Svein Harfjeld –","publishedAt":"2018-11-03T00:07:07Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"DHT Holdings' (DHT) CEO Svein Harfjeld on Q3 2018 Results - Earnings Call Transcript","url":"https:\/\/seekingalpha.com\/article\/4217815-dht-holdings-dht-ceo-svein-harfjeld-q3-2018-results-earnings-call-transcript","urlToImage":"https:\/\/static3.seekingalpha.com\/assets\/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png","relevancy":63},{"author":"No Author, No Author","content":"WASHINGTON The United States said on Friday it will temporarily allow eight importers to keep buying Iranian oil when it reimposes sanctions on Monday to try to force Iran to curb its nuclear, missile and regional activities. Pompeo said he will name the “jur… [+4836 chars]","description":"The United States said on Friday it will temporarily allow eight importers to keep buying Iranian oil when it reimposes sanctions on Monday to try to force","publishedAt":"2018-11-03T00:09:20Z","source":{"id":null,"name":"Japantimes.co.jp"},"title":"U.S. set to give Japan and seven other nations oil waivers as White House reimposes Iran sanctions","url":"https:\/\/www.japantimes.co.jp\/news\/2018\/11\/03\/business\/u-s-give-japan-seven-nations-oil-waivers-iran-sanctions-source\/","urlToImage":"https:\/\/cdn.japantimes.2xx.jp\/wp-content\/uploads\/2018\/11\/b-waivers-a-20181103-870x569.jpg","relevancy":92},{"author":"Shubhajit Roy","content":"Written by Shubhajit Roy | Published: November 3, 2018 6:06:45 am His Twitter post on Friday India is likely to be one of eight countries which can temporarily import oil from Iran post sanctions, sources indicated Friday, after US Secretary of State Michael … [+5833 chars]","description":"US Secretary of State Mike Pompeo said that countries like India, if granted exemption, would be asked to bring down oil imports from Iran to zero in six months","publishedAt":"2018-11-03T00:36:45Z","source":{"id":null,"name":"Indianexpress.com"},"title":"India among eight likely to get Iran oil waiver, US sanctions November 5","url":"https:\/\/indianexpress.com\/article\/world\/india-among-eight-likely-to-get-iran-oil-waiver-us-sanctions-november-5-5432261\/","urlToImage":"https:\/\/images.indianexpress.com\/2018\/11\/trump-759.jpg?w=759","relevancy":3},{"author":"Derrick Penner","content":"Asian oil buyers have increased their purchases of cheap Alberta crude in recent months as the world suppy of grades of heavy oil shrinks, according to industry analysts. “Anybody who can get their hands on Canadian crude is going to want to get their hands o… [+3278 chars]","description":"Geared up for heavy oil, refiners are anxious to get their hands on bitumen to produce products such as asphalt and tar for infrastructure projects.","publishedAt":"2018-11-03T00:41:39Z","source":{"id":null,"name":"Vancouversun.com"},"title":"Chinese buyers ramp up purchases of cheap Alberta bitumen-laden crude","url":"https:\/\/vancouversun.com\/news\/local-news\/chinese-buyers-ramp-up-purchases-of-cheap-alberta-bitumen-laden-crude","urlToImage":"https:\/\/postmediavancouversun2.files.wordpress.com\/2018\/01\/oil-rail.jpg","relevancy":15},{"author":"Tsvetana Paraskova","content":"Most of the world’s top oil trading houses expect oil prices to decline next year as slowing global economic growth and rising oil supply is expected to compensate for fewer Iranian crude barrels on the market, executives at the largest oil traders said at th… [+1932 chars]","description":"Most of the world’s top oil trading houses expect oil prices to decline next year as slowing global economic growth and rising oil supply is expected to compensate for fewer Iranian crude barrels on the market, executives at the largest oil traders said at th…","publishedAt":"2018-11-03T01:00:00Z","source":{"id":null,"name":"Oilprice.com"},"title":"Top Commodity Traders Expect Oil Prices To Drop In 2019","url":"https:\/\/oilprice.com\/Latest-Energy-News\/World-News\/Top-Commodity-Traders-Expect-Oil-Prices-To-Drop-In-2019.html","urlToImage":"https:\/\/d32r1sh890xpii.cloudfront.net\/news\/718x300\/7055d4f6660d0c7bb4832543bb9c64c7.jpg","relevancy":27},{"author":"Myra P. Saefong","content":"The oil market has had nearly six months to assess the possible effect of U.S. sanctions on Iranian oil exports. Surprisingly, the prospect of significantly tighter global supplies has resulted in lower prices. President Donald Trump announced on May 8 that h… [+4162 chars]","description":"As U.S. sanctions finally arrive, prices are down since President Trump’s decision in May. Is that the right move amid tighter supply?","publishedAt":"2018-11-03T01:16:07Z","source":{"id":null,"name":"Barrons.com"},"title":"Oil Market Bet: Iran Sanctions Won’t Boost Prices","url":"https:\/\/www.barrons.com\/articles\/oil-market-bet-iran-sanctions-wont-boost-prices-1541087842","urlToImage":"https:\/\/asset.barrons.com\/img\/barrons\/social_highres.jpg","relevancy":43},{"author":"Gina Heeb","content":"The US will reimpose oil sanctions against Iran on Monday. Eight countries are set to receive sanctions waivers. But they could still end up squeezing global oil supply. In the wake of President Donald Trump’s withdrawal from the Iran nuclear deal earlier thi… [+3384 chars]","description":"In the wake of President Donald Trump’s  withdrawal from the Iran nuclear deal earlier this year, Washington will reinstate more economic penalties against Tehran at midnight on Monday.","publishedAt":"2018-11-03T02:00:00Z","source":{"id":null,"name":"Businessinsider.com.au"},"title":"Here's why Trump wants to shut Iran out of the oil market","url":"https:\/\/www.businessinsider.com.au\/trump-iran-sanctions-oil-explained-2018-11","urlToImage":"https:\/\/static.businessinsider.com\/image\/55a507fc69beddaf0309cb5e-640.jpg","relevancy":72},{"author":"John Kicklighter, Chief Currency Strategist, John Kicklighter","content":"Talking Points: Risk trends pulled out of their October plunge this past week but there are few fundamental rungs for bulls to grab Trade wars returned to the foreground with a confusing view from the White House but other themes present a known quantity Alon… [+7905 chars]","description":"Both the S&P 500 and Dollar put in for tentative reversals this past week, but how committed are these markets to reverse course? With event risk, trade wars, rate decisions and the US election on tap; we are going to find out.","publishedAt":"2018-11-03T02:17:00Z","source":{"id":null,"name":"Dailyfx.com"},"title":"Markets On Edge with Volatility Stoked by the Trade War, Rate Decisions, an Election","url":"https:\/\/www.dailyfx.com\/forex\/video\/daily_news_report\/2018\/11\/03\/Markets-On-Edge-with-Volatility-Supported-by-the-Trade-War-Rate-Decisions-an-Election.html","urlToImage":null,"relevancy":84},{"author":null,"content":"Enbridge Inc. is looking at options to help clear a glut of oil in Western Canada - including reversing a condensate import pipeline - but CEO Al Monaco counselled patience Thursday as all solutions will take time to put in place. The pipeline company reporte… [+240 chars]","description":"Enbridge Inc. is looking at options to help clear a glut of oil in Western Canada - including reversing a condensate import pipeline - but CEO Al Monaco counselled patience Thursday as all solutions will take time to put in place. The pipeline company reporte…","publishedAt":"2018-11-03T02:18:12Z","source":{"id":null,"name":"Topix.com"},"title":"Enbridge CEO counsels patience as western oil glut 'screams' for solutions","url":"http:\/\/www.topix.com\/business\/oil-gas\/2018\/11\/enbridge-ceo-counsels-patience-as-western-oil-glut-screams-for-solutions?fromrss=1","urlToImage":"http:\/\/picproxy.topixcdn.com\/pics\/up-","relevancy":49},{"author":"Gina Chon","content":"WASHINGTON\/DALLAS (Reuters Breakingviews) - Tough talk by the United States on Iran sanctions is butting up against oil economics. Eight countries can temporarily keep importing Iranian oil without defying the restrictions set to go into effect next week. Top… [+2789 chars]","description":"(Reuters Breakingviews) - Tough talk by the United States on Iran sanctions is butting up against oil economics. Eight countries can temporarily keep importing Iranian oil without defying the restrictions set to go into effect next week. Top U.S. diplomat Mik…","publishedAt":"2018-11-03T02:29:46Z","source":{"id":"reuters","name":"Reuters"},"title":"Breakingviews - Tough U.S. Iran sanctions talk meets oil economics","url":"https:\/\/www.reuters.com\/article\/us-usa-iran-breakingviews\/breakingviews-tough-us-iran-sanctions-talk-meets-oil-economics-idUSKCN1N8020","urlToImage":"https:\/\/s4.reutersmedia.net\/resources\/r\/?m=02&d=20181103&t=2&i=1321487558&w=1200&r=LYNXNPEEA201W","relevancy":111},{"author":"insights ias","content":"SECURE SYNOPSIS: 31 OCTOBER 2018 NOTE: Please remember that following answers are NOT model answers. They are NOT synopsis too if we go by definition of the term. What we are providing is content that both meets demand of the question and at the same time giv… [+57606 chars]","description":"SECURE SYNOPSIS: 31 OCTOBER 2018 NOTE: Please remember that following ‘answers’ are NOT ‘model answers’. They are NOT synopsis too if we go by definition of the term. What we are providing is content that both meets demand of the question and at the same time…","publishedAt":"2018-11-03T02:31:25Z","source":{"id":null,"name":"Insightsonindia.com"},"title":"SECURE SYNOPSIS: 31 OCTOBER 2018","url":"http:\/\/www.insightsonindia.com\/2018\/11\/03\/secure-synopsis-31-october-2018\/","urlToImage":null,"relevancy":94},{"author":null,"content":"The United States said on November 2 it will temporarily allow eight importers to keep buying Iranian oil when it re-imposes sanctions on November 5 to try to force Iran to curb its nuclear, missile and regional activities. US Secretary of State Mike Pompeo, … [+4450 chars]","description":"Turkey has been told it will temporarily be allowed to keep buying Iranian oil, its energy minister told reporters, as has Iraq, as long as it does not pay Iran in US dollars","publishedAt":"2018-11-03T02:45:13Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"US allows 8 importers to keep buying Iran oil for now","url":"https:\/\/www.moneycontrol.com\/news\/business\/us-allows-8-importers-to-keep-buying-iran-oil-for-now-3126011.html","urlToImage":"","relevancy":9},{"author":"John Pike","content":"Special Briefing Brian Hook Special Representative for Iran Press Correspondent's Room Washington, DC November 2, 2018 MR HOOK: I'm happy to take questions. And you've heard the Secretary talk. I just (inaudible). QUESTION: What are the eight countries? MR HO… [+16361 chars]","description":"Special Briefing by Brian Hook, Special Representative for Iran","publishedAt":"2018-11-03T02:50:27Z","source":{"id":null,"name":"Globalsecurity.org"},"title":"Briefing With Special Representative for Iran Brian Hook","url":"https:\/\/www.globalsecurity.org\/wmd\/library\/news\/iran\/2018\/iran-181102-state01.htm","urlToImage":null,"relevancy":71},{"author":"John Pike","content":"Special Briefing Michael R. Pompeo Secretary of State Secretary of the Treasury Steven T. Mnuchin Via Teleconference November 2, 2018 MS NAUERT: Thank you, sir. Good morning, everyone, and welcome to today's on-the-record call on the Iran snapback sanctions. … [+20027 chars]","description":"Special Briefing by Michael R. Pompeo, Secretary of State and Secretary of the Treasury Steven T. Mnuchin","publishedAt":"2018-11-03T02:50:27Z","source":{"id":null,"name":"Globalsecurity.org"},"title":"Briefing on Iran Sanctions","url":"https:\/\/www.globalsecurity.org\/wmd\/library\/news\/iran\/2018\/iran-181102-state02.htm","urlToImage":null,"relevancy":59},{"author":"John Pike","content":"Iran Press TV Fri Nov 2, 2018 11:12AM The US administration has agreed to allow eight countries to continue purchasing Iran's crude oil after Washington's sanctions on Tehran take place next Monday, a senior official said Friday. The administration official t… [+2517 chars]","description":"The US administration has agreed to allow eight countries to continue purchasing Iran's crude oil after Washington's sanctions on Tehran take place next Monday, a senior official said Friday.","publishedAt":"2018-11-03T02:50:35Z","source":{"id":null,"name":"Globalsecurity.org"},"title":"US grants waivers to 8 countries importing Iranian oil: Report","url":"https:\/\/www.globalsecurity.org\/wmd\/library\/news\/iran\/2018\/iran-181102-presstv05.htm","urlToImage":null,"relevancy":24},{"author":"John Pike","content":"Mark Najarian November 02, 2018 WASHINGTON -- The United States says that eight \"jurisdictions\" will receive temporary exemptions to sanctions set to be imposed on Iran's oil and financial industries in three days, but that Washington will \"aggressively enfor… [+5005 chars]","description":"The United States says that eight \"jurisdictions\" will receive temporary exemptions to sanctions set to be imposed on Iran's oil and financial industries in three days, but that Washington will \"aggressively enforce\" the measures designed to put \"maximum pres…","publishedAt":"2018-11-03T02:50:35Z","source":{"id":null,"name":"Globalsecurity.org"},"title":"U.S. To Grant Eight World 'Jurisdictions' Waivers On New Iranian Sanctions","url":"https:\/\/www.globalsecurity.org\/wmd\/library\/news\/iran\/2018\/iran-181102-rferl01.htm","urlToImage":null,"relevancy":56},{"author":"John Pike","content":"Iran Press TV Fri Nov 2, 2018 04:29PM Russian Energy Minister Alexander Novak says his country will help Iran counter fresh US sanctions due to come into effect late this week, saying Moscow will continue trading Tehran's crude in defiance of Washington. \"We … [+4476 chars]","description":"Russian Energy Minister Alexander Novak says his country will help Iran counter fresh US sanctions due to come into effect late this week, saying Moscow will continue trading Tehran's crude in defiance of Washington.","publishedAt":"2018-11-03T02:50:35Z","source":{"id":null,"name":"Globalsecurity.org"},"title":"Russia vows to continue oil trade with Iran despite US sanctions","url":"https:\/\/www.globalsecurity.org\/wmd\/library\/news\/iran\/2018\/iran-181102-presstv02.htm","urlToImage":null,"relevancy":25},{"author":"John Pike","content":"Iran Press TV Fri Nov 2, 2018 10:11PM France, Germany, the United Kingdom, and the European Union have jointly condemned Washington's fresh sanctions on Iran's economy, vowing to protect European firms doing business with Tehran. In a joint statement issued o… [+4768 chars]","description":"France, Germany, the United Kingdom, and the European Union have jointly condemned Washington's fresh sanctions on Iran's economy, vowing to protect European firms doing business with Tehran.","publishedAt":"2018-11-03T02:50:35Z","source":{"id":null,"name":"Globalsecurity.org"},"title":"EU, E3 condemn US for reimposing sanctions on Iran, vow to protect trade","url":"https:\/\/www.globalsecurity.org\/wmd\/library\/news\/iran\/2018\/iran-181102-presstv01.htm","urlToImage":null,"relevancy":65},{"author":"John Pike","content":"Iran Press TV Fri Nov 2, 2018 02:07PM Iran says the United States is seeking to wage an extensive \"psychological war\" against Tehran by imposing a fresh round of sanctions, stressing that the Islamic Republic has no concerns over such US bids. \"There is no ro… [+3674 chars]","description":"Iran says the United States is seeking to wage an extensive \"psychological war\" against Tehran by imposing a fresh round of sanctions, stressing that the Islamic Republic has no concerns over such US bids.","publishedAt":"2018-11-03T02:50:35Z","source":{"id":null,"name":"Globalsecurity.org"},"title":"No concerns over fresh US sanctions: Iran","url":"https:\/\/www.globalsecurity.org\/wmd\/library\/news\/iran\/2018\/iran-181102-presstv04.htm","urlToImage":null,"relevancy":53},{"author":"John Pike","content":"By William Gallo November 02, 2018 The United States says it plans to issue temporary waivers to several countries, allowing them to continue purchasing Iranian oil without being subject to forthcoming U.S. sanctions. Sanctions on Iran are expected to be rein… [+3727 chars]","description":"The United States says it plans to issue temporary waivers to several countries, allowing them to continue purchasing Iranian oil without being subject to forthcoming U.S. sanctions.","publishedAt":"2018-11-03T02:50:40Z","source":{"id":null,"name":"Globalsecurity.org"},"title":"US to Grant Waivers to Some Countries Importing Iran Oil","url":"https:\/\/www.globalsecurity.org\/wmd\/library\/news\/iran\/2018\/iran-181102-voa01.htm","urlToImage":null,"relevancy":38},{"author":"GARDINER HARRIS","content":"Eight countries including India, South Korea, Japan and China, among the worlds largest importers of Iranian oil were granted six-month waivers. WASHINGTON The Trump administration said Friday that it was exempting eight countries from sanctions the United St… [+5909 chars]","description":"Eight countries — including India, South Korea, Japan and China, among the world’s largest importers of Iranian oil — were granted six-month waivers.","publishedAt":"2018-11-03T03:19:09Z","source":{"id":null,"name":"Seattletimes.com"},"title":"U.S. reimposes sanctions on Iran but undercuts the pain with waivers","url":"https:\/\/www.seattletimes.com\/nation-world\/u-s-reimposes-sanctions-on-iran-but-undercuts-the-pain-with-waivers\/","urlToImage":"https:\/\/www.seattletimes.com\/wp-content\/themes\/st_refresh\/img\/st-meta-facebook.png","relevancy":96},{"author":"Press Trust of India","content":"Washington: The US has agreed to temporarily allow eight countries to continue buying Iranian oil after it reimposes crippling sanctions on Tehran on 5 November, Secretary of State Mike Pompeo said on Friday, citing \"significant reductions\" in imports of oil … [+5025 chars]","description":"India is one of the countries expected to get the exemptions from the US. But senior administration officials refused to spell out the names on Friday. The list of these exemptions would be announced on Monday. The post US allows 8 countries, including India,…","publishedAt":"2018-11-03T03:27:10Z","source":{"id":null,"name":"Firstpost.com"},"title":"US allows 8 countries, including India, to continue buying oil from Iran; will announce ‘toughest ever’ sanctions on Tehran on 5 November","url":"https:\/\/www.firstpost.com\/world\/us-allows-8-countries-including-india-to-continue-buying-oil-from-iran-will-announce-toughest-ever-sanctions-on-tehran-on-5-november-5496801.html","urlToImage":"https:\/\/images.firstpost.com\/wp-content\/uploads\/2018\/06\/Mike-Pompeo-AP-social-2.jpg","relevancy":22},{"author":"Ralph Flores","content":"( Natural News ) Research has shown that the moru oak ( Quercus dilatata ), a tree found in the Himalayas, could be used to treat chronic diseases like cancer and diabetes, as well as prevent the spread of infectious diseases like leishmaniasis. The study, pu… [+3650 chars]","description":"(Natural News) Research has shown that the moru oak (Quercus dilatata), a tree found in the Himalayas, could be used to treat chronic diseases like cancer and diabetes, as well as prevent the spread of infectious diseases like leishmaniasis. The study, publis…","publishedAt":"2018-11-03T03:27:13Z","source":{"id":null,"name":"Naturalnews.com"},"title":"This Himalayan medicinal tree may be the key to novel anti-cancer and anti-diabetic treatments","url":"https:\/\/www.naturalnews.com\/2018-11-03-himalayan-medicinal-tree-anticancer-antidiabetic-treatments.html","urlToImage":"https:\/\/www.naturalnews.com\/wp-content\/uploads\/sites\/91\/2018\/11\/Single-Oak-Tree-Field-Under-Magical.jpg","relevancy":55},{"author":"Grant Smith | Bloomberg","content":"Midnight on Sunday will mark a dividing line in the world of oil. Beyond that point, anyone unloading a tanker from Iran risks the full wrath of the US government. While the US softened its crackdown on the Middle East’s third-biggest oil producer on Friday, … [+4526 chars]","description":"US oil futures climbed to a four-year high near $77 a barrel last month on growing concerns there could be a shortage as sanctions bite deeper","publishedAt":"2018-11-03T03:52:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"Iran sanctions set to kick in, could bring biggest oil disruption in years","url":"https:\/\/www.business-standard.com\/article\/international\/iran-sanctions-set-to-kick-in-could-bring-biggest-oil-disruption-in-years-118110300175_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-09\/27\/full\/1537988179-5945.jpg","relevancy":80},{"author":"No Author","content":"The next step in the Trump administrations maximum pressure campaign against Iran comes this Sunday, Nov. 4, when the most severe sanctions will be imposed on the Islamic Republic. Crucially, they apply not only to Iran but to anyone who continues to do busin… [+7388 chars]","description":"The next step in the Trump administration’s “maximum pressure” campaign against Iran comes this Sunday, Nov. 4, when the most severe sanctions will be imposed on the Islamic Republic. Crucially, they apply not only to Iran but to anyone who continues to do bu…","publishedAt":"2018-11-03T04:01:00Z","source":{"id":null,"name":"Lewrockwell.com"},"title":"New Iran Sanctions","url":"https:\/\/www.lewrockwell.com\/2018\/11\/no_author\/new-iran-sanctions-risks-long-term-us-isolation\/","urlToImage":"https:\/\/www.lewrockwell.com\/wp-content\/themes\/lrc\/images\/logo-med.png","relevancy":70},{"author":"info@tabnak.ir","content":"Russian oil production moved closer to an all-time high before the nation meets with Opec partners to discuss future supply. The country’s crude and condensate output averaged 11.412 million barrels per day last month, according to data from the Energy Minist… [+1118 chars]","description":"Russian oil production moved closer to an all-time high before the nation meets with Opec partners to discuss future supply.","publishedAt":"2018-11-03T04:45:12Z","source":{"id":null,"name":"Tabnak.ir"},"title":"Russian crude production at an all-time high ahead of Opec meet","url":"https:\/\/www.tabnak.ir\/fa\/news\/848332\/russian-crude-production-at-an-all-time-high-ahead-of-opec-meet","urlToImage":null,"relevancy":8},{"author":"REUTERS","content":"WASHINGTON: The United States said on Friday it will temporarily allow eight importers to keep buying Iranian oil when it re-imposes sanctions on Monday to try to force Iran to curb its nuclear, missile and regional activities. US Secretary of State Mike Pomp… [+4444 chars]","description":"Oil prices fell on Friday for a weekly loss of over 6 per cent.","publishedAt":"2018-11-03T04:47:05Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"US allows eight importers to keep buying Iran oil for now","url":"https:\/\/economictimes.indiatimes.com\/markets\/commodities\/news\/us-allows-eight-importers-to-keep-buying-iran-oil-for-now\/articleshow\/66485258.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66485277,width-1070,height-580,imgsize-1413643,overlay-etmarkets\/photo.jpg","relevancy":2},{"author":"Nwafor Polycarp","content":"By Sonny Atumah The United States imposed wide-ranging sanctions on Iran kick in tomorrow Nov 4. President Donald Trumps administration is to isolate Iran from global markets over its alleged pursuit of nuclear weapons. In October 2017, Trump announced that h… [+5050 chars]","description":"The United States imposed wide-ranging sanctions on Iran kick in tomorrow Nov 4. President Donald Trump’s administration is to isolate Iran from global markets over its alleged pursuit of nuclear weapons. In October 2017, Trump announced that he would decerti…","publishedAt":"2018-11-03T05:03:47Z","source":{"id":null,"name":"Vanguardngr.com"},"title":"Iran sanctions: Whose day of reckoning?","url":"https:\/\/www.vanguardngr.com\/2018\/11\/iran-sanctions-whose-day-of-reckoning\/","urlToImage":"https:\/\/www.vanguardngr.com\/wp-content\/uploads\/2017\/10\/oil-supply.jpg","relevancy":34},{"author":"info@tabnak.ir","content":"Midnight on Sunday will mark a dividing line in the world of oil. Beyond that point, anyone unloading a tanker from Iran risks the full wrath of the US government. While the US softened its crackdown on the Middle East’s third-biggest oil producer on Friday, … [+4440 chars]","description":"Midnight on Sunday will mark a dividing line in the world of oil. Beyond that point, anyone unloading a tanker from Iran risks the full wrath of the US government.","publishedAt":"2018-11-03T05:12:04Z","source":{"id":null,"name":"Tabnak.ir"},"title":"Iran sanctions could bring biggest oil disruption in years","url":"https:\/\/www.tabnak.ir\/fa\/news\/848355\/iran-sanctions-could-bring-biggest-oil-disruption-in-years","urlToImage":null,"relevancy":13},{"author":"info@tabnak.ir","content":"The United States said on November 2 it will temporarily allow eight importers to keep buying Iranian oil when it re-imposes sanctions on November 5 to try to force Iran to curb its nuclear, missile and regional activities. US Secretary of State Mike Pompeo, … [+4450 chars]","description":"The United States said on November 2 it will temporarily allow eight importers to keep buying Iranian oil when it re-imposes sanctions on November 5 to try to force Iran to curb its nuclear, missile and regional activities.","publishedAt":"2018-11-03T05:14:23Z","source":{"id":null,"name":"Tabnak.ir"},"title":"US allows 8 importers to keep buying Iran oil for now","url":"https:\/\/www.tabnak.ir\/fa\/news\/848358\/us-allows-8-importers-to-keep-buying-iran-oil-for-now","urlToImage":null,"relevancy":11},{"author":null,"content":"Bulls reigned supreme in the market as the Nifty and Sensex rose 5 percent each week-on-week, amid positive earnings from India Inc, falling crude prices, rupee appreciation versus the dollar and easing trade war concerns between the US and China. The Sensex … [+1001 chars]","description":"Volatility index (India VIX) was down 5.2 percent this week, while the largecap index rose 5.3 percent. Midcap and smallcap gained 7.3 percent and 6.3 percent, respectively","publishedAt":"2018-11-03T05:14:27Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"Week in 10 charts: Robust earnings, easing crude prices push market higher; rupee gains 1% versus the dollar","url":"https:\/\/www.moneycontrol.com\/news\/business\/markets\/week-in-10-charts-robust-earnings-easing-crude-prices-push-market-higher-rupee-gains-1-versus-the-dollar-3126101.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2017\/03\/happyppl3-770x433.jpg","relevancy":17},{"author":"info@tabnak.ir","content":"Iran's Foreign Ministry Spokesman Bahram Qasemi said on Friday that his country has \"no concerns\" over the upcoming U.S. sanctions on its crude sales and banking sector. The Iranians will prove that they are not intimidated by the U.S. sanctions which are in … [+622 chars]","description":"Iran's Foreign Ministry Spokesman Bahram Qasemi said on Friday that his country has \"no concerns\" over the upcoming U.S. sanctions on its crude sales and banking sector.","publishedAt":"2018-11-03T05:23:02Z","source":{"id":null,"name":"Tabnak.ir"},"title":"Iran dismisses upcoming U.S. sanctions as \"no concerns\"","url":"https:\/\/www.tabnak.ir\/fa\/news\/848370\/iran-dismisses-upcoming-us-sanctions-as-no-concerns","urlToImage":null,"relevancy":12},{"author":"Sputnik","content":"The European Union, France, Germany and Britain said in a joint statement that they regret the Trump administrations May decision to leave the 2015 Iran deal and reimpose sanctions on Iran, and stressed that they are committed to protecting European firms doi… [+1943 chars]","description":"The European Union, France, Germany and Britain said in a joint statement that they regret the Trump administration’s May decision to leave the 2015 Iran deal and reimpose sanctions on Iran, and stressed that they are committed to protecting European firms do…","publishedAt":"2018-11-03T05:25:17Z","source":{"id":null,"name":"Sputniknews.com"},"title":"European Foreign, Finance Ministers Slam US Iran Sanctions, Vow to Protect Trade","url":"https:\/\/sputniknews.com\/europe\/201811031069473311-eu-europe-slams-usa-trump-iran-sanctions\/","urlToImage":"https:\/\/cdn5.img.sputniknews.com\/images\/106557\/08\/1065570806.jpg","relevancy":44},{"author":"F_126","content":"WASHINGTON, Nov. 2 (Xinhua) -- The Trump administration announced on Friday that it will snap back sanctions on Iran that had been lifted under the historic 2015 Iran nuke deal. However, eight nations will be given temporary waivers in their purchase of Iran'… [+7033 chars]","description":"WASHINGTON, Nov. 2 (Xinhua) -- The Trump administration announced on Friday that it will snap back","publishedAt":"2018-11-03T05:35:01Z","source":{"id":null,"name":"People.cn"},"title":"U.S. announces snapback of sanctions on Iran with 8 nations getting waivers","url":"http:\/\/en.people.cn\/n3\/2018\/1103\/c90000-9514740.html","urlToImage":null,"relevancy":116},{"author":"Tyler Yell, CMT, Forex Trading Instructor, Tyler Yell, CMT","content":"Fundamental Forecast for &lt;USOIL&gt;: Neutral Fundamental Crude Oil Price Talking Points: The ONE Thing: Multiple factors of institutional positions, falling front-month futures premium (chart below,) and building supply gluts have fundamentally shifted the… [+4870 chars]","description":"Less than a month ago, Crude oil was moving toward four-year highs that it hit on October 3. Now, WTI Crude is traversing at a six-month low toward a bear-market as the scary chart shared last week appears fateful.","publishedAt":"2018-11-03T06:00:00Z","source":{"id":null,"name":"Dailyfx.com"},"title":"Crude Oil Sell Off Puts Former Best Asset Within Whisper of Bear Market","url":"https:\/\/www.dailyfx.com\/forex\/fundamental\/article\/special_report\/2018\/11\/02\/Crude-Oil-Sell-Off-Puts-Former-Best-Asset-Within-Whisper-of-Bear-Market.html","urlToImage":null,"relevancy":18},{"author":null,"content":"The Sensex rallied nearly 1,700 points, or 5 percent, for the week-ended November 2 and the Nifty rose 523 points, or 5.2 percent, but the real action was visible in the small- and midcap space. D-Street registered its biggest weekly gain since May 2016. Posi… [+3303 chars]","description":"The midcap and smallcap indices rose 7 percent and 6.4 percent, respectively, but the real action was seen in individual stocks which gained 10-70 percent","publishedAt":"2018-11-03T06:02:24Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"Sensex rallies 5% ahead of Diwali, 148 stocks rise 10-70% in 5 days","url":"https:\/\/www.moneycontrol.com\/news\/business\/markets\/sensex-rallies-5-ahead-of-diwali-148-stocks-rise-10-70-in-5-days-3126181.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2017\/08\/sensex_NSE_BSE_Stocks_Stock_market_bse1-770x433.jpg","relevancy":29},{"author":null,"content":"In the first six months of the current financial year (FY19), the assets under management (AUM) from B30 cities registered a fall of 11.29 percent or Rs 45,441 crore, as per the data on the Association of Mutual Funds in India. According to SEBI, T30 refers t… [+2189 chars]","description":"In the first six months, S&P BSE Sensex rose 10 percent, but September alone, S&P BSE Sensex lost more than 2,400 points, or 6.2 percent","publishedAt":"2018-11-03T06:20:55Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"MF wrap: AUM of B30 cities fell 11% in first half of FY19","url":"https:\/\/www.moneycontrol.com\/news\/business\/mf-wrap-aum-of-b30-cities-fell-11-in-first-half-of-fy19-3123171.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2018\/05\/moneymutualfunds-770x433.jpg","relevancy":45},{"author":"Joshua Gallu, Bloomberg","content":"Washington: President Donald Trump said the US remains open to reaching a comprehensive deal with Iran that blocks its nuclear-weapons programme, just days before sanctions on the country’s energy and shipping sectors kick back in. “Our objective is to force … [+3777 chars]","description":"The US remains open to reaching a new, more comprehensive deal with Iran that forever blocks its path to a nuclear weapon, addresses the entire range of its malign actions, and is worthy of the Iranian people: President Donald Trump","publishedAt":"2018-11-03T06:28:38Z","source":{"id":null,"name":"Livemint.com"},"title":"US open to new Iran deal, says Trump","url":"https:\/\/www.livemint.com\/Politics\/ozuKpTC91GTMJpfauP8BsK\/US-open-to-new-Iran-deal-says-Trump.html","urlToImage":"https:\/\/www.livemint.com\/rf\/Image-621x414\/LiveMint\/Period2\/2018\/11\/05\/Photos\/Processed\/trumppic-kZ0D--621x414@LiveMint-bf21.jpg","relevancy":46},{"author":"RFE\/RL","content":"Iran's oil exports are becoming harder to track as Iranian tankers increasingly \"going dark\" by turning off transponders that make them easy to detect as they transport their cargo on the high seas, oil experts say. With the United States preparing to reimpos… [+2539 chars]","description":"Iran's oil exports are becoming harder to track as Iranian tankers increasingly \"going dark\" by turning off transponders that make them easy to detect as they transport their cargo on the high seas, oil experts say.","publishedAt":"2018-11-03T06:28:44Z","source":{"id":null,"name":"Rferl.org"},"title":"Iranian Oil Tankers Reportedly 'Go Dark,' Making Tracking Exports More Difficult","url":"https:\/\/www.rferl.org\/a\/iranian-oil-tankers-reportedly-go-dark-making-tracking-exports-more-difficult\/29580356.html","urlToImage":"https:\/\/gdb.rferl.org\/CB0CCD35-BB09-4DA9-9FCB-72A76E955DD5_w1200_r1_s.jpg","relevancy":35},{"author":"Bloomberg","content":"Oils surge to a four-year high in early October has unravelled as a rout in global equities stokes concern that fuel demand will suffer. (Bloomberg pic) NEW YORK: Oil extended its slide to six-month lows as the US softened its crackdown on Iranian exports and… [+2444 chars]","description":"Futures slumped 6.3% this week, the biggest drop since early February.","publishedAt":"2018-11-03T06:47:06Z","source":{"id":null,"name":"Freemalaysiatoday.com"},"title":"Oil caps worst week since February as Iran supply fears subside","url":"https:\/\/www.freemalaysiatoday.com\/category\/business\/2018\/11\/03\/oil-caps-worst-week-since-february-as-iran-supply-fears-subside\/","urlToImage":"https:\/\/s3media.freemalaysiatoday.com\/wp-content\/uploads\/2018\/11\/oil.jpg","relevancy":54},{"author":null,"content":"The United States plans to temporarily exempt Japan from its ban on Iranian oil imports after Washington reimposes sanctions against Tehran on Monday, a Japan-U.S. diplomatic source said Friday. Secretary of State Mike Pompeo said earlier Friday the United St… [+2277 chars]","description":"The United States plans to temporarily exempt Japan from its ban on Iranian oil imports after Washington reimposes sanctions against Tehran on Monday, a Japan-U.S. diplomatic source said Friday. Secretary of State Mike Pompeo said earlier Friday the United St…","publishedAt":"2018-11-03T07:03:08Z","source":{"id":null,"name":"Japantoday.com"},"title":"U.S. to exempt Japan from Iran oil sanctions","url":"https:\/\/japantoday.com\/category\/politics\/update2-u.s.-to-exempt-japan-from-iran-oil-sanctions-source","urlToImage":"https:\/\/japantoday-asset.scdn3.secure.raxcdn.com\/img\/store\/59\/7a\/a463c64e85ed84d863a747ef5a41065c0368\/iranoil.jpg","relevancy":20},{"author":"Joshua Gallu | Bloomberg","content":"President Donald Trump said the US remains open to reaching a comprehensive deal with Iran that blocks its nuclear-weapons programme, just days before sanctions on the country’s energy and shipping sectors kick back in. “Our objective is to force the regime i… [+3738 chars]","description":"Our objective is to force the regime into a clear choice, said Trump in a statement released by the White House","publishedAt":"2018-11-03T07:11:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"With sanctions set to return, Trump says US open to new deal with Iran","url":"https:\/\/www.business-standard.com\/article\/international\/with-sanctions-set-to-return-trump-says-us-open-to-new-deal-with-iran-118110300334_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-08\/01\/full\/1533099639-7286.jpg","relevancy":73},{"author":"Bloomberg","content":"Oil extended its slide to six-month lows as the US softened its crackdown on Iranian exports and American supplies surged, easing concerns of an impending shortage. Futures slumped 6.3 per cent this week, the biggest drop since early February. The US has agre… [+2758 chars]","description":"Futures slumped 6.3 percent this week, the biggest drop since early February.","publishedAt":"2018-11-03T07:20:26Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"Oil caps worst week since February as Iran supply fears subside","url":"https:\/\/economictimes.indiatimes.com\/markets\/commodities\/news\/oil-caps-worst-week-since-february-as-iran-supply-fears-subside\/articleshow\/66486677.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66486699,width-1070,height-580,imgsize-874521,overlay-etmarkets\/photo.jpg","relevancy":4},{"author":null,"content":null,"description":"In Delhi, petrol now costs Rs 78.99 a litre, while diesel is sold at Rs 73.53, according to a price notification issued by state-owned oil firms. In Mumbai, petrol price stood at Rs 84.49 a litre and diesel rate is at Rs 77.06.","publishedAt":"2018-11-03T07:55:17Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"Petrol, diesel prices continue to dip on softer crude","url":"https:\/\/timesofindia.indiatimes.com\/business\/india-business\/petrol-diesel-prices-continue-to-dip-on-softer-crude\/articleshow\/66487004.cms","urlToImage":"https:\/\/static.toiimg.com\/thumb\/msid-66487047,width-1070,height-580,imgsize-1138431,resizemode-6,overlay-toi_sw,pt-32,y_pad-40\/photo.jpg","relevancy":64},{"author":null,"content":"Rajeev Srivastava Reliance Securities A continued selling spree, especially by foreign institutional investors (FIIs), dragged the Nifty and Sensex lower by about 5 percent in October. Concerns pertaining to fiscal deficit, ongoing liquidity crisis in the MSM… [+3086 chars]","description":"Rajeev Srivastava of Reliance Securities advises investors to adopt a bottom-up approach and invest in companies with a proven track record and valuation comfort","publishedAt":"2018-11-03T08:06:30Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"Market on weak wicket, investors should tread cautiously: Reliance Securities","url":"https:\/\/www.moneycontrol.com\/news\/business\/markets\/market-on-weak-wicket-investors-should-tread-cautiously-reliance-securities-3126231.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2018\/08\/Sensex_Nifty_BSE_Stock-Market_traders-770x433.jpg","relevancy":51},{"author":"Al Jazeera","content":"Russian Energy Minister Alexander Novak has said Moscow will support Iran to counter US oil sanctions. Washington on Friday restored sanctions on Tehran, which had previously been lifted under the 2015 nuclear deal. The measures are due to come into effect on… [+2125 chars]","description":"Russian energy minister tells FT that Moscow will 'continue developing' its trade of Iranian oil after Monday deadline.","publishedAt":"2018-11-03T08:18:44Z","source":{"id":"al-jazeera-english","name":"Al Jazeera English"},"title":"Russia says US sanctions 'illegal', will help Iran trade oil","url":"https:\/\/www.aljazeera.com\/news\/2018\/11\/russia-sanctions-illegal-iran-trade-oil-181103072241718.html","urlToImage":"https:\/\/www.aljazeera.com\/mritems\/Images\/2018\/11\/3\/ad71dbb6191d4b03b6198a2a92846061_18.jpg","relevancy":1},{"author":null,"content":"In the wake of the devastating new climate report -- and of devastating hurricanes, droughts and floods -- the oil industry has been making a few small noises about how it might want to change its course. BP's chief executive, for instance, recently called fo… [+222 chars]","description":"In the wake of the devastating new climate report -- and of devastating hurricanes, droughts and floods -- the oil industry has been making a few small noises about how it might want to change its course. BP&#39;s chief executive, for instance, recently calle…","publishedAt":"2018-11-03T08:19:05Z","source":{"id":null,"name":"Topix.com"},"title":"Big Oil is sloshing a crude tsunami across the country","url":"http:\/\/www.topix.com\/energy\/alt-energy\/2018\/11\/big-oil-is-sloshing-a-crude-tsunami-across-the-country?fromrss=1","urlToImage":"http:\/\/picproxy.topixcdn.com\/pics\/up-","relevancy":10},{"author":"Chen Aizhu","content":"BEIJING\/DUBAI (Reuters) - China’s state-run Zhenhua Oil is set to sign a head of agreement that includes a proposed joint-venture with Iraq’s state oil marketer SOMO and for 2019 annual crude oil supply in Shanghai next week, two industry officials with direc… [+1726 chars]","description":"China's state-run Zhenhua Oil is set to sign a head of agreement that includes a proposed joint-venture with Iraq's state oil marketer SOMO and for 2019 annual crude oil supply in Shanghai next week, two industry officials with direct knowledge of the matter …","publishedAt":"2018-11-03T08:35:53Z","source":{"id":"reuters","name":"Reuters"},"title":"China's Zhenhua Oil to sign oil deals with Iraq, Saudi at Shanghai expo - sources","url":"https:\/\/www.reuters.com\/article\/us-china-iraq-zhenhua\/chinas-zhenhua-oil-to-sign-oil-deals-with-iraq-saudi-at-shanghai-expo-sources-idUSKCN1N807F","urlToImage":"https:\/\/s4.reutersmedia.net\/resources_v2\/images\/rcom-default.png","relevancy":104},{"author":"https:\/\/www.dailymail.co.uk\/home\/search.html?s=&authornamef=Reuters","content":"By Chen Aizhu and Rania El Gamal BEIJING\/DUBAI, Nov 3 (Reuters) - China's state-run Zhenhua Oil is set to sign a head of agreement that includes a proposed joint-venture with Iraq's state oil marketer SOMO and for 2019 annual crude oil supply in Shanghai next… [+1831 chars]","description":"By Chen Aizhu and Rania El GamalBEIJING\/DUBAI, Nov 3 (Reuters) - China's state-run Zhenhua  Oil is set to sign a head of agreement that includes a proposed ...","publishedAt":"2018-11-03T08:38:37Z","source":{"id":"daily-mail","name":"Daily Mail"},"title":"China's Zhenhua Oil to sign oil deals with Iraq, Saudi...","url":"https:\/\/www.dailymail.co.uk\/wires\/reuters\/article-6348937\/Chinas-Zhenhua-Oil-sign-oil-deals-Iraq-Saudi-Shanghai-expo--sources.html","urlToImage":"https:\/\/i.dailymail.co.uk\/i\/pix\/m_logo_636x382px.png","relevancy":60},{"author":"Chen Aizhu","content":"BEIJING\/DUBAI (Reuters) - China’s state-run Zhenhua Oil is set to sign a head of agreement that includes a proposed joint-venture with Iraq’s state oil marketer SOMO and for 2019 annual crude oil supply in Shanghai next week, two industry officials with direc… [+1726 chars]","description":"China's state-run Zhenhua Oil is set to sign a head of agreement that includes a proposed joint-venture with Iraq's state oil marketer SOMO and for 2019 annual crude oil supply in Shanghai next week, two industry officials with direct knowledge of the matter …","publishedAt":"2018-11-03T08:39:13Z","source":{"id":"reuters","name":"Reuters"},"title":"China's Zhenhua Oil to sign oil deals with Iraq, Saudi at Shanghai expo - sources","url":"https:\/\/uk.reuters.com\/article\/uk-china-iraq-zhenhua\/chinas-zhenhua-oil-to-sign-oil-deals-with-iraq-saudi-at-shanghai-expo-sources-idUKKCN1N806Z","urlToImage":"https:\/\/s4.reutersmedia.net\/resources_v2\/images\/rcom-default.png","relevancy":103},{"author":"Amit Mudgill","content":"NEW DELHI: The week gone by was one of rebound for global financial markets, and the domestic bourse was no exception. The Sensex gained 1,662 points, or 5 per cent, for the week to 35,011 level, after logging two weekly losses, while Nity50 soared 523 points… [+3573 chars]","description":"The Sensex gained 1,662 points, or 5 per cent, for the week to 35,011 level.","publishedAt":"2018-11-03T08:54:19Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"​The week that was in 10 stocks: DHFL, Adani, Tata Power and jewellery plays","url":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/the-week-that-was-in-10-stocks-dhfl-adani-tata-power-and-jewellery-plays\/articleshow\/66487501.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66487503,width-1070,height-580,imgsize-814029,overlay-etmarkets\/photo.jpg","relevancy":97},{"author":"Richard Cuthbertson","content":"When chemical engineer Sophia He was recruited to Dalhousie University's agriculture school five years ago, she began to brainstorm with local farmers about how leftover organic material could be turned into useful products. One day, she got a call from one o… [+3643 chars]","description":"Dalhousie University chemical engineer Sophia He is turning coffee grounds into fuel that could power cars. She's part of a broader push to turn everything from kitchen scraps to sawdust into biofuel.","publishedAt":"2018-11-03T09:00:43Z","source":{"id":"cbc-news","name":"CBC News"},"title":"In the quest for cleaner fuels, a scientist turns to Tim Hortons coffee grounds","url":"https:\/\/www.cbc.ca\/news\/canada\/nova-scotia\/scientist-turns-to-tim-hortons-coffee-grounds-1.4889437","urlToImage":"https:\/\/i.cbc.ca\/1.4889543.1541179866!\/fileImage\/httpImage\/image.JPG_gen\/derivatives\/16x9_620\/sophia-he.JPG","relevancy":89},{"author":"Bloomberg","content":"Trump says the penalties were aimed at the Tehran government, not at the long suffering Iranian people. WASHINGTON: President Donald Trump said the US remains open to reaching a comprehensive deal with Iran that blocks its nuclear-weapons program, just days b… [+3720 chars]","description":"Trump says the sale of food, medicine, medical devices, and agricultural commodities to Iran has long been, and remains, exempt from the sanctions.","publishedAt":"2018-11-03T09:06:54Z","source":{"id":null,"name":"Freemalaysiatoday.com"},"title":"Trump says US open to new Iran deal as sanctions set to return","url":"https:\/\/www.freemalaysiatoday.com\/category\/business\/2018\/11\/03\/trump-says-us-open-to-new-iran-deal-as-sanctions-set-to-return\/","urlToImage":"https:\/\/s3media.freemalaysiatoday.com\/wp-content\/uploads\/2018\/11\/trump.jpg","relevancy":52},{"author":"i24NEWS","content":"Two days before the full re-imposition of US sanctions against Iran, the rhetoric and social media wars have intensified between the two countries leaders. I will stand against you, wrote the Major General of the Islamic Revolutionary Guards Corps, Qasem Sole… [+2858 chars]","description":"Iran's defense minister boasted this morning that they had begun mass production of their new fighter jets","publishedAt":"2018-11-03T09:08:28Z","source":{"id":null,"name":"I24news.tv"},"title":"Iran boasts new fighter jets as rhetoric with US mounts over final sanctions","url":"https:\/\/www.i24news.tv\/en\/news\/international\/187785-181103-us-iran-battle-rhetoric-intensify-ahead-of-final-sanctions","urlToImage":"https:\/\/cdn.i24news.tv\/upload\/image\/afp-a959decf9d09e405aea7a8fa4fd629d3c0ba1bf8.jpg","relevancy":114},{"author":"https:\/\/www.dailymail.co.uk\/home\/search.html?s=&authornamef=Reuters","content":"ANKARA, Nov 3 (Reuters) - Turkish Trade Minister Ruhsar Pekcan said on Saturday that Turkey has received initial indications that it will be among eight countries to be granted a waiver from U.S. sanctions against Iran, but is awaiting clarification on Monday… [+708 chars]","description":"ANKARA, Nov 3 (Reuters) - Turkish Trade Minister Ruhsar  Pekcan said on Saturday that Turkey has received initial  indications that it will be among eight...","publishedAt":"2018-11-03T09:13:36Z","source":{"id":"daily-mail","name":"Daily Mail"},"title":"Turkey expects to know on Monday if has waiver for Iran...","url":"https:\/\/www.dailymail.co.uk\/wires\/reuters\/article-6348985\/Turkey-expects-know-Monday-waiver-Iran-sanctions.html","urlToImage":"https:\/\/i.dailymail.co.uk\/i\/pix\/m_logo_636x382px.png","relevancy":76},{"author":"Reuters Editorial","content":"ANKARA (Reuters) - Turkish Trade Minister Ruhsar Pekcan said on Saturday that Turkey has received initial indications that it will be among eight countries to be granted a waiver from U.S. sanctions against Iran, but is awaiting clarification on Monday, NATO … [+637 chars]","description":"Turkish Trade Minister Ruhsar Pekcan said on Saturday that Turkey has received initial indications that it will be among eight countries to be granted a waiver from U.S. sanctions against Iran, but is awaiting clarification on Monday,","publishedAt":"2018-11-03T09:14:23Z","source":{"id":"reuters","name":"Reuters"},"title":"Turkey expects to know on Monday if has waiver for Iran sanctions","url":"https:\/\/in.reuters.com\/article\/usa-iran-sanctions-turkey\/turkey-expects-to-know-on-monday-if-has-waiver-for-iran-sanctions-idINKCN1N807L","urlToImage":"https:\/\/s4.reutersmedia.net\/resources_v2\/images\/rcom-default.png","relevancy":77},{"author":"Reuters Editorial","content":"ANKARA (Reuters) - Turkish Trade Minister Ruhsar Pekcan said on Saturday that Turkey has received initial indications that it will be among eight countries to be granted a waiver from U.S. sanctions against Iran, but is awaiting clarification on Monday, NATO … [+637 chars]","description":"Turkish Trade Minister Ruhsar Pekcan said on Saturday that Turkey has received initial indications that it will be among eight countries to be granted a waiver from U.S. sanctions against Iran, but is awaiting clarification on Monday,","publishedAt":"2018-11-03T09:18:26Z","source":{"id":"reuters","name":"Reuters"},"title":"Turkey expects to know on Monday if it has waiver for Iran sanctions","url":"https:\/\/af.reuters.com\/article\/worldNews\/idAFKCN1N807T","urlToImage":"https:\/\/s4.reutersmedia.net\/resources_v2\/images\/rcom-default.png","relevancy":112},{"author":"The Star Online","content":"ANKARA (Reuters) - Turkish Trade Minister Ruhsar Pekcan said on Saturday that Turkey has received initial indications that it will be among eight countries to be granted a waiver from U.S. sanctions against Iran, but is awaiting clarification on Monday, NATO … [+639 chars]","description":"ANKARA (Reuters) - Turkish Trade Minister Ruhsar Pekcan said on Saturday that Turkey has received initial indications that it will be among eight countries to be granted a waiver from U.S. sanctions against Iran, but is awaiting clarification on Monday,","publishedAt":"2018-11-03T09:20:06Z","source":{"id":null,"name":"Thestar.com.my"},"title":"Turkey expects to know on Monday if it has waiver for Iran sanctions","url":"http:\/\/www.thestar.com.my\/news\/world\/2018\/11\/03\/turkey-expects-to-know-on-monday-if-it-has-waiver-for-iran-sanctions\/","urlToImage":"https:\/\/cdn.thestar.com.my\/Themes\/img\/newTsol_logo_socmedia.png?v=2018113","relevancy":107},{"author":null,"content":"ANKARA: Turkish Trade Minister Ruhsar Pekcan said on Saturday that Turkey has received initial indications that it will be among eight countries to be granted a waiver from U.S. sanctions against Iran, but is awaiting clarification on Monday, NATO member Turk… [+642 chars]","description":"ANKARA: Turkish Trade Minister Ruhsar Pekcan said on Saturday that Turkey has received initial indications that it will be among eight countries to be granted a waiver from U.S. sanctions against Iran, but is awaiting clarification on Monday, NATO member Turk…","publishedAt":"2018-11-03T09:20:23Z","source":{"id":null,"name":"Channelnewsasia.com"},"title":"Turkey expects to know on Monday if it has waiver for Iran sanctions","url":"https:\/\/www.channelnewsasia.com\/news\/world\/turkey-expects-to-know-on-monday-if-it-has-waiver-for-iran-sanctions-10894292","urlToImage":"http:\/\/www.channelnewsasia.com\/image\/8695344\/16x9\/991\/557\/609aa1d555bc236155019d989012c2c5\/sP\/world.png","relevancy":37},{"author":null,"content":"ANKARA (Reuters) - Turkish Trade Minister Ruhsar Pekcan said on Saturday that Turkey has received initial indications that it will be among eight countries to be granted a waiver from U.S. sanctions against Iran, but is awaiting clarification on Monday, NATO … [+637 chars]","description":"Turkish Trade Minister Ruhsar Pekcan said on Saturday that Turkey has received initial indications that it will be among eight countries to be granted a waiver from U.S. sanctions against Iran, but is awaiting clarification on Monday, NATO member Turkey depen…","publishedAt":"2018-11-03T09:32:39Z","source":{"id":null,"name":"Yahoo.com"},"title":"Turkey expects to know on Monday if it has waiver for Iran sanctions","url":"https:\/\/www.yahoo.com\/news\/turkey-expects-know-monday-waiver-iran-sanctions-093239389.html","urlToImage":"https:\/\/s.yimg.com\/uu\/api\/res\/1.2\/ChIlYVkzomIBB_blmXt63w--~B\/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--\/http:\/\/media.zenfs.com\/en_us\/News\/Reuters\/2018-11-03T093239Z_1_LYNXNPEEA2061_RTROPTP_2_TURKEY-ENERGY.JPG","relevancy":0},{"author":"Reuters Editorial","content":"ANKARA (Reuters) - Turkish Trade Minister Ruhsar Pekcan said on Saturday that Turkey has received initial indications that it will be among eight countries to be granted a waiver from U.S. sanctions against Iran, but is awaiting clarification on Monday, NATO … [+635 chars]","description":"Turkish Trade Minister Ruhsar Pekcan said on Saturday that Turkey has received initial indications that it will be among eight countries to be granted a waiver from U.S. sanctions against Iran, but is awaiting clarification on Monday,","publishedAt":"2018-11-03T09:32:39Z","source":{"id":"reuters","name":"Reuters"},"title":"Turkey expects to know on Monday if it has waiver for Iran sanctions","url":"https:\/\/www.reuters.com\/article\/us-usa-iran-sanctions-turkey\/turkey-expects-to-know-on-monday-if-it-has-waiver-for-iran-sanctions-idUSKCN1N808C","urlToImage":"https:\/\/s1.reutersmedia.net\/resources\/r\/?m=02&d=20181103&t=2&i=1321573065&w=1200&r=LYNXNPEEA2061","relevancy":6},{"author":"Reuters Editorial","content":"NEW DELHI (Reuters) - India and other leading oil buyers will benefit from the waiver the United States has granted them from Iran sanctions, the South Asian nation’s oil minister said on Saturday. The United States said on Friday it will temporarily allow ei… [+1244 chars]","description":"India and other leading oil buyers will benefit from the waiver the United States has granted them from Iran sanctions, the South Asian nation's oil minister said on Saturday.","publishedAt":"2018-11-03T09:32:49Z","source":{"id":"reuters","name":"Reuters"},"title":"India, other nations to benefit from U.S. waiver on Iran oil buys - minister","url":"https:\/\/in.reuters.com\/article\/usa-iran-sanctions-india\/india-other-nations-to-benefit-from-u-s-waiver-on-iran-oil-buys-minister-idINKCN1N808E","urlToImage":"https:\/\/s1.reutersmedia.net\/resources\/r\/?m=02&d=20181103&t=2&i=1321572837&w=1200&r=LYNXNPEEA2060","relevancy":68},{"author":"Reuters Editorial","content":"NEW DELHI (Reuters) - India and other leading oil buyers will benefit from the waiver the United States has granted them from Iran sanctions, the South Asian nation’s oil minister said on Saturday. The United States said on Friday it will temporarily allow ei… [+1244 chars]","description":"India and other leading oil buyers will benefit from the waiver the United States has granted them from Iran sanctions, the South Asian nation's oil minister said on Saturday.","publishedAt":"2018-11-03T09:35:54Z","source":{"id":"reuters","name":"Reuters"},"title":"India, other nations to benefit from U.S. waiver on Iran oil buys - minister","url":"https:\/\/uk.reuters.com\/article\/uk-usa-iran-sanctions-india\/india-other-nations-to-benefit-from-us-waiver-on-iran-oil-buys-minister-idUKKCN1N808G","urlToImage":"https:\/\/s4.reutersmedia.net\/resources_v2\/images\/rcom-default.png","relevancy":109},{"author":"Gardiner Harris | NYT","content":"The Trump administration announced on Friday that it was exempting eight countries from bruising sanctions that the United States was reimposing against Iran, undercutting its pledge to economically punish Tehran’s regional aggressions while widening a profou… [+7858 chars]","description":"Pompeo said the European Union, which recently announced the creation of an economic channel to continue financial dealings with Iran, was not among those receiving waivers","publishedAt":"2018-11-03T09:38:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"US reimposes sanctions on Iran but undercuts the pain with waivers","url":"https:\/\/www.business-standard.com\/article\/international\/us-reimposes-sanctions-on-iran-but-undercuts-the-pain-with-waivers-118110300427_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-09\/27\/full\/1538012937-1468.jpg","relevancy":91},{"author":"Arshad Mohammed","content":"WASHINGTON (Reuters) - The United States said on Friday it will temporarily allow eight importers to keep buying Iranian oil when it re-imposes sanctions on Monday to try to force Iran to curb its nuclear, missile and regional activities. U.S. Secretary of St… [+5219 chars]","description":"The United States said on Friday it will temporarily allow eight importers to keep buying Iranian oil when it re-imposes sanctions on Monday to try to force Iran to curb its nuclear, missile and regional activities.","publishedAt":"2018-11-03T09:46:54Z","source":{"id":"reuters","name":"Reuters"},"title":"UPDATE 12-U.S. allows eight importers to keep buying Iran oil for now","url":"https:\/\/uk.reuters.com\/article\/uk-usa-iran-sanctions\/u-s-allows-eight-importers-to-keep-buying-iran-oil-for-now-idUKKCN1N70LX","urlToImage":"https:\/\/s1.reutersmedia.net\/resources\/r\/?m=02&d=20181102&t=2&i=1321205460&w=1200&r=LYNXNPEEA10CA","relevancy":108},{"author":null,"content":"India is among eight nations that can buy oil from Iran even after US sanctions kick in New Delhi: India and other leading oil buyers will benefit from the waiver the United States has granted them from Iran sanctions, oil minister Dharmendra Pradhan said tod… [+1213 chars]","description":"India and other leading oil buyers will benefit from the waiver the United States has granted them from Iran sanctions, oil minister Dharmendra Pradhan said today. The US said on Friday it will temporarily allow eight importers to keep buying Iranian oil when…","publishedAt":"2018-11-03T09:57:18Z","source":{"id":null,"name":"Ndtv.com"},"title":"Forceful Campaign By PM Won US Waiver On Buying Iran Oil: Minister","url":"https:\/\/www.ndtv.com\/india-news\/forceful-campaign-by-pm-won-us-waiver-on-buying-iran-oil-says-dharmendra-pradhan-1942322","urlToImage":"https:\/\/c.ndtvimg.com\/2018-11\/t39kr1m8_oil-tanker-generic-pixabay_625x300_03_November_18.jpg","relevancy":61},{"author":"David Song, Currency Analyst, David Song","content":"Fundamental Forecast for Canadian Dollar: Neutral USD\/CAD bounces back from the weekly-low (1.3049) as the above-forecast print for U.S. Non-Farm Payrolls (NFP) overshadows the 11.2K expansion in Canada Employment, but price action ahead of the Federal Reserv… [+2718 chars]","description":"Price action ahead of the Federal Reserve meeting raises the risk for a larger pullback in USD\/CAD as the exchange rate carves a fresh series of lower highs & lows.","publishedAt":"2018-11-03T10:00:00Z","source":{"id":null,"name":"Dailyfx.com"},"title":"USD\/CAD Rate Carves Lower Highs & Lows Ahead of Fed Meeting","url":"https:\/\/www.dailyfx.com\/forex\/fundamental\/forecast\/weekly\/cad\/2018\/11\/02\/USDCAD-Rate-Carves-Lower-Highs-Lows-Ahead-of-Fed-Meeting.html","urlToImage":null,"relevancy":102},{"author":"Nwafor Polycarp","content":"Russian Energy Minister Alexander Novak has said Moscow will support Iran to counter US oil sanctions. Russian Energy Minister Alexander Novak Washington on Friday restored sanctions on Tehran, which had previously been lifted under the 2015 nuclear deal. The… [+1853 chars]","description":"Russian Energy Minister Alexander Novak has said Moscow will support Iran to counter US oil sanctions. Continue reading Russia will help Iran trade oil – Minister at Vanguard News Nigeria.","publishedAt":"2018-11-03T10:00:56Z","source":{"id":null,"name":"Vanguardngr.com"},"title":"Russia will help Iran trade oil – Minister","url":"https:\/\/www.vanguardngr.com\/2018\/11\/russia-will-help-iran-trade-oil-minister\/","urlToImage":"https:\/\/www.vanguardngr.com\/wp-content\/uploads\/2018\/11\/Alexander-Novak.gif","relevancy":39},{"author":"Agence France-Presse","content":null,"description":"TEHRAN, Iran (UPDATED) – Iran's supreme leader Ayatollah Ali Khamenei said Saturday, November 3, that President Donald Trump has \"disgraced\" US prestige and would be the ultimate loser from renewing sanctions on the Islamic republic. \"This new US president...…","publishedAt":"2018-11-03T10:13:12Z","source":{"id":null,"name":"Rappler.com"},"title":"Trump has 'disgraced' U.S. prestige – Iran's Khamenei","url":"https:\/\/www.rappler.com\/world\/regions\/middle-east\/215854-donald-trump-disgrace-usa-sanctions-iran-khamenei","urlToImage":"https:\/\/assets.rappler.com\/612F469A6EA84F6BAE882D2B94A4B421\/img\/0571EB5A6E4D49AEAF1E9FA6832BED37\/iran-us_81d9edbefb9f4e0b826cc5510cc24bf3.jpg","relevancy":115},{"author":null,"content":"In the wake of the devastating new climate report -- and of devastating hurricanes, droughts and floods -- the oil industry has been making a few small noises about how it might want to change its course. BP's chief executive, for instance, recently called fo… [+222 chars]","description":"In the wake of the devastating new climate report -- and of devastating hurricanes, droughts and floods -- the oil industry has been making a few small noises about how it might want to change its course. BP&#39;s chief executive, for instance, recently calle…","publishedAt":"2018-11-03T10:25:57Z","source":{"id":null,"name":"Topix.com"},"title":"Big Oil is sloshing a crude tsunami across the country","url":"http:\/\/www.topix.com\/business\/oil-gas\/2018\/11\/big-oil-is-sloshing-a-crude-tsunami-across-the-country-1?fromrss=1","urlToImage":"http:\/\/picproxy.topixcdn.com\/pics\/up-","relevancy":26},{"author":"Reuters","content":"A crude oil production field. (AFP pic) BEIJING: China’s state-run Zhenhua Oil is set to sign a head of agreement that includes a proposed joint-venture with Iraq’s state oil marketer SOMO and for 2019 annual crude oil supply in Shanghai next week, two indust… [+1713 chars]","description":"The joint-venture between SOMO and Zhenhua will help bolster Iraq's position in Asia.","publishedAt":"2018-11-03T10:35:53Z","source":{"id":null,"name":"Freemalaysiatoday.com"},"title":"China’s Zhenhua Oil to sign oil deals with Iraq, Saudi at Shanghai expo","url":"https:\/\/www.freemalaysiatoday.com\/category\/business\/2018\/11\/03\/chinas-zhenhua-oil-to-sign-oil-deals-with-iraq-saudi-at-shanghai-expo\/","urlToImage":"https:\/\/s3media.freemalaysiatoday.com\/wp-content\/uploads\/2018\/11\/crude-oil-afp0311.jpg","relevancy":28},{"author":null,"content":"India and other leading oil buyers will benefit from the waiver the United States has granted them from Iran sanctions, the South Asian nation's oil minister said on November 3. The US said it will temporarily allow eight importers to keep buying Iranian oil … [+1146 chars]","description":"\"In the current geopolitically challenging scenario, India has managed to convince international leaders,\" Oil Minister Dharmendra Pradhan said.","publishedAt":"2018-11-03T11:14:13Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"India, other nations to benefit from US waiver on Iran oil buys: Dharmendra Pradhan","url":"https:\/\/www.moneycontrol.com\/news\/india\/india-other-nations-to-benefit-from-us-waiver-on-iran-oil-buys-dharmendra-pradhan-3126871.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2017\/05\/Dharmendra_Pradhan1-770x433.jpg","relevancy":14},{"author":"REUTERS","content":"India and other leading oil buyers will benefit from the waiver the United States has granted them from Iran sanctions, the South Asian nation's oil minister said on Saturday. The United States said on Friday it will temporarily allow eight importers to keep … [+1159 chars]","description":"US said on Friday it will temporarily allow eight importers to keep buying Iranian oil when it re-imposes sanctions on Monday","publishedAt":"2018-11-03T11:30:42Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"India, other nations to benefit from US waiver on Iran oil buys: Dharmendra Pradhan","url":"https:\/\/economictimes.indiatimes.com\/industry\/energy\/oil-gas\/india-other-nations-to-benefit-from-us-waiver-on-iran-oil-buys-minister\/articleshow\/66488944.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66488955,width-1070,height-580,imgsize-125916,overlay-economictimes\/photo.jpg","relevancy":78},{"author":"AFP","content":"Iran’s supreme leader Ayatollah Ali Khamenei. (AFP pic) TEHRAN: Iran’s supreme leader Ayatollah Ali Khamenei said Saturday that President Donald Trump has “disgraced” US prestige and would be the ultimate loser from renewing sanctions on the Islamic republic.… [+3074 chars]","description":"Khamenei dismissed the renewed US sanctions -- including an oil embargo -- that take effect on Monday.","publishedAt":"2018-11-03T11:31:55Z","source":{"id":null,"name":"Freemalaysiatoday.com"},"title":"Iran’s Khamenei: Trump has ‘disgraced’ US prestige","url":"https:\/\/www.freemalaysiatoday.com\/category\/world\/2018\/11\/03\/irans-khamenei-trump-has-disgraced-us-prestige\/","urlToImage":"https:\/\/s3media.freemalaysiatoday.com\/wp-content\/uploads\/2018\/11\/khamenei-afp0311.jpg","relevancy":50},{"author":"Press Trust of India","content":"The US sanctions will hit Iran in a big way from November 5, President Donald Trump has said, asserting that the \"toughest-ever\" punitive measures have been put in place for a \"corrupt regime\" in Tehran. Speaking with the reporters at the White House on Frida… [+3244 chars]","description":"Earlier, in an interview with the Sean Hannity Show, US Secretary of State Mike Pompeo alleged that Iran was the world's largest state sponsor of terror","publishedAt":"2018-11-03T11:40:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"'Toughest-ever' punitive measures will hit Iran in big way: Trump","url":"https:\/\/www.business-standard.com\/article\/international\/toughest-ever-punitive-measures-will-hit-iran-in-big-way-trump-118110300581_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-10\/08\/full\/1539017155-7856.jpg","relevancy":86},{"author":null,"content":"Sampath Reddy Bajaj Allianz Life Insurance The Indian markets presently seem to be in a consolidation mode, and the correction has been accentuated by various macro challenges like elevated crude oil prices, rupee depreciation versus the dollar and the recent… [+5452 chars]","description":"Valuations have become more reasonable with the recent correction, and Indiaâ\u0080\u0099s long term growth story still remains intact and better poised than some of its emerging market peers.","publishedAt":"2018-11-03T11:46:12Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"Investors underweight on equities should buy on dips: Bajaj Allianz","url":"https:\/\/www.moneycontrol.com\/news\/business\/markets\/investors-underweight-on-equities-should-buy-on-dips-bajaj-allianz-3126331.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2018\/09\/Sampath_Reddy-e1537254782423-770x433.jpg","relevancy":41},{"author":null,"content":"To continue, please click the box below to let us know you're not a robot.","description":"Bloomberg How US Can Force the World to Squeeze Iran's Oil: QuickTake Bloomberg Once a major customer, the U.S. hasn't bought oil from Iran for more than 25 years. How, then, can it lead a global movement to stop Iran from selling its chief export? The answer…","publishedAt":"2018-11-03T11:47:31Z","source":{"id":"bloomberg","name":"Bloomberg"},"title":"How US Can Force the World to Squeeze Iran's Oil: QuickTake - Bloomberg","url":"https:\/\/www.bloomberg.com\/tosv2.html?vid=&uuid=840b05d0-df76-11e8-b857-978483372803&url=L25ld3MvYXJ0aWNsZXMvMjAxOC0xMS0wMy9ob3ctdS1zLWNhbi1mb3JjZS10aGUtd29ybGQtdG8tc3F1ZWV6ZS1pcmFuLXMtb2lsLXF1aWNrdGFrZQ==","urlToImage":null,"relevancy":101},{"author":null,"content":"In May, US President Donald Trump pulled the US out of the 2015 Joint Comprehensive Plan of Action.(File) Washington: Sanctions will hit Iran in a big way from November 5, US President Donald Trump has said, asserting that the \"toughest-ever\" punitive measure… [+2615 chars]","description":"Sanctions will hit Iran in a big way from November 5, US President Donald Trump has said, asserting that the \"toughest-ever\" punitive measures have been put in place for a \"corrupt regime\" in Tehran.","publishedAt":"2018-11-03T11:56:47Z","source":{"id":null,"name":"Ndtv.com"},"title":"Sanctions Will Hit Iran In A Big Way From November 5, Says Donald Trump","url":"https:\/\/www.ndtv.com\/world-news\/sanctions-will-hit-iran-in-a-big-way-from-november-5-says-us-president-donald-trump-1942375","urlToImage":"https:\/\/c.ndtvimg.com\/2018-11\/9ts3tf3k_donald-trump-ndtv-file_625x300_01_November_18.jpg","relevancy":74},{"author":"Utpal Bhaskar","content":"New Delhi: India and other major energy buyers will benefit from the US waiver on Iran sanctions, petroleum minister Dharmendra Pradhan said on Saturday. Also read: US open to new Iran deal, says Trump India is a major importer of Iranian oil — of the 220.4 m… [+1730 chars]","description":"India is a major importer of Iranian oil — of the 220.4 million metric tonnes of crude imported by India in 2017-18, more than 9% was from Iran","publishedAt":"2018-11-03T12:02:39Z","source":{"id":null,"name":"Livemint.com"},"title":"Pradhan credits US waiver on Iran oil imports to PM Modi","url":"https:\/\/www.livemint.com\/Politics\/o5l8DGittzzju3kagSEIaO\/Pradhan-credits-US-waiver-on-Iran-oil-imports-to-PM-Modi.html","urlToImage":"https:\/\/www.livemint.com\/rf\/Image-621x414\/LiveMint\/Period2\/2018\/11\/05\/Photos\/Processed\/modi-keeH--621x414@LiveMint-ca8e.jpg","relevancy":21},{"author":"PTI","content":"WASHINGTON: The US sanctions will hit Iran in a big way from November 5, President Donald Trump has said, asserting that the \"toughest-ever\" punitive measures have been put in place for a \"corrupt regime\" in Tehran. Speaking with the reporters at the White Ho… [+3256 chars]","description":"Trump asserted that the \"toughest-ever\" punitive measures have been put in place for a \"corrupt regime\" in Tehran.","publishedAt":"2018-11-03T12:12:44Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"Sanctions will hit Iran in big way from Nov 5: Donald Trump","url":"https:\/\/economictimes.indiatimes.com\/news\/international\/world-news\/sanctions-will-hit-iran-in-big-way-from-nov-5-donald-trump\/articleshow\/66489285.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66489297,width-1070,height-580,imgsize-161896,overlay-economictimes\/photo.jpg","relevancy":88},{"author":"Melissa Darlyne Chow","content":"KUALA LUMPUR: Former prime minister Najib Razak continued to pour scorn on the 2019 Budget tabled by Finance Minister Lim Guan Eng yesterday, zeroing in on the move to force the government’s study loan borrowers who earn at least RM1,000 to pay back their loa… [+3008 chars]","description":"The former prime minister says even Bangladeshi menial workers earn more than RM1,000, the minimum salary required for PTPTN borrowers to repay.","publishedAt":"2018-11-03T12:42:48Z","source":{"id":null,"name":"Freemalaysiatoday.com"},"title":"Bangladeshis earn more, says Najib on new minimum salary for PTPTN repayment","url":"https:\/\/www.freemalaysiatoday.com\/category\/nation\/2018\/11\/03\/bangladeshis-earn-more-says-najib-on-new-minimum-salary-for-ptptn-repayment\/","urlToImage":"https:\/\/s3media.freemalaysiatoday.com\/wp-content\/uploads\/2018\/11\/najib-fmt-bn_31118.jpg","relevancy":79},{"author":"Reuters Editorial","content":"NEW DELHI (Reuters) - India’s Oil and Natural Gas Corp Ltd posted a 61 percent jump in second-quarter profit on Saturday, with higher crude oil prices helping it to beat forecasts. ONGC’s net profit stood at 82.65 billion rupees ($1.14 billion) in the quarter… [+412 chars]","description":"India's Oil and Natural Gas Corp Ltd posted a 61 percent jump in second-quarter profit on Saturday, with higher crude oil prices helping it to beat forecasts.","publishedAt":"2018-11-03T12:52:58Z","source":{"id":"reuters","name":"Reuters"},"title":"ONGC second-quarter profit rises, beats estimate","url":"https:\/\/in.reuters.com\/article\/ongc-results\/ongc-second-quarter-profit-rises-beats-estimate-idINKCN1N80D5","urlToImage":"https:\/\/s1.reutersmedia.net\/resources\/r\/?m=02&d=20181103&t=2&i=1321613392&w=1200&r=LYNXNPEEA20A2","relevancy":57},{"author":"trainee5","content":"A tough balancing act between geopolitical realities and energy security Mains Paper 2: Economy Prelims level: Organization of the Petroleum Exporting Countries Mains level: Energy, Infrastructure etc. Introduction The US oil and banking sanctions against Ira… [+2918 chars]","description":"A tough balancing act between geopolitical realities and energy security Mains Paper 2: Economy Prelims level: Organization of the Petroleum Exporting Countries Mains level: Energy, Infrastructure etc. Introduction The US oil and banking sanctions against Ira…","publishedAt":"2018-11-03T12:57:32Z","source":{"id":null,"name":"Iasexamportal.com"},"title":"THE GIST of Editorial for UPSC Exams : 03 November 2018 (A tough balancing act between geopolitical realities and energy security)","url":"https:\/\/iasexamportal.com\/editorial-gist\/03-11-2018-a-tough-balancing-act-between-geopolitical-realities-and-energy-security?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+upscportal+%28IAS+EXAM+PORTAL++-+India%27s+Largest+UPSC%2C+IAS+Aspirants+Community.%29","urlToImage":null,"relevancy":31},{"author":"Gina Heeb","content":"In the wake of President Donald Trump's withdrawal from the Iran nuclear deal earlier this year, Washington will reinstate more economic penalties against Tehran at midnight on Monday. This is the second round of sanctions the administration has enacted since… [+3056 chars]","description":"The US will reimpose oil sanctions against Iran on Monday. Eight countries are set to receive sanctions waivers. But they could still end up squeezing global oil supply. In the wake of President Donald Trump’s withdrawal from the Iran nuclear deal earlier thi…","publishedAt":"2018-11-03T13:00:00Z","source":{"id":"business-insider","name":"Business Insider"},"title":"Here's why Trump wants to shut Iran out of the oil market","url":"https:\/\/www.businessinsider.com\/trump-iran-sanctions-oil-explained-2018-11","urlToImage":"https:\/\/amp.businessinsider.com\/images\/5b1043b71ae6621d008b4d73-2732-1366.jpg","relevancy":69},{"author":"Gina Heeb","content":"Raheb Homavandi\/Reuters In the wake of President Donald Trump’s withdrawal from the Iran nuclear deal earlier this year, Washington will reinstate more economic penalties against Tehran at midnight on Monday. This is the second round of sanctions the administ… [+3080 chars]","description":"The US will reimpose oil sanctions against Iran on Monday. Eight countries are set to receive sanctions waivers. But they could still end up squeezing global oil supply. In the wake of President Donald Trump’s withdrawal from the Iran nuclear deal earlier thi…","publishedAt":"2018-11-03T13:00:00Z","source":{"id":"business-insider","name":"Business Insider"},"title":"Here's why Trump wants to shut Iran out of the oil market","url":"https:\/\/markets.businessinsider.com\/commodities\/news\/trump-iran-sanctions-oil-explained-2018-11-1027686712","urlToImage":"https:\/\/static1.businessinsider.com\/image\/55a507fc69beddaf0309cb5e-2400\/rtxnnjh.jpg","relevancy":36},{"author":"Gina Heeb","content":null,"description":"The US will reimpose oil sanctions against Iran on Monday. Eight countries are set to receive sanctions waivers. But they could still end up squeezing global oil supply. In the wake of President Donald Trump’s withdrawal from the Iran nuclear deal earlier thi…","publishedAt":"2018-11-03T13:00:00Z","source":{"id":"google-news","name":"Google News"},"title":"Here's why Trump wants to shut Iran out of the oil market","url":"http:\/\/feedproxy.google.com\/~r\/TheMoneyGame\/~3\/ToF6VfWzaes\/trump-iran-sanctions-oil-explained-2018-11","urlToImage":null,"relevancy":42},{"author":null,"content":"Analysts on average had expected a profit of Rs 6,861 crore, according to Refinitiv data. NEW DELHI: Oil and Natural Gas Corporation posted a 61 per cent jump in second-quarter profit on Saturday, with higher crude oil prices helping it to beat forecasts. ONG… [+360 chars]","description":"Income from operations rose by 47.5 per cent to Rs 27,989 crore, ONGC said.","publishedAt":"2018-11-03T13:07:28Z","source":{"id":null,"name":"Ndtv.com"},"title":"ONGC Posts Profit Of Rs 8,265 Crore In September Quarter","url":"https:\/\/www.ndtv.com\/business\/ongc-posts-profit-of-rs-8-265-crore-in-september-quarter-beats-analysts-estimates-1942398","urlToImage":"https:\/\/i.ndtvimg.com\/i\/2016-08\/ongc_650x400_81470991980.jpg","relevancy":67},{"author":"Reuters","content":"New Delhi: Oil and Natural Gas Corp Ltd posted a 61% jump in second-quarter profit on Saturday, with higher crude oil prices helping it to beat forecasts. ONGC’s net profit stood at Rs 8,265 crore in the quarter ended 30 September, compared with Rs 5,130 cror… [+340 chars]","description":"ONGC’s net profit stood at Rs 8,265 crore in the quarter ended 30 September, compared with Rs 5,130 crore a year earlier","publishedAt":"2018-11-03T13:12:24Z","source":{"id":null,"name":"Livemint.com"},"title":"Q2 results: ONGC profit rises 61%, beats estimates","url":"https:\/\/www.livemint.com\/Companies\/aQq3n0DJKCDh5Kz2aZCUXI\/Q2-results-ONGC-profit-rises-16-beats-estimates.html","urlToImage":"https:\/\/www.livemint.com\/rf\/Image-621x414\/LiveMint\/Period2\/2018\/11\/05\/Photos\/Processed\/ONGC-kzMG--621x414@LiveMint-a86a.jpg","relevancy":66},{"author":"Double Dividend Stocks","content":"Interested in new high-yield ideas? How about ones with no K-1? Maybe you should take a look at Tallgrass Energy LP ( TGE ), a new midstream company which came out of a merger between a GP and its yieldco this past summer. The merger eliminated the GP Incenti… [+7528 chars]","description":"The yield is 9.4%, with strong 1.26x coverage. Q3 earnings were robust - revenues up 14%, EBITDA and cash available for distribution up by triple digits. It has","publishedAt":"2018-11-03T13:15:00Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"A 9% Yield, Major Growth, 13 Straight Hikes, Analyst Upgrades, Upside Potential, No K-1","url":"https:\/\/seekingalpha.com\/article\/4217595-9-percent-yield-major-growth-13-straight-hikes-analyst-upgrades-upside-potential-kminus-1","urlToImage":"https:\/\/static.seekingalpha.com\/uploads\/2018\/11\/1\/418011-15411196551049263_origin.png","relevancy":99},{"author":"Press Trust of India","content":"State-owned Oil and Natural Gas Corp (ONGC) Saturday reported a 61 per cent jump in its September quarter net profit as higher prices offset a dip in oil production. Its net profit was Rs 82.65 billion in July-September as compared to Rs 51.31 billion in the … [+1681 chars]","description":"Its net profit was Rs 82.65 billion in July-September as compared to Rs 51.31 billion in the same period last year, the company said in a statement","publishedAt":"2018-11-03T13:25:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"ONGC posts 61% rise in net profit to Rs 82.65 billion in Sept quarter","url":"https:\/\/www.business-standard.com\/article\/companies\/ongc-posts-61-rise-in-net-profit-to-rs-82-65-billion-in-sept-quarter-118110300692_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2017-09\/28\/full\/1506541901-6772.jpg","relevancy":75},{"author":"PTI","content":"State-owned Oil and Natural Gas Corp (ONGC) Saturday reported a 61 per cent jump in its September quarter net profit as higher prices offset a dip in oil production. Its net profit was 8,265 crore in July-September as compared to 5,131 crore in the same perio… [+1637 chars]","description":"State-owned Oil and Natural Gas Corp (ONGC) Saturday reported a 61 per cent jump in its September quarter net profit as higher prices offset a dip in oil production. Its net profit was &#8377;8,265 cr","publishedAt":"2018-11-03T13:43:03Z","source":{"id":null,"name":"Thehindubusinessline.com"},"title":"ONGC posts 61% rise in Q2 net at ₹8,265 cr","url":"https:\/\/www.thehindubusinessline.com\/companies\/ongc-posts-61-rise-in-q2-net-at-8265-cr\/article25413561.ece","urlToImage":"https:\/\/www.thehindubusinessline.com\/incoming\/dzw68l\/article25045606.ece\/ALTERNATES\/LANDSCAPE_615\/ongcjpg","relevancy":81},{"author":"","content":"TRENTON, N.J. (AP) Drivers in New Jersey and around the country are getting another break at the pump with the continuing decrease of gas prices. Receive today's headlines in your inbox with our daily news email SUBSCRIBE TODAY AAA Mid-Atlantic says the avera… [+631 chars]","description":"TRENTON, N.J. (AP) — Drivers in New Jersey and around the country are getting another break at the pump with the continuing decrease of gas prices.","publishedAt":"2018-11-03T13:48:19Z","source":{"id":"associated-press","name":"Associated Press"},"title":"Gas prices still falling in New Jersey, around the country","url":"https:\/\/apnews.com\/ae285ef6cbbd44aeb07e011e5d096bb7","urlToImage":"https:\/\/bloximages.newyork1.vip.townnews.com\/roanoke.com\/content\/tncms\/custom\/image\/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","relevancy":93},{"author":"Nick Cawley, Analyst, Nick Cawley","content":"Fundamental Forecast for GBP: Neutral Sterling (GBP) Talking Points: Positive Brexit ‘talk’ boosts Sterling sentiment. Provisional Q3 GDP data may underpin GDP. The DailyFX Q4 GBP Forecast is available to download. We remain neutral on Sterling going into nex… [+2467 chars]","description":"A decent week for Sterling bulls with GBP pushing ahead across a wide range of currencies. UK Q3 GDP is released next week, but as always Brexit oversees market moves.","publishedAt":"2018-11-03T14:00:00Z","source":{"id":null,"name":"Dailyfx.com"},"title":"GBP: Sterling’s Rally May Have More Room - All Things Being Equal","url":"https:\/\/www.dailyfx.com\/forex\/fundamental\/forecast\/weekly\/gbp\/2018\/11\/02\/Sterlings-Rally-May-Have-More-Room-All-Things-Being-Equal.html","urlToImage":null,"relevancy":98},{"author":"Reuters","content":"Chevron Corp said on Friday its quarterly profit doubled as record oil and gas production helped overcome a series of one-time items. Photo: File INTERNATIONAL US oil and natural gas producer Chevron said on Friday that its quarterly profit doubled as record … [+1575 chars]","description":"Chevron Corp said on Friday its quarterly profit doubled as record oil and gas production helped overcome a series of one-time items.","publishedAt":"2018-11-03T14:00:00Z","source":{"id":null,"name":"Iol.co.za"},"title":"Chevron quarterly profit doubles as US oil production jumps","url":"https:\/\/www.iol.co.za\/business-report\/international\/chevron-quarterly-profit-doubles-as-us-oil-production-jumps-17751453","urlToImage":"https:\/\/image.iol.co.za\/image\/1\/process\/620x349?source=https:\/\/cdn.africannewsagency.com\/public\/ana\/media\/media\/2018\/07\/23\/1532325350485.jpg&operation=CROP&offset=0x220&resize=3500x1965","relevancy":90},{"author":"","content":"BISMARCK, N.D. (AP) A group of landowners from the Fort Berthold Indian Reservation is accusing a crude oil company of trespassing in a lawsuit that seeks compensation for a pipeline that crosses their land. The Bismarck Tribune reports that the former Mandan… [+836 chars]","description":"BISMARCK, N.D. (AP) — A group of landowners from the Fort Berthold Indian Reservation is accusing a crude oil company of trespassing in a lawsuit that seeks compensation for a pipeline that crosses their land.","publishedAt":"2018-11-03T14:03:29Z","source":{"id":"associated-press","name":"Associated Press"},"title":"Fort Berthold reservation landowners to sue oil company","url":"https:\/\/apnews.com\/82f98ab7ff544558a7a54964a31911aa","urlToImage":"https:\/\/bloximages.newyork1.vip.townnews.com\/roanoke.com\/content\/tncms\/custom\/image\/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","relevancy":85},{"author":"Byline Manual","content":"Of all the modern inventions we rely on in our daily lives, the alarm clock is probably the most universally despised. Its jarring morning jangles jolt us uncomfortably out of our slumber, and back to reality. And yet however annoying alarm clocks are, they'r… [+6230 chars]","description":"How did people wake up before the invention of modern alarm clocks?","publishedAt":"2018-11-03T14:18:00Z","source":{"id":null,"name":"Livescience.com"},"title":"How Did People Wake Up Before Alarm Clocks?","url":"https:\/\/www.livescience.com\/64002-how-wake-up-before-alarm-clocks.html","urlToImage":"https:\/\/img.purch.com\/h\/1000\/aHR0cDovL3d3dy5saXZlc2NpZW5jZS5jb20vaW1hZ2VzL2kvMDAwLzEwMi82NTAvb3JpZ2luYWwvYWxhcm0tY2xvY2stc2h1dHRlcnN0b2NrLmpwZw==","relevancy":47},{"author":"Yoganand D","content":"The bullish global cues, coupled with the appreciating rupee and fall in crude oil price, have cheered the bulls and lifted the sentiment for the domestic equity market. The Nifty as well as the Sensex surged 5 per cent each last week, due to upbeat global fa… [+4949 chars]","description":"Investors should, however, tread with caution in the truncated week","publishedAt":"2018-11-03T15:13:12Z","source":{"id":null,"name":"Thehindubusinessline.com"},"title":"Indices bring cheer ahead of Diwali","url":"https:\/\/premium.thehindubusinessline.com\/portfolio\/technical-analysis\/indices-bring-in-cheer-ahead-of-diwali\/article25413626.ece","urlToImage":"https:\/\/www.thehindubusinessline.com\/money-and-banking\/nwbbsq\/article24578713.ece\/ALTERNATES\/LANDSCAPE_615\/USA-FED","relevancy":87},{"author":"Special Correspondent","content":"Paint companies operating in the decorative segment expect to have a good quarter during this festive season, despite input cost hikes they have suffered on account of the increase in crude prices and rupee depreciation. This is because most of the paint comp… [+1611 chars]","description":"Input costs rise on oil price appreciation, rupee depreciation","publishedAt":"2018-11-03T15:14:14Z","source":{"id":"the-hindu","name":"The Hindu"},"title":"Paint firms pass on cost hikes to customers, buoyed by festive sales","url":"https:\/\/www.thehindu.com\/business\/paint-firms-pass-on-cost-hikes-to-customers-buoyed-by-festive-sales\/article25414064.ece","urlToImage":"https:\/\/www.thehindu.com\/static\/theme\/default\/base\/img\/og-image.jpg","relevancy":33},{"author":"Alleen Brown, Jihan Hafiz","content":"To find Honorata Defenders home on the Standing Rock Sioux Reservation, mention her name to whoever you can find walking down the main street of her tiny town. Theyll tell you to turn when you get to the powwow grounds and to take the paved road, rather than … [+20286 chars]","description":"Standing Rock tribal members were skeptical of supporting Democrat Sen. Heidi Heitkamp. Then Republicans attempted to stop them from voting at all. The post Standing Rock Pitches Last-Ditch Fight for the Right to Vote in North Dakota appeared first on The Int…","publishedAt":"2018-11-03T15:36:43Z","source":{"id":null,"name":"Theintercept.com"},"title":"Standing Rock Pitches Last-Ditch Fight for the Right to Vote in North Dakota","url":"https:\/\/theintercept.com\/2018\/11\/03\/native-americans-north-dakota-voter-id-law\/","urlToImage":"https:\/\/theintercept.imgix.net\/wp-uploads\/sites\/1\/2018\/11\/Native-Voting-Rights-Still-1541252673.png?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800","relevancy":40},{"author":"Fear & Greed Trader","content":"\"The financial markets generally are unpredictable. So that one has to have different scenarios.\" - George Soros For anyone that is bullish, it was the month to forget. On October 30th, the S&amp;P went 28 consecutive days without achieving back-to-back up da… [+23617 chars]","description":"U.S. economic data remains positive, global data is soft, therein lies the problem. A rebound rally off the lows is underway, but nothing has been resolved just","publishedAt":"2018-11-03T15:51:02Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"S&P 500 Weekly Update: The Stock Market At A Crossroads","url":"https:\/\/seekingalpha.com\/article\/4217901-s-and-p-500-weekly-update-stock-market-crossroads","urlToImage":"https:\/\/static.seekingalpha.com\/uploads\/2018\/11\/2\/saupload_Q8_k8wbsjtmxDVjrU_vcah4yQG7d8txpVaX6BKCGsiuhDqx5feeLoxhRLm1OK5lQS1itjQYVosss8n8r-apb_PYZjhmoP7kSXzYYR0EWx8xaZ1T-94RoqEjLPYn7s_a28l1ao2FJ.jpeg","relevancy":113},{"author":"Special Correspondent","content":"Paint companies operating in the decorative segment expect to have a good quarter during this festive season, despite input cost hikes they have suffered on account of the increase in crude prices and rupee depreciation. This is because most of the paint comp… [+1611 chars]","description":"Input costs rise on oil price appreciation, rupee depreciation","publishedAt":"2018-11-03T15:51:15Z","source":{"id":"the-hindu","name":"The Hindu"},"title":"Paint firms pass on cost hikes to customers, buoyed by festive sales","url":"https:\/\/www.thehindu.com\/business\/Industry\/paint-firms-pass-on-cost-hikes-to-customers-buoyed-by-festive-sales\/article25414064.ece","urlToImage":"https:\/\/www.thehindu.com\/static\/theme\/default\/base\/img\/og-image.jpg","relevancy":7},{"author":"The Star Online","content":"NEW US sanctions on Iran’s oil industry, set to begin tomorrow, were supposed to exert maximum pressure on Iran’s economy. Since the pullout from the Iran nuclear deal was announced in May, the Trump administration has claimed a goal of cutting Iran’s oil exp… [+6596 chars]","description":"Extreme bluster followed by a calmer acceptance seems to be a regular Trump tactic, one he also used in trade negotiations with North Korea, Canada, Mexico and even the EU.","publishedAt":"2018-11-03T16:00:00Z","source":{"id":null,"name":"Thestar.com.my"},"title":"Trump and the art of the Iranian deal","url":"http:\/\/www.thestar.com.my\/news\/world\/2018\/11\/04\/trump-and-the-art-of-the-iranian-deal-extreme-bluster-followed-by-a-calmer-acceptance-seems-to-be-a\/","urlToImage":"https:\/\/cdn.thestar.com.my\/Themes\/img\/newTsol_logo_socmedia.png?v=2018114","relevancy":110},{"author":"Rupert Hargreaves","content":"Over the past 12 months, the price of oil has been on a tear. After bottoming at a low of around $30 per barrel towards the end of 2016, Brent has since recovered to trade above $80, up more than $20 a barrel year-on-year. Rising prices have been a boon for o… [+5425 chars]","description":"Over the past 12 months, the price of oil has been on a tear. After bottoming at a low of around $30 per barrel towards the end of 2016, Brent has since recovered to trade above $80, up more than […] The post BoA: $100\/bbl Oil Is Coming And It’s Bad News For …","publishedAt":"2018-11-03T17:30:47Z","source":{"id":null,"name":"Valuewalk.com"},"title":"BoA: $100\/bbl Oil Is Coming And It’s Bad News For The Economy","url":"https:\/\/www.valuewalk.com\/2018\/11\/boa-100-bbl-price-of-oil\/","urlToImage":"https:\/\/www.valuewalk.com\/wp-content\/uploads\/2018\/10\/Screenshot-2018-10-23-at-12.24.53.png","relevancy":48},{"author":"Hoya Capital Real Estate","content":"Real Estate Weekly Review Coming off one of the worst weeks for US equities since the financial crisis, the S&amp;P 500 ( SPY ) jumped more than 2.5% on the week as strong earnings and solid economic data eased investor fears following a volatile October. The… [+11993 chars]","description":"Good riddance, October. US equity markets rallied more than 2% on the week as strong earnings and solid economic data eased investor fears following a volatile","publishedAt":"2018-11-03T17:45:17Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"Real Estate Rallies On Strong Earnings, Robust Jobs Report","url":"https:\/\/seekingalpha.com\/article\/4217917-real-estate-rallies-strong-earnings-robust-jobs-report","urlToImage":"https:\/\/static.seekingalpha.com\/uploads\/2018\/11\/1723581_15411969661631_rId8_thumb.jpg","relevancy":82},{"author":"Ilya Spivak, Sr. Currency Strategist, Ilya Spivak","content":"US DOLLAR FUNDAMENTAL FORECAST: BULLISH Midterm elections to overshadow status-quo Fed policy announcement Baseline bets favor divided Congress, which may boost the US Dollar Fears of political clash may send USD lower if the full Congress flips See our US Do… [+3077 chars]","description":"Midterm elections are set to overshadow a monetary policy announcement form the Federal Reserve. Their outcome seems likely to be supportive for the US Dollar.","publishedAt":"2018-11-03T18:00:00Z","source":{"id":null,"name":"Dailyfx.com"},"title":"US Dollar Likely to Rise as the Midterm Elections Outcome Emerges","url":"https:\/\/www.dailyfx.com\/forex\/fundamental\/forecast\/weekly\/usd\/2018\/11\/02\/US-Dollar-Likely-to-Rise-as-the-Midterm-Elections-Outcome-Emerges.html","urlToImage":null,"relevancy":106},{"author":"Sal Mercogliano","content":"by Salvatore R. Mercogliano, Ph.D. (gCaptain) Many members of the maritime industry enter the profession without an adequate knowledge of what preceded it and how it evolved over time. Even those who graduate from professional institutions, such as the states… [+2788 chars]","description":"by Salvatore R. Mercogliano, Ph.D. (gCaptain) Many members of the maritime industry enter the profession without an adequate knowledge of what preceded it and how it evolved over time. Even those who graduate from professional institutions, such as the states…","publishedAt":"2018-11-03T18:03:14Z","source":{"id":null,"name":"Gcaptain.com"},"title":"gCaptain Bookshelf – Review of Maritime Transport 2018?","url":"https:\/\/gcaptain.com\/gcaptain-bookshelf-review-of-maritime-transport-2018%e2%80%a8\/","urlToImage":"https:\/\/gcaptain.com\/wp-content\/uploads\/2018\/11\/Review-of-Maritime-Transport.jpg","relevancy":105},{"author":"By KRISTINE GALLOWAY Wyoming Tribune Eagle","content":"CHEYENNE, Wyo. (AP) Oilfield byproduct water is now a resource instead of a waste, and that new resource may improve the livelihoods of farmers and ranchers. Encore Green and the Beneficial-Use Water Alliance last Monday watered local rancher Owen Goertz's gr… [+4100 chars]","description":"CHEYENNE, Wyo. (AP) — Oilfield byproduct water is now a resource instead of a waste, and that new resource may improve the livelihoods of farmers and ranchers.","publishedAt":"2018-11-03T18:38:53Z","source":{"id":"associated-press","name":"Associated Press"},"title":"Encore Green finalizes cleaned byproduct water trial","url":"https:\/\/apnews.com\/7901555265554d50ac3f5c0a61121300","urlToImage":"https:\/\/bloximages.newyork1.vip.townnews.com\/richmond.com\/content\/tncms\/custom\/image\/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg","relevancy":95},{"author":null,"content":"When it comes to the future of its oil industry, Nigeria is looking miles out to sea. By early next year, the largest offshore production vessel ever delivered to Nigeria will start pumping crude from a deposit deep beneath the seabed, boosting the West Afric… [+4494 chars]","description":"By early next year, the largest offshore production vessel ever delivered to Nigeria will start pumping crude from a deposit deep beneath the seabed, boosting the West African country's oil output by about 10 percent.","publishedAt":"2018-11-03T18:54:18Z","source":{"id":null,"name":"Stripes.com"},"title":"Nigeria heads to sea in search of future for oil producers","url":"https:\/\/www.stripes.com\/news\/africa\/nigeria-heads-to-sea-in-search-of-future-for-oil-producers-1.555087?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+starsandstripes%2Fgeneral+%28Stars+and+Stripes%29","urlToImage":"https:\/\/www.stripes.com\/img\/socialmedia\/images\/facebook_default.jpg","relevancy":62},{"author":"Adam Shaw","content":"European leaders are opening the door to possible sanctions on Iran in the wake of terror plots across the continent -- even as they criticize the Trump administration for reimposing sanctions on the Islamic Republic’s oil exports and financial dealings. Denm… [+5164 chars]","description":"Fox News Europe opens door to sanctions on Iran after terror plots in Denmark, Paris Fox News European leaders are opening the door to possible sanctions on Iran in the wake of terror plots across the continent -- even as they criticize the Trump administrati…","publishedAt":"2018-11-03T18:57:19Z","source":{"id":"fox-news","name":"Fox News"},"title":"Europe opens door to sanctions on Iran after terror plots in Denmark, Paris - Fox News","url":"https:\/\/www.foxnews.com\/politics\/europe-opens-door-to-sanctions-on-iran-after-terror-plots-in-denmark-paris","urlToImage":"https:\/\/media2.foxnews.com\/BrightCove\/694940094001\/2018\/11\/02\/694940094001_5856837669001_5856830096001-vs.jpg","relevancy":23},{"author":"Rakesh Sharma","content":"For the better part of 2016, oil prices dominated headlines. The surge in oil production from American shale oil producers and the Organization of Petroleum-Exporting Countries (OPEC) led to a corresponding reduction in price. This is not the first time that … [+3710 chars]","description":"Oil has made headlines for its plummeting price action in 2016, with experts saying a rebound was due in 2017. After a sharp drop, it rebounded strongly.","publishedAt":"2018-11-03T19:29:00Z","source":{"id":null,"name":"Investopedia.com"},"title":"What Happened to Oil Prices in 2017","url":"https:\/\/www.investopedia.com\/articles\/investing\/100615\/will-oil-prices-go-2017.asp","urlToImage":"https:\/\/i.investopedia.com\/dimages\/graphics\/thinkstockphotos-468187346_0.jpg","relevancy":30},{"author":null,"content":"If you build it, he will come. That often misquoted and often parodied line from the movie Field of Dreams has inspired generations of starry-eyed entrepreneurs. Unfortunately, for aspiring gas exporters, in the LNG business it is fundamentally untrue. No mat… [+9754 chars]","description":"Russia and US compete in Europe, Big Oil makes big money, energy subsidies’ comeback","publishedAt":"2018-11-03T20:15:38Z","source":{"id":"financial-times","name":"Financial Times"},"title":"The week in energy: gas field of dreams","url":"https:\/\/www.ft.com\/content\/553a94b4-deb8-11e8-8f50-cbae5495d92b","urlToImage":"https:\/\/www.ft.com\/__origami\/service\/image\/v2\/images\/raw\/http%3A%2F%2Fprod-upp-image-read.ft.com%2Fa750e4d2-debe-11e8-b173-ebef6ab1374a?source=next-opengraph&fit=scale-down&width=900","relevancy":19},{"author":null,"content":"Nov. 3 (UPI) -- Iran's supreme leader Ayatollah Ali Khamenei said Saturday that President Donald Trump has \"disgraced\" U.S. prestige and his nation has prevailed over 40 years of conflict. Khamenei spoke one day in Tehran after the United States restored sanc… [+2966 chars]","description":"Iran's supreme leader Ayatollah Ali Khamenei said that President Donald Trump has \"disgraced\" U.S. prestige and has prevailed over 40 years of conflict.","publishedAt":"2018-11-03T20:50:15Z","source":{"id":null,"name":"Upi.com"},"title":"Iran's Khamenei: Trump has 'disagraced' U.S. prestige","url":"https:\/\/www.upi.com\/Top_News\/World-News\/2018\/11\/03\/Irans-Khamenei-Trump-has-disgraced-US-prestige\/6821541275256\/","urlToImage":"https:\/\/cdnph.upi.com\/sv\/ph\/og\/upi_com\/6821541275256\/2018\/1\/8bc929e6ebed11e78bb9522f2bfe2449\/v1.5\/Irans-Khamenei-Trump-has-disgraced-US-prestige.jpg","relevancy":100},{"author":"newsfeedback@fool.com (John Bromels)","content":"Paying off the credit card feels great, doesn't it? Maybe not quite as good as winning the Powerball lottery, but there's still something wonderfully satisfying about being debt-free...at least until the next credit card bill comes due next month. Energy indu… [+7014 chars]","description":"Even though it's on firmer footing than it was last year, top-yielding NuStar Energy may still be in trouble.","publishedAt":"2018-11-03T21:03:00Z","source":{"id":null,"name":"Fool.com"},"title":"This 14% Yielder Is Making a Risky Bet","url":"https:\/\/www.fool.com\/investing\/2018\/11\/03\/this-14-yielder-is-making-a-risky-bet.aspx","urlToImage":"https:\/\/g.foolcdn.com\/image\/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F498996%2Fgetty-oil-pipes-to-refinery.jpg&h=630&w=1200&op=resize","relevancy":5},{"author":"Justin McQueen, Analyst, Justin McQueen","content":"Fundamental Forecast for Gold: Neutral Gold Price Analysis and Talking Points: A choppy week saw gold prices close the week flat US Mid-Term Elections and Federal Reserve on the Agenda See our quarterly gold forecast to learn what will drive prices through mi… [+2719 chars]","description":"Gold set for another volatile week as markets focus on Mid-Term election outcome, while recent gains in the Yuan keep prices at elevated levels.","publishedAt":"2018-11-03T22:00:00Z","source":{"id":null,"name":"Dailyfx.com"},"title":"Gold Forecast: Mid-Term Election May Provide Catalyst for Topside Breakout","url":"https:\/\/www.dailyfx.com\/forex\/fundamental\/forecast\/weekly\/chf\/2018\/11\/02\/Gold-Forecast-Mid-Term-Election-May-Provide-Catalyst-for-Topside-Breakout.html","urlToImage":null,"relevancy":83},{"author":"-NO AUTHOR-","content":"(Photo: Twitter) President Trump’s decision to pull the United States out of Barack Obama’s Joint Comprehensive Plan of Action with Iran, which lifted sanctions and gave the rogue Islamic regime pallets of cash, already is having an impact. A new Congressiona… [+2960 chars]","description":"President Trump’s decision to pull the United States out of Barack Obama’s Joint Comprehensive Plan of Action with Iran, which lifted sanctions and gave the rogue Islamic regime pallets of cash, already is having an impact. A new Congressional Research Servic…","publishedAt":"2018-11-03T23:25:11Z","source":{"id":null,"name":"Wnd.com"},"title":"Trump sanctions on Iran already hurting rogue regime","url":"https:\/\/www.wnd.com\/2018\/11\/trump-sanctions-on-iran-already-hurting-rogue-regime\/","urlToImage":"https:\/\/www.wnd.com\/files\/2016\/01\/Iran-deal-TW.jpg","relevancy":58},{"author":"Sputnik","content":"The Iranian Foreign Minister, Mohammad Javad Zarif, observed that US policies are facing practical opposition around the world. Zarif spoke to reporters during the 18th meeting of the Council of Foreign Ministers of the Organization of Developing Countries (D… [+1929 chars]","description":"The Iranian Foreign Minister, Mohammad Javad Zarif, observed that US policies are facing “practical opposition” around the world.","publishedAt":"2018-11-03T23:50:00Z","source":{"id":null,"name":"Sputniknews.com"},"title":"Iran’s FM Zarif: World Opposes US Behavior Over Anti-Iranian Sanctions","url":"https:\/\/sputniknews.com\/middleeast\/201811041069487276-iran-zarif-world-opposes-usa-behaviour-sanctions\/","urlToImage":"https:\/\/cdn3.img.sputniknews.com\/images\/106683\/61\/1066836109.jpg","relevancy":32}]