[{"author":"BS Web Team","content":"Ad spend may double to Rs 30 bn in 2019 polls; social media to see big jump Over the past few months, the Bharatiya Janata Party (BJP), which is in power along with alliance partners, has been releasing advertisements on television, promoting its achievements… [+2336 chars]","description":"From total advertisement spends in 2019 polls to number of brokers operating in the cash segment, BS brings you top stories to keep up with the latest news","publishedAt":"2018-11-25T01:30:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"News digest: Ad spends, realty barons, stock brokers, RBI funds, and more","url":"https:\/\/www.business-standard.com\/article\/economy-policy\/news-digest-ad-spends-realty-barons-stock-brokers-rbi-funds-and-more-118112500002_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-11\/25\/full\/1543084374-6896.jpg","relevancy":69},{"author":"Randall W. Forsyth","content":"After another tumultuous week, investors are looking ahead anxiously to two events that could crucially affect Federal Reserve policy and escalating trade tensions, key factors roiling the global financial markets. The first comes on Wednesday, when Fed Chair… [+9179 chars]","description":"A quarter-point rate hike is still likely in December, but there might be just one more in 2019. Investors eagerly await Fed chief Jerome Powell’s speech and the big G-20 meeting between Trump and China’s leader.","publishedAt":"2018-11-25T01:33:06Z","source":{"id":null,"name":"Barrons.com"},"title":"Why the Fed Could Back Down on Rate Hikes","url":"https:\/\/www.barrons.com\/articles\/why-the-fed-could-back-down-on-rate-hikes-1543109577","urlToImage":"https:\/\/images.barrons.com\/im-38402\/social","relevancy":66},{"author":"Emmanuel Okogba","content":"By Douglas Anele Concerning education, Muhammadu Buhari pledged that if elected he would target up to 20% of the national budget for education whilst making substantial investments in training quality teachers at all levels of education; provide one meal with… [+9071 chars]","description":"Sycophants in government claim that the President is deliberately slow so that he can make the best decisions; but well-informed Nigerians know the truth Continue reading President Buhari’s re-election war (3) at Vanguard News Nigeria.","publishedAt":"2018-11-25T01:35:03Z","source":{"id":null,"name":"Vanguardngr.com"},"title":"President Buhari’s re-election war (3)","url":"https:\/\/www.vanguardngr.com\/2018\/11\/president-buharis-re-election-war-3\/","urlToImage":"https:\/\/www.vanguardngr.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-31-at-12.11.34-AM-e1540941489401.png","relevancy":71},{"author":"none@none.com (Munir Akram)","content":"NOW that the financial emergency is over (with Saudi and Chinese financial support), and hopefully an IMF programme will be in place soon, the government must turn to adopting the trade, industry and investment policies required to accelerate growth, generate… [+6854 chars]","description":"NOW that the financial emergency is over (with Saudi and Chinese financial support), and hopefully an IMF programme will be in place soon, the government must turn to adopting the trade, industry and investment policies required to accelerate growth, generate…","publishedAt":"2018-11-25T02:03:05Z","source":{"id":null,"name":"Dawn.com"},"title":"Investing in Pakistan","url":"https:\/\/www.dawn.com\/news\/1447553","urlToImage":"http:\/\/i.dawn.com\/large\/2018\/11\/5bf9dafae3a08.jpg","relevancy":87},{"author":"Emmanuel Okogba","content":"By Louis Amoke For a better appreciation of the good works of Gov. Ifeanyi Ugwuanyis administration in Enugu State, it is rational to assess its stewardship from the standpoint of the nations economic adversities when the governor took over the mantle of lead… [+11841 chars]","description":"Today, we have the N10 million “one community, one project” scheme, which has also recorded a huge success in expanding development to the frontiers of the rural areas Continue reading Enugu: The Ugwuanyi template for economic development at Vanguard News Nig…","publishedAt":"2018-11-25T02:13:09Z","source":{"id":null,"name":"Vanguardngr.com"},"title":"Enugu: The Ugwuanyi template for economic development","url":"https:\/\/www.vanguardngr.com\/2018\/11\/enugu-the-ugwuanyi-template-for-economic-development\/","urlToImage":"https:\/\/www.vanguardngr.com\/wp-content\/uploads\/2015\/09\/Ugwuanyi-new.jpg","relevancy":64},{"author":"alexmark","content":"by Jesse Colombo Despite this being a low-volume holiday week, crude oil continues to plunge. West Texas Intermediate ( WTI ) crude oil is down $3.69 or 6.75% and Brent crude oil is down $3.60 or 5.75% today alone, which further confirms the concerns I had wh… [+5753 chars]","description":null,"publishedAt":"2018-11-25T02:17:17Z","source":{"id":null,"name":"Investmentwatchblog.com"},"title":"Why Oil’s Crash Will Cause A Shale Energy Bust","url":"http:\/\/www.investmentwatchblog.com\/why-oils-crash-will-cause-a-shale-energy-bust\/","urlToImage":null,"relevancy":21},{"author":"Free West Media","content":"Skip to comments. Gender politics and the sinking of the KNM Helge Ingstad ( Norway ) Free West Media ^ | November 14, 2018 Posted on 11\/24\/2018 6:18:05 PM PST by george76 Returning from the NATO Trident Juncture strategic exercise, a Norwegian frigate collid… [+5600 chars]","description":"Returning from the NATO Trident Juncture strategic exercise, a Norwegian frigate collided with a tanker. Many are speculating that gender politics sunk the vessel. The collision with the KNM Helge Ingstad left a big enough hole in the starboard side of the fr…","publishedAt":"2018-11-25T02:18:05Z","source":{"id":null,"name":"Freerepublic.com"},"title":"Gender politics and the sinking of the KNM Helge Ingstad ( Norway )","url":"https:\/\/www.freerepublic.com\/focus\/f-news\/3708249\/posts","urlToImage":null,"relevancy":75},{"author":"https:\/\/www.facebook.com\/MalaysiaKini\/","content":"Malaysias economic growth could accelerate beyond 2020 if commodities prices pick up on the back of a recovery in global economic growth. Moodys Analytics Chief Asia-Pacific Economist Steven G Cochrane said Malaysias economic growth would likely slow down in … [+3372 chars]","description":"Economist predicts that commodity prices will only accelerate when global economy picks up.","publishedAt":"2018-11-25T02:19:43Z","source":{"id":null,"name":"Malaysiakini.com"},"title":"Moody's: Slowing growth until 2020 with commodities slump","url":"https:\/\/www.malaysiakini.com\/news\/453292","urlToImage":"https:\/\/i.malaysiakini.com\/1206\/fd0b90e177c235e28422e72b2fb11c24.jpeg","relevancy":19},{"author":null,"content":"Investors will look for cues from F&amp;O expiry, November auto sales, GDP and state elections along with global developments around Brexit and Italy in this week. On Thursday, F&amp;O contracts for November series will expire and investors will roll over the… [+7727 chars]","description":"On Thursday, F&O contracts for November series will expire and investors will roll over their positions, which usually results in volatility","publishedAt":"2018-11-25T02:53:10Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"Market week ahead: Expiry, GDP state elections among 10 factors to watch out for","url":"https:\/\/www.moneycontrol.com\/news\/business\/markets\/market-week-ahead-expiry-gdp-state-elections-among-10-factors-to-watch-out-for-3215571.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2018\/11\/BSE_Sensex-e1542611342127-770x433.jpg","relevancy":45},{"author":"Bernama","content":"As an open economy, Malaysia is susceptible to global trend, says Moody’s. (Bloomberg pic) KUALA LUMPUR: Malaysias economic growth could accelerate beyond 2020 if the prices of commodities were to pick up on the back of a recovery in global economic growth. M… [+3343 chars]","description":"Moody’s Analytics chief Asia-Pacific economist Steven G Cochrane says lower commodity prices will hurt emerging markets and Malaysia.","publishedAt":"2018-11-25T03:13:09Z","source":{"id":null,"name":"Freemalaysiatoday.com"},"title":"Moody’s: Malaysia’s economic growth can accelerate beyond 2020","url":"https:\/\/www.freemalaysiatoday.com\/category\/nation\/2018\/11\/25\/moodys-malaysias-economic-growth-can-accelerate-beyond-2020\/","urlToImage":"https:\/\/s3media.freemalaysiatoday.com\/wp-content\/uploads\/2018\/11\/kl-bloomberg-161118-1.jpg","relevancy":32},{"author":null,"content":"Rupee Rs 1.24 from its previous week's close of Rs 71.92. Political uncertainty as well as capital outflows from the financial markets are likely to restrict the Indian rupee in a range of 70-71 per US dollar next week, experts said on Saturday. However, low … [+1859 chars]","description":"INR Vs USD: Any further outflow of foreign funds from the Indian equity and bond markets might have an adverse impact on the rupee.","publishedAt":"2018-11-25T03:16:15Z","source":{"id":null,"name":"Ndtv.com"},"title":"'Capital Outflows From Financial Markets Likely To Put Pressure On Rupee'","url":"https:\/\/www.ndtv.com\/business\/inr-vs-usd-rupee-vs-dollar-currency-exchange-rate-capital-outflows-to-put-pressure-on-rupee-next-wee-1952963","urlToImage":"https:\/\/c.ndtvimg.com\/2018-10\/vkvq1t5o_rupee_625x300_30_October_18.jpg","relevancy":41},{"author":"Reuters, Our Correspondent","content":"For the week, Brent fell 11.3% and WTI posted 10.8% decline, largest one-week drop since January 2016. PHOTO: FILE BOSTON: Oil prices slumped to nearly 8% to the lowest in more than a year on Friday, posting the seventh consecutive weekly loss, amid intensify… [+2331 chars]","description":"For the week, Brent fell 11.3% and WTI posted 10.8% decline, largest one-week drop since January 2016 The post Oil plunges nearly 8% despite talk of output cut appeared first on The Express Tribune.","publishedAt":"2018-11-25T03:37:59Z","source":{"id":null,"name":"Tribune.com.pk"},"title":"Oil plunges nearly 8% despite talk of output cut","url":"https:\/\/tribune.com.pk\/story\/1853742\/2-oil-plunges-nearly-8-despite-talk-output-cut\/","urlToImage":"https:\/\/c.tribune.com.pk\/2018\/11\/1853742-imagexx-1543117048-299-640x480.png","relevancy":16},{"author":"Alexandra Ulmer","content":"WASHINGTON\/MEXICO CITY (Reuters) - The head of Russian oil company Rosneft, Igor Sechin, flew to Caracas this week to meet Venezuelan President Nicolas Maduro and complain over delayed oil shipments designed to repay loans, two sources briefed on the conversa… [+3799 chars]","description":"The head of Russian oil company Rosneft, Igor Sechin, flew to Caracas this week to meet Venezuelan President Nicolas Maduro and complain over delayed oil shipments designed to repay loans, two sources briefed on the conversation said on Saturday.","publishedAt":"2018-11-25T03:42:40Z","source":{"id":"reuters","name":"Reuters"},"title":"Exclusive: Rosneft's Sechin flies to Venezuela, rebukes Maduro over oil shipments","url":"https:\/\/in.reuters.com\/article\/russia-venezuela-idINKCN1NU02A","urlToImage":"https:\/\/s3.reutersmedia.net\/resources\/r\/?m=02&d=20181125&t=2&i=1328332832&w=1200&r=LYNXNPEEAO02M","relevancy":38},{"author":"Nwafor Polycarp","content":"By Godspower Akpude After his military career and subsequent adventure into politics, President Muhammadu Buhari won the love of many Nigerians hence his fanatical followers. But now, the Nigerian leader surely has fanatical aides, one of whom is his aide on … [+9067 chars]","description":"After his military career and subsequent adventure into politics, President Muhammadu Buhari won the love of many Nigerians hence his fanatical followers. But now, the Nigerian leader surely has fanatical aides, one of whom is his aide on social media, Lauret…","publishedAt":"2018-11-25T03:44:56Z","source":{"id":null,"name":"Vanguardngr.com"},"title":"Dissecting Buhari’s Agriculture Revolution","url":"https:\/\/www.vanguardngr.com\/2018\/11\/dissecting-buharis-agriculture-revolution\/","urlToImage":"https:\/\/www.vanguardngr.com\/wp-content\/uploads\/2017\/12\/buhari-inspecting2.jpg","relevancy":72},{"author":"Our Correspondent, Our Correspondent, Shahabullah Yousufzai, Zafar Bhutta, Our Correspondent, Reuters, Our Correspondent","content":"KSE-100 index declines 791 points and settles at 40,869. PHOTO: FILE KARACHI: The stock market endured a bearish week as developments on domestic and international fronts led to a decline of 1.9% or 791 points in the benchmark KSE-100 index which settled at 4… [+4546 chars]","description":"KSE-100 index declines 791 points and settles at 40,869 The post Bears dominate as economic and political concerns hurt appeared first on The Express Tribune.","publishedAt":"2018-11-25T03:46:48Z","source":{"id":null,"name":"Tribune.com.pk"},"title":"Bears dominate as economic and political concerns hurt","url":"https:\/\/tribune.com.pk\/story\/1853744\/2-bears-dominate-economic-political-concerns-hurt\/","urlToImage":"https:\/\/c.tribune.com.pk\/2018\/11\/ici-pakistan-1543086373.jpg","relevancy":24},{"author":"Press Trust of India","content":"Foreign investors have pumped in Rs 63.10 billion into Indian capital markets this month so far, after pulling out massive funds in October, on easing crude oil prices and a strengthening rupee. Of these, most of the funds were infused in the debt market by f… [+2063 chars]","description":"The recent inflows come after a net outflow of more than Rs 389 billion in October, which was the steepest withdrawal in nearly two years","publishedAt":"2018-11-25T04:45:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"FPIs' bullish stance continues; pump in Rs 63.10 bn in Nov on crude, rupee","url":"https:\/\/www.business-standard.com\/article\/markets\/fpis-bullish-stance-continues-pump-in-rs-63-10-bn-in-nov-on-crude-rupee-118112500098_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2017-11\/14\/full\/1510681245-1299.jpg","relevancy":53},{"author":"AP","content":"NEW DELHI: Foreign investors have pumped in Rs 6,310 crore into Indian capital markets this month so far, after pulling out massive funds in October, on easing crude oil prices and a strengthening rupee. Of these, most of the funds were infused in the debt ma… [+2070 chars]","description":"FPIs pulled out over Rs 21,000 crore from capital markets (both equity and debt) in September.","publishedAt":"2018-11-25T04:54:31Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"FPIs' bullish stance continues; inflow at Rs 6,310 crore in November so far","url":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/fpis-bullish-stance-continues-inflow-at-rs-6310-crore-in-november-so-far\/articleshow\/66792372.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66792369,width-1070,height-580,imgsize-137321,overlay-etmarkets\/photo.jpg","relevancy":62},{"author":null,"content":"Mexicos president-elect Andrés Manuel López Obrador likes to surround himself with photographs or busts of his historical heroes. But in a video posted on social media on October 30 he had a new prop. Prominent on a table beside him as he smiled into the came… [+13025 chars]","description":"Are the president-elect’s promises to stage referendums on everything from infrastructure to the police a cover to consolidate power?","publishedAt":"2018-11-25T05:00:29Z","source":{"id":"financial-times","name":"Financial Times"},"title":"Mexico: Amlo vs the markets","url":"https:\/\/www.ft.com\/content\/8e1a0d40-ee36-11e8-89c8-d36339d835c0","urlToImage":"https:\/\/www.ft.com\/__origami\/service\/image\/v2\/images\/raw\/http%3A%2F%2Fprod-upp-image-read.ft.com%2F13ea81d8-ef37-11e8-8180-9cf212677a57?source=next-opengraph&fit=scale-down&width=900","relevancy":31},{"author":"PTI","content":"Foreign investors have pumped in 6,310 crore into Indian capital markets this month so far, after pulling out massive funds in October, on easing crude oil prices and a strengthening rupee. Of these, most of the funds were infused in the debt market by foreig… [+2017 chars]","description":"Foreign investors have pumped in ₹6,310 crore into Indian capital markets this month so far, after pulling out massive funds in October, on easing crude oil prices and a strengthening rupee.Of these,","publishedAt":"2018-11-25T05:09:14Z","source":{"id":null,"name":"Thehindubusinessline.com"},"title":"FPI inflows seen at ₹6,310 cr in Nov so far","url":"https:\/\/www.thehindubusinessline.com\/markets\/fpi-inflows-seen-at-6310-cr-in-nov-so-far\/article25590461.ece","urlToImage":"https:\/\/www.thehindubusinessline.com\/markets\/j5vfdj\/article24907251.ece\/ALTERNATES\/LANDSCAPE_615\/FPI","relevancy":23},{"author":"Nishant Kumar","content":"NEW DELHI: During the week gone by, global sentiment outweighed favourable triggers such as softening crude price and a strengthening rupee to cause domestic equity benchmark Sensex snap its winning streak of three consecutive weeks. A selloff in US technolog… [+4850 chars]","description":"Global cues may remain the most dominant factor that will steer market mood next week.","publishedAt":"2018-11-25T05:15:15Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"F&O expiry, Trump-Xi meet among 9 cues to move market this week","url":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/fo-expiry-trump-xi-meet-among-9-cues-to-move-market-this-week\/articleshow\/66792493.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66792538,width-1070,height-580,imgsize-264513,overlay-etmarkets\/photo.jpg","relevancy":65},{"author":"AFP, AFP, AFP, IANS, Entertainment Desk, News Desk, Reuters, Our Correspondent, Mohammad Zafar, PPI","content":"PHOTO COURTESY: YAHOO CAXITO, ANGOLA: Boxes of still-green bananas were shifted one-by-one from a towering stack of crates into a refrigerated shipping container. Stamped “From Angola, with love”, the fruit is shipped to consumers 6,000 kilometres away and ar… [+4514 chars]","description":"Currently the law states that all land is the property of the state The post ‘Green fuel’: Bananas to help wean Angola off oil appeared first on The Express Tribune.","publishedAt":"2018-11-25T05:42:11Z","source":{"id":null,"name":"Tribune.com.pk"},"title":"‘Green fuel’: Bananas to help wean Angola off oil","url":"https:\/\/tribune.com.pk\/story\/1854010\/3-green-fuel-bananas-help-wean-angola-off-oil\/","urlToImage":"https:\/\/c.tribune.com.pk\/2018\/11\/1854010-bananass-1543124502-485-640x480.jpg","relevancy":20},{"author":"IANS","content":"Upcoming key macro-economic data points, coupled with the trends in global stock markets and the direction of foreign fund flows will influence the trajectory of key equity indices in the week ahead, analysts opined. Additionally, the ongoing state elections,… [+2641 chars]","description":"Besides global cues, investors will look closely at macro-economic data points such as the second quarter GDP numbers and the output of eight core industries","publishedAt":"2018-11-25T05:54:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"Market outlook: Macro-data, assembly polls to set tone for equity indices","url":"https:\/\/www.business-standard.com\/article\/markets\/market-outlook-macro-data-assembly-polls-to-set-equity-indices-route-118112500128_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-08\/28\/full\/1535400141-9232.jpg","relevancy":57},{"author":"","content":"The Trump administration imposed a new round of sanctions on Iran on November 5, 2018 aimed at zeroing oil and gas exports and announced that these sanctions would be the toughest yet on Iran. Then, Secretary Pompeo announced that eight countries would be exe… [+8270 chars]","description":"Al-Arabiya Can Iran stop the rial's death spiral in the long term? Al-Arabiya Regime officials in Rouhani's government are tasked with artificially showing a low rate for the US dollar, even though trading remained stagnant. (Supplied). By Hassan Mahmoudi Spe…","publishedAt":"2018-11-25T05:59:03Z","source":{"id":null,"name":"Alarabiya.net"},"title":"Can Iran stop the rial's death spiral in the long term? - Al-Arabiya","url":"http:\/\/english.alarabiya.net\/en\/features\/2018\/11\/25\/Can-Iran-stop-the-rial-s-death-spiral-in-the-long-term-.html","urlToImage":"https:\/\/vid.alarabiya.net\/images\/2018\/08\/06\/3334d8b9-e443-45ce-9c6e-175b85ed854e\/3334d8b9-e443-45ce-9c6e-175b85ed854e_16x9_788x442.jpg","relevancy":17},{"author":null,"content":"Climate change will cost the U.S. economy hundreds of billions of dollars by the end of the century, hitting everything from health to infrastructure, according to a government report issued on Friday that the White House called inaccurate. The congressionall… [+3639 chars]","description":"Climate change will cost the U.S. economy hundreds of billions of dollars by the end of the century, hitting everything from health to infrastructure, according to a government report issued on Friday that the White House called inaccurate. The congressionall…","publishedAt":"2018-11-25T06:00:45Z","source":{"id":null,"name":"Insurancejournal.com"},"title":"Report by 13 U.S. Agencies Warns of Dire Economic Effects from Climate Change","url":"https:\/\/www.insurancejournal.com\/news\/national\/2018\/11\/25\/510003.htm","urlToImage":"https:\/\/www.insurancejournal.com\/img\/insurancejournal-square.png","relevancy":44},{"author":null,"content":"On the technical charts, the NSE Nifty50's short-term trend has turned bearish. Upcoming key macro-economic data points, coupled with the trends in global stock markets and the direction of foreign fund flows will influence the trajectory of key equity indice… [+2700 chars]","description":"Last week, a global equities sell-off and domestic political uncertainty subdued the equity market indices.","publishedAt":"2018-11-25T06:09:12Z","source":{"id":null,"name":"Ndtv.com"},"title":"Macro Data, Political Concerns To Guide Markets Next Week, Say Experts","url":"https:\/\/www.ndtv.com\/business\/market-outlook-factors-to-determine-shares-stock-movement-next-week-sensex-nifty-1952989","urlToImage":"https:\/\/c.ndtvimg.com\/2018-09\/1q8oj5lo_nse-nifty-new-logo_625x300_25_September_18.jpg","relevancy":42},{"author":"PTI","content":"New Delhi: Stock markets may face volatile trading sessions this week and would be guided by global cues, movement of the rupee and crude oil prices, experts said. Participants would also be keenly awaiting the GDP data for the September quarter to be release… [+1140 chars]","description":"Experts believe Indian stock markets may face volatile trading sessions this week and would be guided by global cues, movement of the rupee and crude oil prices","publishedAt":"2018-11-25T07:33:09Z","source":{"id":null,"name":"Livemint.com"},"title":"Markets Weekahead: Global cues, rupee, oil prices to guide market trend","url":"https:\/\/www.livemint.com\/Money\/fjaFe3bKIxrqfQFFvhkAmJ\/Markets-Weekahead-Global-cues-rupee-oil-prices-to-guide-m.html","urlToImage":"https:\/\/www.livemint.com\/rf\/Image-621x414\/LiveMint\/Period2\/2018\/11\/26\/Photos\/Processed\/stocktraders-khS--621x414@LiveMint.jpg","relevancy":27},{"author":"P Manoj","content":"Indian refiners, both state-owned and private, are weighing a consortium arrangement for buying crude from the United States to secure concessions and save on freight costs, at least two people familiar with the plan said. There was a lot of discussions on en… [+2844 chars]","description":"Plan seeks to extract better terms and cut freight costs","publishedAt":"2018-11-25T07:39:06Z","source":{"id":null,"name":"Thehindubusinessline.com"},"title":"Indian oil refiners look at ‘consortium’ approach to buy crude from United States","url":"https:\/\/www.thehindubusinessline.com\/economy\/logistics\/indian-oil-refiners-look-at-consortium-approach-to-buy-crude-from-united-states\/article25590657.ece","urlToImage":"https:\/\/www.thehindubusinessline.com\/migration_catalog\/article18274730.ece\/ALTERNATES\/LANDSCAPE_615\/BL12-NATURAL_GAS","relevancy":76},{"author":"Contributed by CRISIL Economy Research","content":"Rupee gains on easing crude prices November is proving to be a month of recovery for the rupee. After posting an all-time low of 74.4 per dollar in October, the currency recovered sharply to 71.2 in the week-ended November 23, 2018. So far this month, the rup… [+2477 chars]","description":"Rupee gains on easing crude pricesNovember is proving to be a month of recovery for the rupee. After posting an all-time low of 74.4 per dollar in October, the currency recovered sharply to 71.2 in th","publishedAt":"2018-11-25T08:03:07Z","source":{"id":null,"name":"Thehindubusinessline.com"},"title":"Economy Alerts","url":"https:\/\/premium.thehindubusinessline.com\/portfolio\/stock-fundamental-analysis-india\/economy-alerts\/article25590704.ece","urlToImage":"https:\/\/www.thehindubusinessline.com\/static\/theme\/default\/base\/img\/og-image.jpg","relevancy":26},{"author":null,"content":"Globally, oil prices slumped more than 6 per cent to the lowest in more than a year on Friday Fuel rates were further slashed by up to 50 paise per litre across the four metro cities on Sunday by OMCs (oil marketing companies). Petrol was priced at Rs. 74.84 … [+1319 chars]","description":"State-run oil marketing companies Indian Oil, Bharat Petroleum and Hindustan Petroleum revise fuel prices with effect from 6 am on a daily basis.","publishedAt":"2018-11-25T08:18:29Z","source":{"id":null,"name":"Ndtv.com"},"title":"Fuel Prices Cut By Up To 50 Paise Per Litre In Metros","url":"https:\/\/www.ndtv.com\/business\/petrol-diesel-prices-on-november-25-fuel-prices-cut-by-up-to-50-paise-per-litre-in-metros-1953035","urlToImage":"https:\/\/c.ndtvimg.com\/2018-10\/b90ss694_delhi-petrol-pump-strike-generic-pti_625x300_22_October_18.jpg","relevancy":36},{"author":"Ichiro Asahina","content":"The final part of October must have been very busy but quite successful for Prime Minister Shinzo Abe in terms of diplomacy. After returning Oct. 20 from a trip to Spain, France and Belgium, Abe paid a visit to China from Oct. 25 to 27. Upon coming back from … [+6016 chars]","description":"Japan has what it takes to serve as an intermediary state on the world's diplomatic stage.","publishedAt":"2018-11-25T08:29:13Z","source":{"id":null,"name":"Japantimes.co.jp"},"title":"Japan can excel at ‘intermediary’ diplomacy","url":"https:\/\/www.japantimes.co.jp\/opinion\/2018\/11\/25\/commentary\/japan-commentary\/japan-can-excel-intermediary-diplomacy\/","urlToImage":"https:\/\/cdn.japantimes.2xx.jp\/wp-content\/uploads\/2018\/11\/p7-Asahina-a-20181126-870x568.jpg","relevancy":70},{"author":null,"content":"MUMBAI: The Reserve Bank will hold the rates for the remainder of the fiscal year ending March 2019 and is likely to go for \"measured hikes\" in FY20 as inflation inches up, Singaporean lender DBS has said. Decision on rates will be majorly influenced by the m… [+2124 chars]","description":"The lender said inflation is averaging at 4.2 per cent for the first seven months of the fiscal year and points out to lower procurement of food crops by the government through the minimum support price (MSP) mechanism. The increase in inflation expectations …","publishedAt":"2018-11-25T08:47:51Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"RBI may hold the rates baton till March: Report","url":"https:\/\/timesofindia.indiatimes.com\/business\/india-business\/rbi-may-hold-the-rates-baton-till-march-report\/articleshow\/66794314.cms","urlToImage":"https:\/\/static.toiimg.com\/thumb\/msid-66794315,width-1070,height-580,imgsize-1129001,resizemode-6,overlay-toi_sw,pt-32,y_pad-40\/photo.jpg","relevancy":60},{"author":"Tony Seskus","content":"The street outside Calgary's downtown Hyatt hotel was teeming with pro-oil demonstrators Thursday, forcing police to close traffic along a busy avenue as the growing crowd spilled over the sidewalks. While a business audience streamed inside the hotel to list… [+6067 chars]","description":"While the price of crude has many Albertans worried, there's frustration the issue isn't being met with enough urgency, even as economists warn of a broad impact.","publishedAt":"2018-11-25T09:00:00Z","source":{"id":"cbc-news","name":"CBC News"},"title":"Worry and frustration mount in Alberta as oil prices languish","url":"https:\/\/www.cbc.ca\/news\/business\/alberta-oil-concerns-1.4918359","urlToImage":"https:\/\/i.cbc.ca\/1.4919732.1543101301!\/fileImage\/httpImage\/image.JPG_gen\/derivatives\/16x9_620\/trudeau-demonstration-jpg.JPG","relevancy":30},{"author":null,"content":"The Reserve Bank will hold the rates for the remainder of the fiscal year ending March 2019 and is likely to go for \"measured hikes\" in FY20 as inflation inches up, Singaporean lender DBS has said. Decision on rates will be majorly influenced by the movement … [+2117 chars]","description":"The lender said inflation is averaging at 4.2 per cent for the first seven months of the fiscal year and points out to lower procurement of food crops by the government through the minimum support price (MSP) mechanism. The increase in inflation expectations …","publishedAt":"2018-11-25T09:10:04Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"RBI may hold the rates baton till March: DBS report","url":"https:\/\/www.moneycontrol.com\/news\/business\/economy\/rbi-may-hold-the-rates-baton-till-march-dbs-report-3216791.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2018\/11\/Reserve-bank-of-India-770x433.jpg","relevancy":63},{"author":"PTI","content":"New Delhi: Foreign investors have pumped in Rs 6,310 crore into Indian capital markets this month so far, after pulling out massive funds in October, on easing crude oil prices and a strengthening rupee. Of these, most of the funds were infused in the debt ma… [+2195 chars]","description":"Foreign investors infused Rs 923 crore in the equity market during November 1-22, and Rs 5,387 crore in the debt market, taking the total to Rs 6,310 crore","publishedAt":"2018-11-25T09:18:14Z","source":{"id":null,"name":"Livemint.com"},"title":"FPIs infuse Rs 6,310 crore in November so far","url":"https:\/\/www.livemint.com\/Money\/LNAHsn53Mg4rrlOWEP7VBJ\/FPIs-infuse-Rs-6310-crore-in-November-so-far.html","urlToImage":"https:\/\/www.livemint.com\/rf\/Image-621x414\/LiveMint\/Period2\/2018\/11\/26\/Photos\/Processed\/note-kzEB--621x414@LiveMint.jpg","relevancy":40},{"author":"Reuters","content":"MUMBAI: The Reserve Bank will hold the rates for the remainder of the fiscal year ending March 2019 and is likely to go for \"measured hikes\" in FY20 as inflation inches up, Singaporean lender DBS has said. Decision on rates will be majorly influenced by the m… [+2129 chars]","description":"Decision on rates will be majorly influenced by the movement in oil prices and rupee.","publishedAt":"2018-11-25T09:22:24Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"RBI may hold the rates baton till March: report","url":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/rbi-may-hold-the-rates-baton-till-march-report\/articleshow\/66794554.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66794575,width-1070,height-580,imgsize-282108,overlay-etmarkets\/photo.jpg","relevancy":34},{"author":null,"content":"Sumit Bilgaiyan Equity99 The markets remained volatile last week, with the Nifty ending 155.45 points lower at 10,526.72 on November 22. ( Friday, November 23 was a market holiday on account of Guru Nanak Jayanti ). On the global front, crude oil prices remai… [+2595 chars]","description":"Sumit Bilgaiyan of Equity99 sees strong support for the Nifty at 10,440-10,350 levels and resistance at 10,670-10,740 levels this week","publishedAt":"2018-11-25T09:28:35Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"3 medium-term buys to play out the volatile election phase","url":"https:\/\/www.moneycontrol.com\/news\/business\/markets\/3-medium-term-buys-to-play-out-the-volatile-election-phase-3215761.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2018\/11\/BSENSESensexnifty-770x433.jpg","relevancy":46},{"author":"Prerna Sharma Singh","content":"This year has not been good for the palm oil sector as it has lost more than 25 per cent of its value due to hikes in import duties by India (the top importer), escalating trade tensions between China and the US, and higher supplies from the top two palm oil-… [+4355 chars]","description":"Price-sensitive Indian buyers are waiting for a drop to enter the market","publishedAt":"2018-11-25T09:30:12Z","source":{"id":null,"name":"Thehindubusinessline.com"},"title":"Palm oil to find support after a dip","url":"https:\/\/premium.thehindubusinessline.com\/portfolio\/commodity-analysis\/palm-oil-to-find-support-after-a-dip\/article25590923.ece","urlToImage":"https:\/\/premium.thehindubusinessline.com\/portfolio\/commodity-analysis\/4odbjr\/article25590922.ece\/ALTERNATES\/LANDSCAPE_615\/PO26THAILAND","relevancy":35},{"author":null,"content":"Can US stocks get their mojo back? US stocks took a battering during the past week as a dramatic rout pushed global equities indices closer to bear market territory, with a midweek rebound frittered away by Friday. The renewed volatility has some investors mo… [+4901 chars]","description":"Tumult in equities and cracks in credit have investors questioning rate rise policy","publishedAt":"2018-11-25T09:43:00Z","source":{"id":"financial-times","name":"Financial Times"},"title":"Could a ‘Fed pause’ be on the way?","url":"https:\/\/www.ft.com\/content\/6461b1b8-ee6a-11e8-89c8-d36339d835c0","urlToImage":"https:\/\/www.ft.com\/__origami\/service\/image\/v2\/images\/raw\/http%3A%2F%2Fprod-upp-image-read.ft.com%2F22e7f8fa-bd74-11e7-b8a3-38a6e068f464?source=next-opengraph&fit=scale-down&width=900","relevancy":28},{"author":"Brian Gilmartin, CFA","content":"Talking with my yoga instructor this week about the market - she does one-on-one yoga sessions with many CME traders and hedge fund types - and while explaining I really wasn't a trader for my clients, but more of a long-term investor, she then asked about th… [+6686 chars]","description":"Talking with my yoga instructor this week about the market - she does one-on-one yoga sessions with many CME traders and hedge fund types - and while explaining","publishedAt":"2018-11-25T10:00:34Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"The 2008 Mortgage\/Financial\/Banking Crisis Changed Everything","url":"https:\/\/seekingalpha.com\/article\/4224296-2008-mortgage-financial-banking-crisis-changed-everything","urlToImage":"https:\/\/static3.seekingalpha.com\/uploads\/2018\/11\/25\/saupload_img1_thumb1.png","relevancy":13},{"author":"Sam Jacobs","content":"Good morning. To the scoreboard: Dow: 24,285.95 -178.74 (-0.73%) S&amp;P 500: 2,632.56 -17.37 (-0.66%) AUD\/USD: 0.7231 -0.0023 (-0.32%) ASX200 SPI futures (December contracts): 5,666 (-37) 1. Oil prices hit a 2018 low on Friday night, as brent crude slumped b… [+2040 chars]","description":"Good morning. To the scoreboard: Dow: 24,285.95 -178.74 (-0.73%) S&P 500: 2,632.56 -17.37 (-0.66%) AUD\/USD: 0.7231 -0.0023 (-0.32%) ASX200 SPI futures (December contracts): 5,666 (-37) More »","publishedAt":"2018-11-25T10:18:22Z","source":{"id":null,"name":"Businessinsider.com.au"},"title":"6 things Australian traders will be talking about this morning","url":"https:\/\/www.businessinsider.com.au\/asx-futures-asia-markets-open-v11-v2-2018-11","urlToImage":"https:\/\/edge.alluremedia.com.au\/uploads\/businessinsider\/2018\/11\/backflip-640x360.jpg","relevancy":68},{"author":"David Scutt","content":"The Australian dollar is under pressure, weighed down by sharply lower commodity prices and further losses in stocks. European economic data has raised doubts over whether the slowdown in the September quarter was temporary in nature. Central bank speeches wi… [+4354 chars]","description":"The Australian dollar is under pressure, weighed down by sharply lower commodity prices and further losses in stocks. European economic data has raised doubts over whether the slowdown in the September quarter was temporary in nature. More »","publishedAt":"2018-11-25T10:22:07Z","source":{"id":null,"name":"Businessinsider.com.au"},"title":"The Australian dollar is under pressure as concerns about the global economy continue to grow","url":"https:\/\/www.businessinsider.com.au\/fx-currency-aud-australia-dollar-pmi-global-growth-commodity-prices-2018-11","urlToImage":"https:\/\/edge.alluremedia.com.au\/uploads\/businessinsider\/2018\/11\/property-storm-640x360.jpg","relevancy":79},{"author":"PTI","content":"The RBI’s inflation modelling has also come for criticism following the release of data for October, which saw the headline number declining to a surprising low. (File) The Reserve Bank will hold the rates for the remainder of the fiscal year ending March 201… [+2290 chars]","description":"The decision on rates will be majorly influenced by the movement in oil prices and also the currency, which were\r\ntermed as \"wildcards\" by its house economists.","publishedAt":"2018-11-25T10:31:20Z","source":{"id":null,"name":"Indianexpress.com"},"title":"RBI may hold the rates baton till March: report","url":"https:\/\/indianexpress.com\/article\/india\/rbi-may-hold-the-rates-baton-till-march-report-5463634\/","urlToImage":"https:\/\/images.indianexpress.com\/2018\/11\/rbi71.jpg?w=759","relevancy":8},{"author":"Jaime Watt - Columnist","content":"Those of us who had hoped for a more placid year ahead are likely to be disappointed. If anything, Canada’s closest allies are facing even more difficult and uncertain times than had been predicted. Brexit, which by any measure was a monumental task, has grow… [+4319 chars]","description":"With turmoil in the U.K. and the U.S. and Canada becoming more politically polarized, our provincial and federal leaders must focus on areas where they can find alignment and mutual benefit.","publishedAt":"2018-11-25T11:00:00Z","source":{"id":null,"name":"Thestar.com"},"title":"Canada’s political leaders must overcome international and internal strife","url":"https:\/\/www.thestar.com\/opinion\/star-columnists\/2018\/11\/25\/canadas-political-leaders-must-overcome-international-and-internal-strife.html","urlToImage":"https:\/\/images.thestar.com\/A7KJrW4E4UNfn9RwdMPFUyD6IXY=\/1200x800\/smart\/filters:cb(1543152597767)\/https:\/\/www.thestar.com\/content\/dam\/thestar\/opinion\/star-columnists\/2018\/11\/25\/canadas-political-leaders-must-overcome-international-and-internal-strife\/rpjdougandjustin01.jpg","relevancy":85},{"author":"newsfeedback@fool.com (Tyler Crowe)","content":"The recent decline in oil prices can be pretty much summed up thusly: that escalated quickly. More than a year of steadily increasing oil prices has been wiped out in a matter of weeks as the concerns about sanctions on Iranian oil exports were more or less a… [+6430 chars]","description":"Even though oil prices have tumbled lately, the CEO of Schlumberger thinks oil is still headed upward over the long term.","publishedAt":"2018-11-25T11:35:00Z","source":{"id":null,"name":"Fool.com"},"title":"Oil Prices: This Exec's Outlook Says This Downturn Will Be Short Lived","url":"https:\/\/www.fool.com\/investing\/2018\/11\/25\/oil-prices-this-execs-outlook-says-this-downturn-w.aspx","urlToImage":"https:\/\/g.foolcdn.com\/image\/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F501821%2Fbuy-oil.jpg&h=630&w=1200&op=resize","relevancy":7},{"author":"Lance Roberts","content":"As with many Americans, I am on the road with the family making the traditional holiday rounds. Of course, my family is more \"The Griswolds\" than \"The Waltons, but even with all of the antics, comedy, and occasional drama, it is always an enjoyable time of th… [+18282 chars]","description":"As with many Americans, I am on the road with the family making the traditional holiday rounds. Of course, my family is more The Griswolds than The Waltons, but","publishedAt":"2018-11-25T11:44:28Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"Oil Sends A 'Crude Warning'","url":"https:\/\/seekingalpha.com\/article\/4224304-oil-sends-crude-warning","urlToImage":"https:\/\/static.seekingalpha.com\/uploads\/2018\/11\/24\/saupload_Breakeven-Inlfation-Rates-Oil.png","relevancy":4},{"author":"Douglas A. McIntyre","content":"Retail stores posted poor results compared to e-commerce based on new research. According to Reuters: The Thanksgiving Day and Black Friday kickoff of the U.S. holiday shopping season showed the increasing preference for online purchases, as more Americans op… [+2340 chars]","description":"Source: Tim Boyle \/ Getty ImagesRetail stores posted poor results compared to e-commerce based on new research. According to Reuters: The Thanksgiving Day and Black Friday kickoff of the U.S. holiday shopping season showed the increasing preference for online…","publishedAt":"2018-11-25T11:58:41Z","source":{"id":null,"name":"247wallst.com"},"title":"5 Most Important Things In Business Today","url":"http:\/\/247wallst.com\/media\/2018\/11\/25\/5-most-important-things-in-business-today-9\/","urlToImage":"https:\/\/s2.wp.com\/wp-content\/themes\/vip\/247wallst\/images\/247-50x50.png","relevancy":25},{"author":"Sam Jacobs","content":"A 6% slump on Friday night saw futures contracts for brent crude oil close below $US60 a barrel for the first time since October 2017. OPEC and its allies are scheduled to meet on December 6, where production cuts will be on the agenda. However, CBA analyst V… [+1665 chars]","description":"A 6% slump on Friday night saw futures contracts for brent crude oil close below $US60 a barrel for the first time since October 2017. OPEC and its allies are scheduled to meet on December 6, where production cuts will be on the agenda. More »","publishedAt":"2018-11-25T12:12:10Z","source":{"id":null,"name":"Businessinsider.com.au"},"title":"December 6 looms as a key date for oil traders as prices slump further into a bear market","url":"https:\/\/www.businessinsider.com.au\/oil-prices-bear-market-opec-meeting-2018-11","urlToImage":"https:\/\/edge.alluremedia.com.au\/uploads\/businessinsider\/2018\/11\/opec-640x360.jpg","relevancy":43},{"author":null,"content":"Benchmark indices closed the last session of the truncated week ended November 22 on a negative note. Indices declined for three consecutive days until Thursday ahead of the expiry of November futures and options contracts. The Nifty 50 lost around 250 points… [+11753 chars]","description":"Last week, the Sensex shed 1.3 percent, and the Nifty was down 1.5 percent, forming #39;Bearish Engulfing#39; kind of pattern on the weekly candlestick charts.","publishedAt":"2018-11-25T12:16:18Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"Trade Setup for Monday: Top 15 things to know before Opening Bell","url":"https:\/\/www.moneycontrol.com\/news\/business\/markets\/trade-setup-for-monday-top-15-things-to-know-before-opening-bell-34-3210871.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2018\/04\/RTR2PMUA-770x433.jpg","relevancy":77},{"author":"The Associated Press","content":"Displaying a thin grasp of science, U.S. President Donald Trump questioned the reality of global warming because it was cold outside. Then came a federal report laying out the severe consequences of climate change and rebutting the notion that a frigid snap m… [+14647 chars]","description":"Before and throughout his Thanksgiving vacation in Florida, Trump took no holiday from twisting facts across a broad front","publishedAt":"2018-11-25T12:56:23Z","source":{"id":null,"name":"Haaretz.com"},"title":"Trump exaggerates Syrian death toll, misleads Americans on Saudi arms deals","url":"https:\/\/www.haaretz.com\/us-news\/trump-exaggerates-syrian-death-toll-misleads-americans-on-saudi-arms-deals-1.6681530","urlToImage":"https:\/\/www.haaretz.com\/polopoly_fs\/1.6676235.1542803298!\/image\/3501694982.jpg_gen\/derivatives\/headline_1200x630\/3501694982.jpg","relevancy":86},{"author":"David Luhnow","content":"MEXICO CITYAn unlikely honeymoon between Wall Street and Mexican President-elect Andrés Manuel López Obrador, a leftist nationalist, is over before he even takes office on Dec. 1. In the months that followed Mr. López Obradors July election win, the peso and … [+8960 chars]","description":"Wall Street Journal Mexican President-Elect López Obrador Is Spooking Foreign Investors Wall Street Journal In the months that followed Mr. López Obrador's July election win, the peso and Mexican stocks rallied as foreign investors appeared willing to give th…","publishedAt":"2018-11-25T13:00:59Z","source":{"id":"the-wall-street-journal","name":"The Wall Street Journal"},"title":"Mexican President-Elect López Obrador Is Spooking Foreign Investors - Wall Street Journal","url":"https:\/\/www.wsj.com\/articles\/mexican-president-elect-lopez-obrador-is-spooking-foreign-investors-1543150816","urlToImage":"https:\/\/si.wsj.net\/public\/resources\/images\/B3-CL590_AMLO_1_TOP_20181122184151.jpg","relevancy":0},{"author":"newsfeedback@fool.com (Tyler Crowe)","content":"North American shale drilling has pretty much exceeded everyone's expectations. What was once a token production source has now become the dominant growth driver of the oil and gas industry. U.S. oil production has more than doubled from its lows about a deca… [+5637 chars]","description":"Based on conversations with clients, Halliburton's CEO thinks that 2019 will be another incredible year for oil and gas in North America","publishedAt":"2018-11-25T13:19:00Z","source":{"id":null,"name":"Fool.com"},"title":"Oil Stocks: 1 Oil Exec Thinks Shale Will Surge in 2019 (Again)","url":"https:\/\/www.fool.com\/investing\/2018\/11\/25\/oil-stocks-1-oil-exec-thinks-shale-will-surge-in-2.aspx","urlToImage":"https:\/\/g.foolcdn.com\/image\/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F502433%2Fdrilling-rig-close-up.jpg&h=630&w=1200&op=resize","relevancy":6},{"author":"Richard Suttmeier","content":"Here are the daily charts for the gold, commodities and dollar exchange-traded funds. The Gold Trust ETF tracks the spot price of gold and is said to be backed by gold bars in vaults in London. SPDR Gold Trust (NYSEARCA: GLD ) Courtesy of MetaStock Xenith The… [+3175 chars]","description":"The Gold Shares ETF stabilized above my monthly and quarterly value levels of $111.60 and $110.26, respectively. The Commodities ETF crashed below my annual piv","publishedAt":"2018-11-25T13:57:16Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"Commodities Slump On Weak Oil, As Gold And The Dollar Remain Stable","url":"https:\/\/seekingalpha.com\/article\/4224314-commodities-slump-weak-oil-gold-dollar-remain-stable","urlToImage":"https:\/\/static2.seekingalpha.com\/images\/marketing_images\/numbers_words_signs\/words_phrases\/commodity_trading_book.jpeg","relevancy":14},{"author":"MarketWatch","content":"Promised cannabis-based treatments have enticed investors, but details are elusive. See full story. The Roth strategy we wish wed built for early retirement There is a lot to love about a Roth heres why. See full story. 7 key reasons the bottom is falling out… [+806 chars]","description":"Promised cannabis-based treatments have enticed investors, but details are elusive.","publishedAt":"2018-11-25T14:00:12Z","source":{"id":null,"name":"Marketwatch.com"},"title":"NewsWatch: The collapse of this cannabis stock offers a valuable lesson to every investor","url":"https:\/\/www.marketwatch.com\/story\/the-collapse-of-this-cannabis-stock-offers-a-valuable-lesson-to-every-investor-2018-11-25","urlToImage":"https:\/\/mw3.wsj.net\/mw5\/content\/logos\/mw_logo_social.png","relevancy":3},{"author":"Fidelis Mbah","content":"Lagos, Nigeria - Emita Dida, a widowed mother of six, has been living in \"Monkey Village\" for more than a decade. She is one of thousands of Nigerians to be calling this informal settlement in Lagos' Ikeja neighbourhood home, sheltering in small shacks jammed… [+4507 chars]","description":"Ahead of Nigeria's presidential elections next year, residents of informal settlements say they expect little to change.","publishedAt":"2018-11-25T14:31:07Z","source":{"id":"al-jazeera-english","name":"Al Jazeera English"},"title":"'Politicians have failed us': The despair of Nigeria's poor","url":"https:\/\/www.aljazeera.com\/news\/2018\/11\/failed-despair-nigeria-poor-181123200501471.html","urlToImage":"https:\/\/www.aljazeera.com\/mritems\/Images\/2018\/11\/23\/641ee6e66a8d4590a6a453f0d09d5f9a_18.jpg","relevancy":10},{"author":"","content":"By Paul Myles and Leonore Schick Thirty metre high flames burn day and night in the village of Ebedei, in the Niger Delta, Nigeria. The heat from these fires is not soft or warm, it is prickly. The constant noise makes wild animals flee, and people must shout… [+11043 chars]","description":"[Premium Times] Thirty metre high flames burn day and night in the village of Ebedei, in the Niger Delta, Nigeria. The heat from these fires is not soft or warm, it is prickly. The constant noise makes wild animals flee, and people must shout to be heard. Fie…","publishedAt":"2018-11-25T14:41:00Z","source":{"id":null,"name":"Allafrica.com"},"title":"Nigeria's Gas Flares Increase Ahead 2020 Deadline","url":"https:\/\/allafrica.com\/stories\/201811250206.html","urlToImage":"https:\/\/cdn07.allafrica.com\/static\/images\/structure\/aa-logo-rgba-no-text-128x128.png","relevancy":67},{"author":"Shreepad s Aute","content":"With crude oil prices cooling off and the rupee strengthening a tad against the greenback, paint companies are expected to be major beneficiaries. This is because, prices of key raw materials, besides packing materials, are linked to crude oil prices. The sto… [+319 chars]","description":"The rise in oil prices had earlier led to muted profitability outlook for paint companies and investors shying away from their stocks","publishedAt":"2018-11-25T15:46:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"Lower oil prices, volume uptick to help paint firms get their shine back","url":"https:\/\/www.business-standard.com\/article\/companies\/lower-oil-prices-volume-uptick-to-help-paint-firms-get-their-shine-back-118112500646_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-09\/27\/full\/1537988179-5945.jpg","relevancy":49},{"author":"The Star Online","content":"KUALA LUMPUR: Malaysia’s economic growth could accelerate beyond 2020 if commodity prices were to pick up on the back of a recovery in global economic growth. Moody’s Analytics chief Asia-Pacific economist Steven G. Cochrane said Malaysia’s economic growth wo… [+1101 chars]","description":"KUALA LUMPUR: Malaysia’s economic growth could accelerate beyond 2020 if commodity prices were to pick up on the back of a recovery in global economic growth.","publishedAt":"2018-11-25T16:00:00Z","source":{"id":null,"name":"Thestar.com.my"},"title":"Malaysia's economic growth can accelerate beyond 2020","url":"http:\/\/www.thestar.com.my\/business\/business-news\/2018\/11\/26\/economic-growth-can-accelerate-beyond-2020\/","urlToImage":"https:\/\/www.thestar.com.my\/~\/media\/online\/2018\/08\/15\/22\/59\/malaysiaeconomy.ashx\/?w=620&h=413&crop=1&hash=9DED298ADB055033998DF92641D8DC385C70BD38","relevancy":82},{"author":"The Star Online","content":"LONDON: For the oil market, it looks like the real Opec meeting will come a week ahead of schedule. The cartel is set to meet on Dec 6 in Vienna, but days earlier the key decision makers are set to gather on the sidelines of the G20 summit in Buenos Aires in … [+3256 chars]","description":"LONDON: For the oil market, it looks like the real Opec meeting will come a week ahead of schedule.","publishedAt":"2018-11-25T16:00:00Z","source":{"id":null,"name":"Thestar.com.my"},"title":"As oil plunges, the real Opec meeting will be at this week’s G20","url":"http:\/\/www.thestar.com.my\/business\/business-news\/2018\/11\/26\/as-oil-plunges-the-real-opec-meeting-will-be-at-this-weeks-g20\/","urlToImage":"https:\/\/www.thestar.com.my\/~\/media\/online\/2018\/06\/10\/23\/52\/trumpsingapore.ashx\/?w=620&h=413&crop=1&hash=F1DF2C41C1F75AD215AB1435A04BAA338D21B5EE","relevancy":81},{"author":"Jeff Miller","content":"We have a big economic calendar. Some participants will be slow in recovering from their time off. Some may even stay up late for a football game on Sunday night. (Mrs. OldProf will be there until the finish, regardless of the score.) There will be plenty of … [+10857 chars]","description":"In the delicate balance between fundamental data and trading perceptions, markets have moved decisively to the latter. Oil prices declined, with surprise increa","publishedAt":"2018-11-25T16:06:29Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"Weighing The Week Ahead: Do Plummeting Oil Prices Signal A Weak Economy?","url":"https:\/\/seekingalpha.com\/article\/4224333-weighing-week-ahead-plummeting-oil-prices-signal-weak-economy","urlToImage":"https:\/\/static3.seekingalpha.com\/uploads\/2018\/11\/24\/55431-15431083243063016.png","relevancy":15},{"author":"Catherine Ngai - Bloomberg","content":"By Catherine Ngai Bloomberg The race to export U.S. shale oil overseas is about to get fierce, with at least nine proposed terminals angling for a piece of a very limited pie. Within 18 months, new pipelines opening in the nation’s most prolific shale basin p… [+4843 chars]","description":"Within 18 months, new pipelines opening in the nation’s most prolific shale basin promise to carry an added 2 million barrels of oil a day to the Gulf Coast. But the extra crude will arrive at a time when existing terminals in the Corpus Christi area can alre…","publishedAt":"2018-11-25T16:42:53Z","source":{"id":null,"name":"Thestar.com"},"title":"Shale boom raises specter of new glut: Gulf Coast oil terminals","url":"https:\/\/www.thestar.com\/business\/2018\/11\/25\/shale-boom-raises-specter-of-new-glut-gulf-coast-oil-terminals.html","urlToImage":"https:\/\/images.thestar.com\/nzdt3eWA5p5Y3Rt-kJFW2nxErwE=\/1200x749\/smart\/filters:cb(1543167226182)\/https:\/\/www.thestar.com\/content\/dam\/thestar\/business\/2018\/11\/25\/shale-boom-raises-specter-of-new-glut-gulf-coast-oil-terminals\/oil.jpg","relevancy":54},{"author":"John J. Xenakis","content":"This morning’s key headlines from GenerationalDynamics.com Socialist Venezuela oil production in ‘freefall’ as infrastructure collapses Russia rebukes Venezuela for non-payment Socialist Venezuela oil production in ‘freefall’ as infrastructure collapses Oil t… [+4961 chars]","description":"Contents: Socialist Venezuela oil production in 'free fall' as infrastructure collapses; Russia rebukes Venezuela for non-payment","publishedAt":"2018-11-25T16:56:51Z","source":{"id":"breitbart-news","name":"Breitbart News"},"title":"World View: Socialist Venezuela Oil Production in ‘Freefall’ as Infrastructure Collapses","url":"https:\/\/www.breitbart.com\/national-security\/2018\/11\/25\/world-view-socialist-venezuela-oil-production-in-freefall-as-infrastructure-collapses\/","urlToImage":"https:\/\/media.breitbart.com\/media\/2016\/10\/PDVSA-venezuela-oil-company-ap.jpg","relevancy":80},{"author":"MarketWatch","content":"Promised cannabis-based treatments have enticed investors, but details are elusive. See full story. The Roth strategy we wish wed built for early retirement There is a lot to love about a Roth heres why. See full story. 7 key reasons the bottom is falling out… [+782 chars]","description":"Promised cannabis-based treatments have enticed investors, but details are elusive.","publishedAt":"2018-11-25T17:00:08Z","source":{"id":null,"name":"Marketwatch.com"},"title":"NewsWatch: The collapse of this cannabis stock offers a valuable lesson to every investor","url":"https:\/\/www.marketwatch.com\/story\/the-collapse-of-this-cannabis-stock-offers-a-valuable-lesson-to-every-investor-2018-11-25-1210307","urlToImage":"https:\/\/mw3.wsj.net\/mw5\/content\/logos\/mw_logo_social.png","relevancy":2},{"author":"American Greatness","content":"Skip to comments. California Burning: How the Greens Turned the Golden State Brown American Greatness ^ | 11-24-18 | Edward Ring Posted on 11\/25\/2018 9:00:58 AM PST by DeweyCA n October 2016, in a coordinated act of terrorism that received fleeting attention … [+10390 chars]","description":"n October 2016, in a coordinated act of terrorism that received fleeting attention from the press, environmentalist activists broke into remote flow stations and turned off the valves on pipelines carrying crude oil from Canada into the United States. Working…","publishedAt":"2018-11-25T17:00:58Z","source":{"id":null,"name":"Freerepublic.com"},"title":"California Burning: How the Greens Turned the Golden State Brown","url":"https:\/\/www.freerepublic.com\/focus\/f-bloggers\/3708337\/posts","urlToImage":null,"relevancy":56},{"author":"Tyler Durden","content":"Authored by Lance Roberts via RealInvestmentAdvice.com, Oil Sends A Crude Warning As with many Americans, I am on the road with the family making the traditional holiday rounds. Of course, my family is more The Griswolds than The Waltons. but even with all of… [+9745 chars]","description":"Authored by Lance Roberts via RealInvestmentAdvice.com, Oil Sends A “Crude Warning” As with many Americans, I am on the road with the family making the traditional holiday rounds. Of course, my family is more “The Griswolds” than “The Waltons. but even with a…","publishedAt":"2018-11-25T17:10:00Z","source":{"id":null,"name":"Zerohedge.com"},"title":"Oil Sends A \"Crude Warning\"","url":"https:\/\/www.zerohedge.com\/news\/2018-11-25\/oil-sends-crude-warning","urlToImage":"https:\/\/www.zerohedge.com\/sites\/default\/files\/styles\/max_650x650\/public\/2018-11\/Oil-Sends-Crude-Warning.png?itok=Ghp1SqS1","relevancy":48},{"author":"Andrew Hecht","content":"The story of this week: Commodities Await News On Trade The Invesco DB Commodity Tracking ETF product ( DBC ) provides exposure to a diversified portfolio of commodities with just under 30% of its holdings in crude oil and oil products. Therefore, the price o… [+8741 chars]","description":"Commodities await news from Argentina on the U.S.- China trade dispute. Ugly energy markets as oil and gas post significant declines over the past week. Preciou","publishedAt":"2018-11-25T17:16:48Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"Commodities Recap For The Week Of November 23, 2018","url":"https:\/\/seekingalpha.com\/article\/4224343-commodities-recap-week-november-23-2018","urlToImage":"https:\/\/static1.seekingalpha.com\/images\/marketing_images\/industry_construction\/commodities4_min.jpeg","relevancy":11},{"author":"Bloomberg","content":"VladSV \/ Shutterstock.com By Catherine Ngai (Bloomberg) — The race to export U.S. shale oil overseas is about to get fierce, with at least nine proposed terminals angling for a piece of a very limited pie. Within 18 months, new pipelines opening in the nation… [+4769 chars]","description":"0sharesBy Catherine Ngai (Bloomberg) — The race to export U.S. shale oil overseas is about to get fierce, with at least nine proposed terminals angling for a piece of a very limited pie. Within 18 months, new pipelines opening in the nation’s most prolific sh…","publishedAt":"2018-11-25T17:26:41Z","source":{"id":null,"name":"Gcaptain.com"},"title":"Shale Boom Raises Specter of New Glut: Gulf Coast Oil Terminals","url":"https:\/\/gcaptain.com\/shale-boom-raises-specter-of-new-glut-gulf-coast-oil-terminals\/","urlToImage":"https:\/\/gcaptain.com\/wp-content\/uploads\/2018\/07\/shutterstock_723587314.jpg","relevancy":22},{"author":"Bloomberg","content":"Photo: BP Plc By Kelly Gilblom (Bloomberg) — BP Plc has seen first oil from its giant Clair Ridge development in the North Sea, helping arrest decades of decline in a region where drillers have already produced most easy-to-reach resources. The project increa… [+3136 chars]","description":"0sharesBy Kelly Gilblom (Bloomberg) — BP Plc has seen first oil from its giant Clair Ridge development in the North Sea, helping arrest decades of decline in a region where drillers have already produced most easy-to-reach resources. The project increases out…","publishedAt":"2018-11-25T17:38:14Z","source":{"id":null,"name":"Gcaptain.com"},"title":"BP Sees First Clair Ridge Oil Helping to Double North Sea Output","url":"https:\/\/gcaptain.com\/bp-sees-first-clair-ridge-oil-helping-to-double-north-sea-output\/","urlToImage":"https:\/\/gcaptain.com\/wp-content\/uploads\/2018\/11\/BP_claire_ridge.jpg","relevancy":29},{"author":"Sanjeev Choudhary","content":"NEW DELHI: Indian consumers do not seem to be getting the full benefit of the oil crash. Domestic rates of diesel and petrol have fallen 7-11% since early October, even as international fuel prices, which determine retail prices in India, are down by a quarte… [+2915 chars]","description":"Lost in Transit Indian refiners may be expanding margins as diesel, petrol prices have fallen only 7-11% from Oct highs despite global fuel prices slipping 25%.","publishedAt":"2018-11-25T17:46:47Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"Global oil crash gains diluted for consumers","url":"https:\/\/economictimes.indiatimes.com\/industry\/energy\/oil-gas\/global-oil-crash-gains-diluted-for-consumers\/articleshow\/66799987.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66799983,width-1070,height-580,imgsize-550138,overlay-economictimes\/photo.jpg","relevancy":52},{"author":"Alex Nussbaum and Grant Smith","content":"Oil prices have plunged, with futures in London slipping below $60 for the first time in a year, as a global stock-market sell-off and signs of record Saudi output helped intensify crude's late-year freefall. Brent, the international benchmark, dropped as muc… [+2469 chars]","description":"Oil prices have plunged, with futures in London slipping below $60 for the first time in a year, as a global stock-market sell-off and signs of record Saudi output helped intensify crude's late-year freefall. Brent, the international benchmark, dropped as muc…","publishedAt":"2018-11-25T18:00:00Z","source":{"id":null,"name":"Independent.ie"},"title":"Oil slumps lower on market sell-off and record Saudi Arabia production","url":"https:\/\/www.independent.ie\/business\/oil-slumps-lower-on-market-selloff-and-record-saudi-arabia-production-37562419.html","urlToImage":"https:\/\/www.independent.ie\/incoming\/article37562142.ece\/ALTERNATES\/h342\/B4.oilslumps.jpg","relevancy":73},{"author":"Josh Wingrove - Bloomberg","content":"By Josh Wingrove Bloomberg Canadian Finance Minister Bill Morneau is signalling he won’t cough up money for new rail cars to ship Alberta oil, saying it would take months and wouldn’t solve the current price collapse. Morneau, in an interview with “The West B… [+1934 chars]","description":"Bill Morneau said the province of Alberta could buy rail cars with industry should it choose to, but that the federal government was focused on building the Trans Mountain oil pipeline expansion. Rail cars take a significant amount of time to acquire, he said.","publishedAt":"2018-11-25T18:00:40Z","source":{"id":null,"name":"Thestar.com"},"title":"New rail cars aren’t short-term fix for oil crunch, Morneau says","url":"https:\/\/www.thestar.com\/business\/2018\/11\/25\/new-rail-cars-arent-short-term-fix-for-oil-crunch-morneau-says.html","urlToImage":"https:\/\/images.thestar.com\/oyXpA8sd1Lf7RqZjYu_lwSlajkA=\/1200x876\/smart\/filters:cb(1543171143356)\/https:\/\/www.thestar.com\/content\/dam\/thestar\/business\/2018\/11\/25\/new-rail-cars-arent-short-term-fix-for-oil-crunch-morneau-says\/bill.jpg","relevancy":58},{"author":null,"content":"Angola is aiming to expand its agricultural sector, which could provide many with employment Boxes of still-green bananas were shifted one-by-one from a towering stack of crates into a refrigerated shipping container. Stamped \"From Angola, with love\", the fru… [+5024 chars]","description":"Boxes of still-green bananas were shifted one-by-one from a towering stack of crates into a refrigerated shipping container.","publishedAt":"2018-11-25T18:39:01Z","source":{"id":null,"name":"Phys.org"},"title":"'Green fuel': Bananas to help wean Angola off oil","url":"https:\/\/phys.org\/news\/2018-11-green-fuel-bananas-wean-angola.html","urlToImage":"https:\/\/3c1703fe8d.site.internapcdn.net\/newman\/gfx\/news\/2018\/angolaisaimi.jpg","relevancy":37},{"author":"ENS Economic Bureau","content":"Worries over supply crunch on the prospect of tough sanctions on Iran and higher demand from top oil consumers had kept oil prices at multi-year highs earlier. After pulling out around Rs 60,000 crore from Indian markets in September and October, foreign port… [+2984 chars]","description":"Economic Affairs Secretary Subhash Chandra Garg had recently said the government was trying to find ways to ensure stability of FPI fund flows into the financial markets.","publishedAt":"2018-11-25T19:42:23Z","source":{"id":null,"name":"Indianexpress.com"},"title":"FPI selling abates, Rs 5,642 crore inflows in November so far","url":"https:\/\/indianexpress.com\/article\/business\/economy\/fpi-selling-abates-rs-5642-crore-inflows-in-november-so-far-5464123\/","urlToImage":"https:\/\/images.indianexpress.com\/2018\/06\/investment-759.jpg?w=759","relevancy":9},{"author":"Anup Roy, Abhishek Waghmare & Samie Modak","content":"Foreign investors may come back to India because of the fall in oil prices and the improvement in the domestic fundamentals, but that could happen only after they make sure the oil correction is here to stay and India’s deficits are bridged. The crude oil pri… [+322 chars]","description":"If Brent crude falls and the rupee appreciates to some extent, the import bill could be somewhere between $105 billion and $125 billion for the financial year","publishedAt":"2018-11-25T19:56:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"FPIs may find India attractive as oil prices fall, fundamentals improve","url":"https:\/\/www.business-standard.com\/article\/economy-policy\/fpis-may-find-india-attractive-as-oil-prices-fall-fundamentals-improve-118112500618_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-11\/06\/full\/1541518771-0147.jpg","relevancy":47},{"author":"Editorial","content":"From this author There was a time when the Indian economys growth fortunes were, in Lord George Curzons famous words, a gamble on the monsoon. November has turned out to be a lucky month for the Narendra Modi government, even though it is not yet clear if thi… [+2569 chars]","description":"Lowering of oil prices, recovery of rupee, bring some relief to government.","publishedAt":"2018-11-25T19:58:36Z","source":{"id":null,"name":"Indianexpress.com"},"title":"Crude comfort","url":"https:\/\/indianexpress.com\/article\/opinion\/columns\/crude-oil-rupee-petrol-price-economy-gdp-5464083\/","urlToImage":"https:\/\/images.indianexpress.com\/2018\/11\/editorial-759.jpg?w=759","relevancy":5},{"author":"Nick Cunningham","content":"“Oil prices getting lower. Great! Like a big Tax Cut for America and the World. Enjoy! $54, was just $82. Thank you to Saudi Arabia, but let’s go lower!” President Trump tweeted a few days ago. Trump is a bit confused on the specific figures – perhaps he was … [+3937 chars]","description":"“Oil prices getting lower. Great! Like a big Tax Cut for America and the World. Enjoy! $54, was just $82. Thank you to Saudi Arabia, but let’s go lower!” President Trump tweeted a few days ago. Trump is a bit confused on the specific figures – perhaps he was …","publishedAt":"2018-11-25T20:00:00Z","source":{"id":null,"name":"Oilprice.com"},"title":"Trump And OPEC Face Off Over Production Cuts","url":"https:\/\/oilprice.com\/Energy\/Energy-General\/Trump-And-OPEC-Face-Off-Over-Production-Cuts.html","urlToImage":"https:\/\/d32r1sh890xpii.cloudfront.net\/article\/718x300\/30739d73e6085be345f1ddce546ee855.jpg","relevancy":74},{"author":"James Mickleboro","content":"On Friday the S&amp;P\/ASX 200 (Index: ^AXJO) (ASX: XJO) finished a disappointing week on a positive note. The benchmark index climbed 0.45% to 5,716.2 points. Will the market be able to build on this on Monday? Here are five things to watch: ASX futures point… [+3862 chars]","description":"Beach Energy Ltd (ASX:BPT), BHP Billiton Limited (ASX:BHP), and Fisher & Paykel Healthcare Corp Ltd (ASX:FPH) shares will be on watch on Monday. Here's what you need to know...","publishedAt":"2018-11-25T20:17:05Z","source":{"id":null,"name":"Fool.com.au"},"title":"5 things to watch on the ASX 200 on Monday","url":"https:\/\/www.fool.com.au\/2018\/11\/26\/5-things-to-watch-on-the-asx-200-on-monday-4\/","urlToImage":"https:\/\/www.fool.com.au\/wp-content\/uploads\/2016\/09\/GettyImages-511197926.jpg","relevancy":59},{"author":"James Mickleboro","content":"Unfortunately for shareholders of energy companies such as Beach Energy Ltd (ASX: BPT), Santos Ltd (ASX: STO), and Woodside Petroleum Limited (ASX: WPL), these shares look likely to start the week deep in the red after oil prices continued to sink lower. What… [+3020 chars]","description":"Oil prices have crashed lower again. Where next for Beach Energy Ltd (ASX:BPT) and Santos Ltd (ASX:STO) shares?","publishedAt":"2018-11-25T21:17:10Z","source":{"id":null,"name":"Fool.com.au"},"title":"Oil prices crash lower: Where next for Beach Energy Ltd and Santos Ltd shares?","url":"https:\/\/www.fool.com.au\/2018\/11\/26\/oil-prices-crash-lower-where-next-for-beach-energy-ltd-and-santos-ltd-shares\/","urlToImage":"https:\/\/www.fool.com.au\/wp-content\/uploads\/2016\/10\/GettyImages-509051302.jpg","relevancy":39},{"author":"Brendon Lau","content":"Our market is poised to start the week with another bout of weakness and we can blame the crash in the oil price for the sour sentiment. The S&amp;P\/ASX 200 (Index:^AXJO) (ASX: XJO) is poised to follow the S&amp;P 500 index lower as the more than 6% drop in t… [+4319 chars]","description":"Falling oil prices may be sapping risk appetite but its actually what our market needs to give the Santa Rally a bit of a kickstart. Here's why...","publishedAt":"2018-11-25T21:20:32Z","source":{"id":null,"name":"Fool.com.au"},"title":"The oil price crash is just what our market needs","url":"https:\/\/www.fool.com.au\/2018\/11\/26\/the-oil-price-crash-is-just-what-our-market-needs\/","urlToImage":"https:\/\/www.fool.com.au\/wp-content\/uploads\/2016\/03\/oil-prices-crash-16.9.jpg","relevancy":51},{"author":"ANNABELLE LIANG","content":"SINGAPORE Asian shares were mostly higher Monday on hopes that U.S. President Donald Trump and his Chinese counterpart Xi Jinping will unwind a blistering trade dispute at a meeting this week. KEEPING SCORE: Japan's benchmark Nikkei 225, reopening after a hol… [+3088 chars]","description":"Asian shares were mostly higher Monday on hopes that U.S. President Donald Trump and his Chinese counterpart Xi Jinping will unwind a blistering trade dispute at a meeting this week.","publishedAt":"2018-11-25T21:35:00Z","source":{"id":null,"name":"Startribune.com"},"title":"Asian stocks rise on hopes US, China will unwind dispute","url":"http:\/\/www.startribune.com\/asian-stocks-rise-on-hopes-us-china-will-unwind-dispute\/501217292\/","urlToImage":"http:\/\/assets.startribune.com\/static\/img\/branding\/logos\/strib-social-card.png?d=1542657930","relevancy":84},{"author":null,"content":"Malacañang should rescind the taxes imposed on diesel and kerosene altogether after it agreed to suspend the second tranche of the Tax Reform for Acceleration and Inclusion (TRAIN) Act next year, according to Marikina City Rep. Miro Quimbo. Adversely affected… [+1352 chars]","description":"Malacaang should rescind the taxes imposed on diesel and kerosene altogether after it agreed to suspend the second tranche of the Tax Reform for Acceleration and Inclusion (TRAIN) Act next year, according to Marikina City Rep. Miro Quimbo. Adversely affected …","publishedAt":"2018-11-25T21:36:40Z","source":{"id":null,"name":"Inquirer.net"},"title":"Palace urged to rescind fuel taxes","url":"https:\/\/newsinfo.inquirer.net\/1057077\/palace-urged-to-rescind-fuel-taxes","urlToImage":"https:\/\/newsinfo.inquirer.net\/wp-content\/blogs.dir\/10\/files\/2018\/02\/gaspump-620x408.jpg","relevancy":18},{"author":"Tsvetana Paraskova","content":"Just two months ago, fears of plunging Iranian supply had the oil market and analysts wondering how high prices could go and if we are about to see $100 oil again. Just a few weeks later, no one’s talking about $100 anymore, and oil analysts and traders are t… [+4507 chars]","description":"Just two months ago, fears of plunging Iranian supply had the oil market and analysts wondering how high prices could go and if we are about to see $100 oil again. Just a few weeks later, no one’s talking about $100 anymore, and oil analysts and traders are t…","publishedAt":"2018-11-25T22:00:00Z","source":{"id":null,"name":"Oilprice.com"},"title":"Legendary Oil Trader Expects Crude Prices To Rebound","url":"https:\/\/oilprice.com\/Energy\/Energy-General\/Legendary-Oil-Trader-Expects-Crude-Prices-To-Rebound.html","urlToImage":"https:\/\/d32r1sh890xpii.cloudfront.net\/article\/718x300\/559f9f608f01f2aa3e0c532bcbdabf18.jpg","relevancy":50},{"author":"MarketWatch","content":"Promised cannabis-based treatments have enticed investors, but details are elusive. See full story. The Roth strategy we wish wed built for early retirement There is a lot to love about a Roth heres why. See full story. 7 key reasons the bottom is falling out… [+813 chars]","description":"Promised cannabis-based treatments have enticed investors, but details are elusive.","publishedAt":"2018-11-25T22:00:13Z","source":{"id":null,"name":"Marketwatch.com"},"title":"NewsWatch: The collapse of this cannabis stock offers a valuable lesson to every investor","url":"https:\/\/www.marketwatch.com\/story\/the-collapse-of-this-cannabis-stock-offers-a-valuable-lesson-to-every-investor-2018-11-25-17103012","urlToImage":"https:\/\/mw3.wsj.net\/mw5\/content\/logos\/mw_logo_social.png","relevancy":1},{"author":"Tyler Durden","content":"Back on November 1, we reported a \"fascinating statistic\" by Deutsche Bank - as of the end of October, 89% (a number that has since risen to at least 90%) of most major global assets had a negative total return year to date in dollar terms. This was the highe… [+8656 chars]","description":"Back on November 1, we reported a \"fascinating statistic\" by Deutsche Bank - as of the end of October, 89% (a number that has since risen to at least 90%) of most major global assets had a negative total return year to date in dollar terms. This was the highe…","publishedAt":"2018-11-25T22:45:00Z","source":{"id":null,"name":"Zerohedge.com"},"title":"\"It's Been A Pretty Miserable Year. 2019 Isn't Looking Any Better Either\"","url":"https:\/\/www.zerohedge.com\/news\/2018-11-25\/its-been-pretty-miserable-year-2019-isnt-looking-any-better-either","urlToImage":"https:\/\/www.zerohedge.com\/sites\/default\/files\/styles\/max_650x650\/public\/2018-11\/record%20down%20assets.jpg?itok=6h7yktyc","relevancy":83},{"author":"Bloomberg","content":"Caution looks set to prevail in financial markets at the start of the week as worries about a slowing global economy show no signs of abating. Stock futures in Asia indicated lower starts in Japan, Hong Kong and Australia after the S&amp;P 500 Index fell into… [+1110 chars]","description":"Caution looks set to prevail in financial markets at the start of the week as worries about a slowing global economy show no signs of abating.","publishedAt":"2018-11-25T23:28:37Z","source":{"id":null,"name":"Freemalaysiatoday.com"},"title":"Asia stocks to slip, treasuries inch toward 3%","url":"https:\/\/www.freemalaysiatoday.com\/category\/business\/2018\/11\/26\/asia-stocks-to-slip-treasuries-inch-toward-3\/","urlToImage":"https:\/\/s3media.freemalaysiatoday.com\/wp-content\/uploads\/2018\/11\/asia-stocks-bloomberg-26112018.png","relevancy":33},{"author":"USA TODAY, The Editorial Board, USA TODAY","content":"President Donald Trump speaks to members of the military from his Mar-a-Lago resort in Palm Beach, Florida, on Thanksgiving Day, Nov. 22, 2018. (Photo: Mandel Ngan\/AFP\/Getty Images) From Donald Trump's inauguration through last week's shameful decision to sta… [+3336 chars]","description":"Defending Saudi Crown Prince Mohammed bin Salman is just  the latest example of how the U.S. president is operating from a dark place: Our view","publishedAt":"2018-11-25T23:46:00Z","source":{"id":"usa-today","name":"USA Today"},"title":"Donald Trump's 'America First' nationalism betrays American values","url":"https:\/\/www.usatoday.com\/story\/opinion\/2018\/11\/25\/donald-trump-america-first-nationalism-betrays-american-values-editorials-debates\/2024321002\/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https:\/\/www.gannett-cdn.com\/presto\/2018\/11\/25\/USAT\/4e40fbd0-f4bc-4877-80af-a5ec7fd32b2c-blackTrump.JPG?crop=5999,3374,x0,y0&width=3200&height=1680&fit=bounds","relevancy":78},{"author":"Eustance Huang","content":"Oil prices plunged to their lowest levels in more than a year on Friday, deepening a rapid seven-week-sell-off that has plunged crude futures deep into a bear market amid growing worries of an oversupply. U.S. benchmark West Texas Intermediate crude ended Fri… [+666 chars]","description":"Australia's benchmark ASX 200 fell 0.68 percent in early trade, with the energy subindex down 1.89 percent and the materials sector off by 2.02 percent.","publishedAt":"2018-11-25T23:49:00Z","source":{"id":"cnbc","name":"CNBC"},"title":"Stocks in Australia fall in early trade; oil prices attempt to stage a recovery","url":"https:\/\/www.cnbc.com\/2018\/11\/26\/asia-markets-oil-brexit-currencies-in-focus.html","urlToImage":"https:\/\/fm.cnbc.com\/applications\/cnbc.com\/resources\/img\/editorial\/2018\/11\/02\/105547435-1541114325127gettyimages-1055654292.1910x1000.jpeg","relevancy":55},{"author":"John Rubino","content":"One of the strangest things about this strangest-ever expansion has been the way pretty much everything went up. Stocks, bonds, real estate, art, oil - some of which have historically negative correlations with others - all rose more or less in lock-step. And… [+4970 chars]","description":"One of the strangest things about this strangest-ever expansion has been the way pretty much everything went up. Stocks, bonds, real estate, art, oil - some of","publishedAt":"2018-11-25T23:59:10Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"Has This Become A 'Short Everything In Sight' Market?","url":"https:\/\/seekingalpha.com\/article\/4224354-become-short-everything-sight-market","urlToImage":"https:\/\/static3.seekingalpha.com\/uploads\/2018\/11\/25\/saupload_Asset-classes-with-neg-returns.jpg","relevancy":12},{"author":"Nick Cunningham","content":"Oil prices continue to plumb new depths, but some analysts think the selloff has gone too far. Brent prices fell to $62 per barrel by mid-week, hitting nearly a one-year low. The bearish narrative has taken hold in a big way, with rising U.S. shale production… [+4316 chars]","description":"Oil prices continue to plumb new depths, but some analysts think the selloff has gone too far. Brent prices fell to $62 per barrel by mid-week, hitting nearly a one-year low. The bearish narrative has taken hold in a big way, with rising U.S. shale production…","publishedAt":"2018-11-26T00:00:00Z","source":{"id":null,"name":"Oilprice.com"},"title":"Can OPEC+ Halt The Oil Price Slide?","url":"https:\/\/oilprice.com\/Energy\/Crude-Oil\/Can-OPEC-Halt-The-Oil-Price-Slide.html","urlToImage":"https:\/\/d32r1sh890xpii.cloudfront.net\/article\/718x300\/99ae3c5cdda156a573688fec3cd914d7.jpg","relevancy":61}]