[{"author":null,"content":"Washington (AFP) - The US trade deficit ballooned in August to its highest level in six months as exports of tariff-targeted goods fell while American consumers snapped up imported cars and mobile phones, the government reported Friday. The result, which show… [+3258 chars]","description":"The US trade deficit ballooned in August to its highest level in six months as exports of tariff-targeted goods fell while American consumers snapped up imported cars and mobile phones, the government reported Friday. The result, which showed mounting pressur…","publishedAt":"2018-10-06T00:02:27Z","source":{"id":null,"name":"Yahoo.com"},"title":"Record US imports drive goods trade deficit with China to high in August","url":"https:\/\/www.yahoo.com\/news\/record-us-imports-drive-goods-trade-deficit-china-165346536.html","urlToImage":"https:\/\/s.yimg.com\/uu\/api\/res\/1.2\/gICb423KO5tcaez.3_Gjpw--~B\/aD02ODI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-\/http:\/\/media.zenfs.com\/en_us\/News\/afp.com\/47417e39f856a3ae64a5b6cc31ffc8af178604ce.jpg","relevancy":17},{"author":"Surojit Gupta","content":"NEW DELHI: The Reserve Bank of India ( RBI ) may have revised downwards its inflation projections for 2018-19 and the first quarter of 2019-20, but it has flagged six key risks calling for a vigil over the next few months. The uncertainties clouding the infla… [+2455 chars]","description":"India Business News: NEW DELHI: The Reserve Bank of India (RBI) may have revised downwards its inflation projections for 2018-19 and the first quarter of 2019-20, but it h.","publishedAt":"2018-10-06T00:31:52Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"RBI flags six key risks to inflation outlook","url":"https:\/\/timesofindia.indiatimes.com\/business\/india-business\/rbi-flags-six-key-risks-to-inflation-outlook\/articleshow\/66093611.cms","urlToImage":"https:\/\/static.toiimg.com\/thumb\/msid-66093621,width-1070,height-580,imgsize-143071,resizemode-6,overlay-toi_sw,pt-32,y_pad-40\/photo.jpg","relevancy":60},{"author":"Randall W. Forsyth","content":"Just one week into the new month, stocks were defying the history cited here recently, slumping sharply in the final two sessions of the week. Bonds took the blame for stocks slump, as longer-term Treasury yields rose above their previous 2018 peaks to their … [+9389 chars]","description":"Combined with concerns about Italy’s economy and tensions with China, higher yields clobber Wall Street.","publishedAt":"2018-10-06T00:32:02Z","source":{"id":null,"name":"Barrons.com"},"title":"Rising Treasury Yields Could Batter Stocks","url":"https:\/\/www.barrons.com\/articles\/rising-treasury-yields-could-batter-stocks-1538785919","urlToImage":"https:\/\/asset.barrons.com\/public\/resources\/images\/ON-CR812_1005_U_G_20181005153247.jpg","relevancy":53},{"author":"Bangkok Post Public Company Limited","content":"WASHINGTON - The US trade deficit ballooned in August to its highest level in six months as exports of tariff-targeted goods fell while American consumers snapped up imported cars and mobile phones, the government reported Friday. Despite Trump's efforts to a… [+3376 chars]","description":"WASHINGTON - The US trade deficit ballooned in August to its highest level in six months as exports of tariff-targeted goods fell while American consumers snapped up imported cars and mobile phones, the government reported Friday.","publishedAt":"2018-10-06T00:45:12Z","source":{"id":null,"name":"Bangkokpost.com"},"title":"Record US imports drive goods trade deficit with China to high in August","url":"https:\/\/www.bangkokpost.com\/news\/world\/1552978\/record-us-imports-drive-goods-trade-deficit-with-china-to-high-in-august","urlToImage":"https:\/\/www.bangkokpost.com\/media\/content\/20181006\/2944794.jpg","relevancy":68},{"author":"webdesk@voanews.com (Reuters)","content":"DUBAI, UNITED ARAB EMIRATES Saudi Crown Prince Mohammed bin Salman said the kingdom has met its promise to Washington to make up for Iranian crude oil supplies lost through U.S. sanctions. The request that America made to Saudi Arabia and other OPEC countries… [+3311 chars]","description":"Saudi Crown Prince Mohammed bin Salman said the kingdom has met its promise to Washington to make up for Iranian crude oil supplies lost through U.S. sanctions. “The request that America made to Saudi Arabia and other OPEC countries is to be sure that if ther…","publishedAt":"2018-10-06T01:03:46Z","source":{"id":null,"name":"Voanews.com"},"title":"Saudi Crown Prince: ‘We Did Our Job’ Replacing Iranian Oil","url":"https:\/\/www.voanews.com\/a\/saudi-crown-prince-we-did-our-job-replacing-iranian-oil\/4602284.html","urlToImage":"https:\/\/gdb.voanews.com\/51383AE3-4D9A-42E8-A3FB-59E627F8E6F9_w1200_r1_s.jpg","relevancy":15},{"author":"Ben Levisohn","content":"Since topping out in 2008, Transocean has been where money goes to die. It might be ready to come back to life. The last decade has been painful for anyone who owned Transocean (ticker: RIG). The offshore drillers shares have tumbled more than 80% over the pa… [+3030 chars]","description":"Since topping out in 2008, Transocean stock has been where money goes to die. It might be ready to come back to life.","publishedAt":"2018-10-06T01:21:17Z","source":{"id":null,"name":"Barrons.com"},"title":"Transocean’s Storm-Tossed Stock Can Ride Gains in Oil, Stronger Economy","url":"https:\/\/www.barrons.com\/articles\/transoceans-storm-tossed-stock-can-ride-gains-in-oil-stronger-economy-1538787074","urlToImage":"https:\/\/asset.barrons.com\/public\/resources\/images\/ON-CR815_1005_O_G_20181005160554.jpg","relevancy":34},{"author":"Paul Farrell","content":"These reports, excerpted and edited by Barrons, were issued recently by investment and research firms. The reports are a sampling of analysts thinking; they should not be considered the views or recommendations of Barrons. Some of the reports issuers have pro… [+10094 chars]","description":"Analysts are mildly positive on PepsiCo and J&J as “classics.” Also, opinions on Capital One, Kohl’s, and Centennial Resources.","publishedAt":"2018-10-06T01:37:50Z","source":{"id":null,"name":"Barrons.com"},"title":"PepsiCo and J&J Look Buyable","url":"https:\/\/www.barrons.com\/articles\/pepsico-and-j-j-look-buyable-1538786663","urlToImage":"https:\/\/asset.barrons.com\/public\/resources\/images\/ON-CR454_PEPSI0_G_20180926104117.jpg","relevancy":79},{"author":null,"content":"The truth is now out. Arun Jaitley's pretend achievements as Finance Minister have amounted to no more than squeezing the lemon till the pips squeak. They are squeaking so loudly that his government has been compelled to reverse policy and lower by a tithe th… [+8507 chars]","description":"The truth is now out. Arun Jaitley's pretend achievements as Finance Minister have amounted to no more than squeezing the lemon till the pips squeak. They are squeaking so loudly that his government...","publishedAt":"2018-10-06T01:38:16Z","source":{"id":null,"name":"Ndtv.com"},"title":"Opinion: Jaitley's Handling Of Fuel Exposes Government's Jitters","url":"https:\/\/www.ndtv.com\/opinion\/jaitleys-handling-of-fuel-exposes-governments-jitters-1927648","urlToImage":"https:\/\/c.ndtvimg.com\/2018-09\/s8rb6as4_arun-jaitley-pti_625x300_26_September_18.jpg","relevancy":48},{"author":"Apple","content":"Although I personally day trade online using 5 minute charts, I often hold positions overnight based on 60 minute, daily, weekly, and monthly charts, and I use the same price action techniques for all markets and time frames. I strongly believe that anyone wh… [+864 chars]","description":"Al Brooks - Brooks Trading Course Genre: eLearning | Language: English | MP4 | 21.2 GB Make money trading any market My goal is to teach you how to make money by trading any market, including the Emini, Forex foreign exchange, currency futures, commodities li…","publishedAt":"2018-10-06T02:20:39Z","source":{"id":null,"name":"Gfxbing.com"},"title":"Al Brooks - Brooks Trading Course","url":"http:\/\/gfxbing.com\/video-tutorial\/886259-al-brooks-brooks-trading-course.html","urlToImage":"http:\/\/www.hostpic.org\/images\/1810060748450092.jpg","relevancy":81},{"author":null,"content":"Crude futures steadied on October 5 after climbing to four-year highs earlier this week, and both Brent and US crude marked weekly gains ahead of US sanctions on Iranian oil exports. US West Texas Intermediate (WTI) crude futures rose 1 cent to settle at $74.… [+2506 chars]","description":"Price gains this week were limited by Saudi Arabia and Russia#39;s saying they would raise output to at least partly make up for expected disruptions from Iran.","publishedAt":"2018-10-06T02:27:15Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"Oil prices mark weekly gain ahead of Iran sanctions","url":"https:\/\/www.moneycontrol.com\/news\/world\/oil-prices-mark-weekly-gain-ahead-of-iran-sanctions-3018881.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2018\/10\/Oil-Crude-Oil-770x433.jpg","relevancy":5},{"author":"Craig Mellow","content":"As if they needed it, U.S.-China relations face a new flashpoint on Nov. 4, when Washingtons new sanctions on Iran take full effect with the stated objective of cutting Tehrans oil exports to zero, from a current 1.7 million barrels a day. China, which buys a… [+3162 chars]","description":"Already at odds on numerous fronts, the two are expected to skirmish over November’s sanctions on the OPEC member.","publishedAt":"2018-10-06T02:32:46Z","source":{"id":null,"name":"Barrons.com"},"title":"The Next U.S. Clash With China Will Be All About Iran’s Oil","url":"https:\/\/www.barrons.com\/articles\/the-next-u-s-china-clash-iranian-oil-1538769125","urlToImage":"https:\/\/asset.barrons.com\/public\/resources\/images\/ON-CR695_1003_I_G_20181003120449.jpg","relevancy":25},{"author":"RFE\/RL","content":"Saudi Arabias crown prince in an interview with Bloomberg News is insisting that the kingdom is fulfilling promises to the United States to make up a shortfall in world oil supplies resulting from the loss of Iranian production under U.S. sanctions. \"The requ… [+3840 chars]","description":"Saudi Arabia’s crown prince in an interview with Bloomberg News is insisting that the kingdom is fulfilling promises to the United States to make up a shortfall in world oil supplies resulting from the loss of Iranian production under U.S. sanctions.","publishedAt":"2018-10-06T02:38:06Z","source":{"id":null,"name":"Rferl.org"},"title":"Saudi Prince Says Kingdom Raised Oil Output To Offset Loss Of Iranian Exports","url":"https:\/\/www.rferl.org\/a\/saudi-crown-prince-salman-says-increased-oil-output-offset-loss-iranian-exports\/29528691.html","urlToImage":"https:\/\/gdb.rferl.org\/BD680A2D-797C-4D83-B6D1-E1CE288017E8_w1200_r1_s.jpg","relevancy":73},{"author":null,"content":"The United States is actively considering sanctions waivers for countries that are reducing their imports of Iranian oil, a US government official said on Friday. The Trump administration withdrew from a deal over Tehran's nuclear programme in May and is unil… [+1050 chars]","description":"The administration is \"in the midst of an internal process\" of considering exceptions called SRE waivers, or significant reduction exemptions, said a government official","publishedAt":"2018-10-06T02:50:15Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"US actively considering waivers on Iran oil sanctions","url":"https:\/\/www.moneycontrol.com\/news\/business\/commodities\/us-actively-considering-waivers-on-iran-oil-sanctions-3018841.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2018\/09\/US-shale-oil-crude-oil-770x433.jpg","relevancy":7},{"author":null,"content":"As regular readers of this column know, it strives to offer a longer-term perspective that escapes the considerable noise that markets generate. Theres been no shortage of the latter this week as oil prices have jumped to a four-year high and long-dated US Tr… [+4876 chars]","description":"Drumbeat urging rotation out of hot US equities into global stocks grows louder","publishedAt":"2018-10-06T03:00:29Z","source":{"id":"financial-times","name":"Financial Times"},"title":"Breakout in yields a prelude to buying opportunities","url":"https:\/\/www.ft.com\/content\/6558be4e-c7c4-11e8-ba8f-ee390057b8c9","urlToImage":"https:\/\/www.ft.com\/__origami\/service\/image\/v2\/images\/raw\/http%3A%2F%2Fprod-upp-image-read.ft.com%2Ffd01ee1e-c8c8-11e8-86e6-19f5b7134d1c?source=next-opengraph&fit=scale-down&width=900","relevancy":31},{"author":"Madan Sabnavis","content":"At a time when the economy is going through tough times with a declining rupee, tight liquidity, rising interest rates, prospective inflation and general apprehension a lot was expected from the monetary policy. In hindsight, this may have been unrealistic as… [+5126 chars]","description":"As the policy goes with a stance of calibrated strengthening one can guess that there can be another rate hike when price conditions turn adverse. The post RBI keeps policy rate unchanged: When will the Monetary Policy Committee pull the trigger next? appeare…","publishedAt":"2018-10-06T03:02:25Z","source":{"id":null,"name":"Firstpost.com"},"title":"RBI keeps policy rate unchanged: When will the Monetary Policy Committee pull the trigger next?","url":"https:\/\/www.firstpost.com\/business\/rbi-keeps-policy-rate-unchanged-when-will-the-monetary-policy-committee-pull-the-trigger-next-5328631.html","urlToImage":"https:\/\/images.firstpost.com\/wp-content\/uploads\/2018\/09\/RBI-social.jpg","relevancy":23},{"author":"Tampa Bay Times","content":"Not since 1969: US regains ultra-low 3.7 pct. unemployment The last time the U.S. unemployment rate was as low as the 3.7 percent it is now\u0097 December 1969 \u0097 the economy was overheating, inflation was spiking and a short recession soon followed. Could that hap… [+4677 chars]","description":"Business Insider Business Highlights Tampa Bay Times ____. Pass It On: Advice for businesses from Stephen Badger. NEW YORK (AP) — The chairman of Mars Inc. says companies should place a huge importance on who they hire. Stephen Badger also suggests that manag…","publishedAt":"2018-10-06T03:07:12Z","source":{"id":null,"name":"Tampabay.com"},"title":"Business Highlights - Tampa Bay Times","url":"https:\/\/www.tampabay.com\/ap\/business\/business-highlights-ap_business288a9a66a8c64b8bae8752f8a5fd0d4f","urlToImage":"https:\/\/www.tampabay.com\/apps\/pbcsi.dll\/staticimage\/images\/facebook_icon.png","relevancy":10},{"author":"Reuters","content":"By: Reuters | Washington | Published: October 6, 2018 9:07:39 am It was the first time a US official said the administration was in the process of considering waivers. The Trump administration is actively considering waivers on sanctions it will reimpose next… [+1796 chars]","description":"The administration is \"in the midst of an internal process\" of considering exceptions called SRE waivers, or significant reduction exemptions, said a government official, who spoke on the condition of anonymity.","publishedAt":"2018-10-06T03:37:39Z","source":{"id":null,"name":"Indianexpress.com"},"title":"US actively considering waivers on Iran oil sanctions","url":"https:\/\/indianexpress.com\/article\/world\/us-actively-considering-waivers-on-iran-oil-sanctions-5389300\/","urlToImage":"https:\/\/images.indianexpress.com\/2018\/10\/iran-oil.jpg?w=759","relevancy":22},{"author":null,"content":"Indian stock market witnessed free fall in the last week with Sensex closing below 35,000 mark and Nifty 600 points lower owing to the falling rupee, sustained foreign capital outflows and concerns over widening current account deficit. The market started the… [+2171 chars]","description":"India VIX rose 16% last week, while largecaps index fell 5.3%, midcaps and smallcaps fell 5.1% and 4.9%, respectively","publishedAt":"2018-10-06T03:39:51Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"Week in 5 charts: Surprise RBI move, weak rupee put pressure on market","url":"https:\/\/www.moneycontrol.com\/news\/business\/markets\/week-in-5-charts-surprise-rbi-move-weak-rupee-put-pressure-on-market-3018951.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2018\/08\/Sensex_Nifty_BSE_Stock-Market_traders-770x433.jpg","relevancy":11},{"author":"Indo-Asian News Service","content":"Mumbai: A day after slashing VAT on petrol in Maharashtra, Chief Minister Devendra Fadnavis on Friday announced a reduction in diesel prices by Rs.4.06 per litre. He said after the Centre's relief of Rs.2.50 per litre on diesel, the state government has decid… [+2171 chars]","description":"On Thursday, shortly after the Centre announced reduction in prices of petrol-diesel, Maharashtra and at least a dozen states followed suit by reducing various local taxes like VAT on petrol and diesel. The post After petrol, Maharashtra announces reduction i…","publishedAt":"2018-10-06T03:42:39Z","source":{"id":null,"name":"Firstpost.com"},"title":"After petrol, Maharashtra announces reduction in diesel prices by Rs 4.06 per litre","url":"https:\/\/www.firstpost.com\/business\/after-petrol-maharashtra-announces-reduction-in-diesel-prices-by-rs-4-06-per-litre-5328831.html","urlToImage":"https:\/\/images.firstpost.com\/wp-content\/uploads\/2018\/04\/Petrolpumpindiafrom_social.jpg","relevancy":27},{"author":"Saikat Das","content":"MUMBAI: India’s debt and currency markets had starkly different reactions to the central bank’s rate action, with bond yields declining on expectations of lower inflation while the local monetary unit plunged to unprecedented lows and drove down equities. The… [+2470 chars]","description":"The benchmark bond yields dipped 13 basis points to close at 8.03 per cent.","publishedAt":"2018-10-06T03:52:30Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"Post policy, currency & bonds head in opposite directions","url":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/post-policy-currency-bonds-head-in-opposite-directions\/articleshow\/66094773.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66094817,width-1070,height-580,imgsize-912025,overlay-etmarkets\/photo.jpg","relevancy":69},{"author":"ET Bureau","content":"MUMBAI: Investors in oil marketing companies have lost Rs 1.39 lakh crore of wealth in the last two days after the government's decision to ask these firms to absorb a portion of the cut in excise duty on fuel prices. The move is perceived as the government b… [+1764 chars]","description":"concern of subsidy sharing mechanism would weigh on upstream companies .","publishedAt":"2018-10-06T03:58:18Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"Brokerages slash EPS & price targets for OMCs loaded with subsidy burden","url":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/brokerages-slash-eps-price-targets-for-omcs-loaded-with-subsidy-burden\/articleshow\/66094866.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66094856,width-1070,height-580,imgsize-806444,overlay-etmarkets\/photo.jpg","relevancy":62},{"author":null,"content":"This week on The Moneycontrol Show, we discuss top 5 queries on the minds of investors. Sakshi Batra gets in conversation with Manoj Nagpal to know the strategies that investors must adopt in current volatile times to mitigate risks on their portfolio. In our… [+619 chars]","description":"Watch the show to know top strategies to beat market volatility, impact of MPC#39;s status quo on rupee and the market and the impact of Aadhaar verdict","publishedAt":"2018-10-06T04:01:10Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"The Moneycontrol Show | Investment Queries Special; SC Aadhaar Verdict; Stock Market Strategies","url":"https:\/\/www.moneycontrol.com\/news\/business\/the-moneycontrol-show-investment-queries-special-sc-aadhaar-verdict-stock-market-strategies-3018931.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2018\/10\/final-thumbnail-770x433.jpg","relevancy":12},{"author":null,"content":"The US trade deficit ballooned in August to its highest level in six months as exports of tariff-targeted goods fell while American consumers snapped up imported cars and mobile phones, the government reported Friday. The result, which showed mounting pressur… [+3239 chars]","description":"The US trade deficit ballooned in August to its highest level in six months as exports of tariff-targeted goods fell while American consumers snapped up imported cars and mobile phones, the government reported Friday.The global network of Agence France Pr","publishedAt":"2018-10-06T04:02:00Z","source":{"id":null,"name":"Afp.com"},"title":"Record US imports drive goods trade deficit with China to high in August","url":"https:\/\/www.afp.com\/en\/news\/23\/record-us-imports-drive-goods-trade-deficit-china-high-august-doc-19t0a53","urlToImage":null,"relevancy":88},{"author":"No Author, No Author","content":"NEW, DELHI\/PARIS India and Russia on Friday signed a pact to build six more nuclear reactors at a new site in India following summit talks between their leaders in New Delhi. Russian President Vladimir Putin and Indian Prime Minister Narendra Modi also agreed… [+3779 chars]","description":"India and Russia on Friday signed a pact to build six more nuclear reactors at a new site in India following summit talks between their leaders in New Delh","publishedAt":"2018-10-06T04:54:37Z","source":{"id":null,"name":"Japantimes.co.jp"},"title":"Russia signs pact for six nuclear reactors on new site in India","url":"https:\/\/www.japantimes.co.jp\/news\/2018\/10\/06\/world\/russia-signs-pact-six-nuclear-reactors-new-site-india\/","urlToImage":"https:\/\/cdn.japantimes.2xx.jp\/wp-content\/uploads\/2018\/10\/f-russindia-a-20181007-870x580.jpg","relevancy":85},{"author":"Jimeet Modi","content":"This week was a nightmare, not only for the bulls but also for the government and the regulators. RBI, Sebi and the government together tried to curtail the contagion in the market through various initiatives such as allowing OMCs to tap the ECB route to rais… [+8800 chars]","description":"Oil prices were firm this week as investors remained focused on US sanctions on Iran.","publishedAt":"2018-10-06T04:56:04Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"Key signs emerge in market to signal a rebound is imminent","url":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/key-signs-emerge-in-market-to-signal-a-rebound-is-imminent\/articleshow\/66095279.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66095287,width-1070,height-580,imgsize-386457,overlay-etmarkets\/photo.jpg","relevancy":32},{"author":"ET Bureau","content":"Shubhada Rao The run-up to the October monetary policy was laced with heightened expectations of the anxious kind. On the macro front, two critical globally linked variables turned significantly adverse since the last policy review in August — crude oil price… [+4391 chars]","description":"On the micro front, sentiment in the economy had turned subdued amid sectoral ramifications of ongoing global trade war and liquidity pressures faced by domestic financial sector in recent weeks.","publishedAt":"2018-10-06T04:59:27Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"Bid to contain unknown risks, get adjustment time","url":"https:\/\/economictimes.indiatimes.com\/news\/economy\/policy\/bid-to-contain-unknown-risks-get-adjustment-time\/articleshow\/66095291.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66095288,width-1070,height-580,imgsize-622574,overlay-economictimes\/photo.jpg","relevancy":51},{"author":null,"content":null,"description":"India will buy 9 million barrels of Iranian oil in November, two industry sources said, indicating the world's third-biggest oil importer will continue purchasing crude from the Islamic republic despite US sanctions coming into force on Nov. 4.","publishedAt":"2018-10-06T05:07:08Z","source":{"id":null,"name":"Ynetnews.com"},"title":"India to keep buying Iranian oil despite US sanctions","url":"https:\/\/www.ynetnews.com\/articles\/0,7340,L-5364692,00.html","urlToImage":"https:\/\/www.ynetnews.com\/images\/default_EynetLogo200_200.jpg","relevancy":40},{"author":"REUTERS","content":"NEW DELHI : India will buy 9 million barrels of Iranian oil in November, two industry sources said, indicating the world's third-biggest oil importer will continue purchasing crude from the Islamic republic despite US sanctions coming into force on Nov. 4. \"R… [+2646 chars]","description":"The United States plans to impose new sanctions targeting Iran's oil sector on Nov. 4.","publishedAt":"2018-10-06T05:21:22Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"India to keep buying Iranian oil despite US sanctions: Sources","url":"https:\/\/economictimes.indiatimes.com\/markets\/commodities\/news\/india-to-keep-buying-iranian-oil-despite-us-sanctions-sources\/articleshow\/66095525.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66095549,width-1070,height-580,imgsize-1413643,overlay-etmarkets\/photo.jpg","relevancy":1},{"author":"Reuters","content":"Major world stock markets sank for a second straight day on Friday after strong US jobs numbers signalled a continued tightening of the labour market and increased inflation pressures, while Treasury yields rose again to multi-year highs. The increase in US n… [+2954 chars]","description":"US Treasury yields hit multi-year highs after solid jobs report","publishedAt":"2018-10-06T05:42:53Z","source":{"id":null,"name":"Thehindubusinessline.com"},"title":"Stocks fall globally as US jobs data, Treasury yields rise again","url":"https:\/\/www.thehindubusinessline.com\/markets\/stock-markets\/stocks-fall-globally-as-us-jobs-data-treasury-yields-rise-again\/article25142132.ece","urlToImage":"https:\/\/www.thehindubusinessline.com\/markets\/stock-markets\/qu60bq\/article25142136.ece\/ALTERNATES\/LANDSCAPE_615\/globalJPG","relevancy":65},{"author":"ET Bureau","content":"Emerging markets have raised rates to arrest sliding local currencies. A cocktail of factors have contributed to such falls amid global dollar strengthening. In past year, rate hikes by the US Federal Reserve have triggered a capital flight to safe-heaven ass… [+665 chars]","description":"​​The Argentine Peso and the Turkish Lira are two worst performing currencies.","publishedAt":"2018-10-06T05:49:45Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"In 2018, EMs hiked rates to arrest currency slide","url":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/in-2018-ems-hiked-rates-to-arrest-currency-slide\/articleshow\/66095774.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66095770,width-1070,height-580,imgsize-1247942,overlay-etmarkets\/photo.jpg","relevancy":66},{"author":"ET CONTRIBUTORS","content":"By Pritam Kumar Patnaik While crude oil prices continued to head northward, prices of precious metals dropped and base metals continued to show a positive bias. Here’s a roundup of market trends across key commodities during the week gone by. Base Metals: Bas… [+6132 chars]","description":"Oil prices remained firm this week as investors remained focused on US sanctions on Iran.","publishedAt":"2018-10-06T06:14:54Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"Commodity Roundup: Crude oil in mood to crack; base metals shine","url":"https:\/\/economictimes.indiatimes.com\/markets\/commodities\/news\/commodity-roundup-crude-oil-in-mood-to-crack-base-metals-shine\/articleshow\/66096007.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66096001,width-1070,height-580,imgsize-797018,overlay-etmarkets\/photo.jpg","relevancy":26},{"author":"ISNA News Agency","content":"Tehran (ISNA) - India will buy 9 million barrels of Iranian oil in November, two industry sources said, indicating the worlds third-biggest oil importer will continue purchasing crude from the Islamic republic of Iran despite U.S. sanctions coming into force … [+1928 chars]","description":"Tehran (ISNA) - India will buy 9 million barrels of Iranian oil in November, two industry sources said, indicating the world’s third-biggest oil importer will continue purchasing crude from the Islamic republic of Iran despite U.S. sanctions coming into force…","publishedAt":"2018-10-06T06:20:25Z","source":{"id":null,"name":"Isna.ir"},"title":"India to keep buying Iranian oil despite U.S. sanctions","url":"https:\/\/en.isna.ir\/news\/97071407509\/India-to-keep-buying-Iranian-oil-despite-U-S-sanctions","urlToImage":"https:\/\/cdn.isna.ir\/d\/2017\/11\/01\/4\/57584837.jpg","relevancy":74},{"author":"ET Bureau","content":"MUMBAI: Stocks slumped to a six-month-low and the rupee sank below 74 after the Reserve Bank of India (RBI) kept interest rates unchanged, belying investor expectations that rates would be increased to stem the local currency’s fall. Foreign portfolio investo… [+2774 chars]","description":"Nifty records biggest single-day fall since November 2016; rupee hits fresh low of 73.77.","publishedAt":"2018-10-06T06:30:11Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"Stocks and rupee stumble as central bank refuses to extend helping hand","url":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/stocks-and-rupee-stumble-as-central-bank-refuses-to-extend-helping-hand\/articleshow\/66096120.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66096143,width-1070,height-580,imgsize-80381,overlay-etmarkets\/photo.jpg","relevancy":45},{"author":null,"content":"NEW DELHI: A couple of days after the central government cut excise duty on petrol and diesel and several state governments followed suit, finance minister Arun Jaitley on Saturday took to writing a blog on the issue. Terming the problem of rising crude oil p… [+1145 chars]","description":"Terming the ​​​problem of rising crude oil prices in the global market as a serious one, Jaitley said oil producing nations have capped their production, thus creating a demand-supply mismatch. He used the opportunity to take a dig on his political rivals say…","publishedAt":"2018-10-06T06:48:52Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"'Oil price problem cannot be resolved by tweets'","url":"https:\/\/timesofindia.indiatimes.com\/business\/india-business\/oil-price-problem-cannot-by-resoved-by-tweets-and-bytes-of-opposition-leaders-jaitley\/articleshow\/66096122.cms","urlToImage":"https:\/\/static.toiimg.com\/thumb\/msid-66096348,width-1070,height-580,imgsize-151160,resizemode-6,overlay-toi_sw,pt-32,y_pad-40\/photo.jpg","relevancy":0},{"author":null,"content":"Indian markets remained under a heavy selling pressure throughout the week ended October 5 mostly after RBI monetary policy committee surprised the the street with no change in its key rates. Weak rupee, rising crude oil prices and surprise move by Central Ba… [+4053 chars]","description":"In the last week, the Sensex lost 1850.15 points to close at 34,376.99, while Nifty shed 614 points to close at 10,316.45.","publishedAt":"2018-10-06T06:56:35Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"Yet another lousy week for stock markets: Check out top 10 gainers and losers of D-Street","url":"https:\/\/www.moneycontrol.com\/news\/business\/markets\/yet-another-lousy-week-for-stock-markets-check-out-top-10-gainers-and-losers-of-d-street-3019141.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2017\/03\/stocks_BSE_Nifty_Sensex__bear_bull-2_1280-770x433.jpg","relevancy":30},{"author":"Open Square Capital","content":"If you had any doubt as to Saudi Arabia's intentions about the oil market, this chart should put that to rest. This is based on the latest information from JODI (July) and shows Saudi Arabia's exports holding steady around 7M bpd but crude inventories falling… [+2730 chars]","description":"We update our charts for JODI July data. Saudi Arabia's oil inventories continue to fall, now lowest in a decade. Anticipate no change to the current trajectory","publishedAt":"2018-10-06T06:58:19Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"Saudi Arabia's Incredibly Shrinking Inventories","url":"https:\/\/seekingalpha.com\/article\/4210189-saudi-arabias-incredibly-shrinking-inventories","urlToImage":"https:\/\/static2.seekingalpha.com\/images\/marketing_images\/oil_gas\/0814147_2590_d966_e2c6cf39509cc971.jpeg","relevancy":6},{"author":"ET CONTRIBUTORS","content":"By DK Aggarwal Over the years, there were two main reasons for the Indian stock markets to gain, low crude oil prices and plenty of liquidity in global markets thanks to soft money policies of major central banks. While low crude prices turned the Indian econ… [+2473 chars]","description":"Low crude prices turned the Indian economy from wealth destroyer to wealth creator.","publishedAt":"2018-10-06T08:31:02Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"D-Street faces a serious test; it’s time for contra investing","url":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/d-street-faces-a-serious-test-its-time-for-contra-investing\/articleshow\/66097171.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66097178,width-1070,height-580,imgsize-929339,overlay-etmarkets\/photo.jpg","relevancy":38},{"author":null,"content":"Petrol, diesel rates: On Wednesday, Brent hit its highest price since late 2014, at $86.74. Oil-marketing companies increased the prices of petrol and diesel across the four metro cities on Saturday, despite the Centre and states announcing cuts in the rates.… [+1464 chars]","description":"Petrol, diesel rates are decided on a daily basis by oil-marketing companies on the basis of the rupee-dollar rate and global crude oil prices.","publishedAt":"2018-10-06T08:38:51Z","source":{"id":null,"name":"Ndtv.com"},"title":"Petrol, Diesel Prices Rise In Metros Despite Cuts; Check Rates Here","url":"https:\/\/www.ndtv.com\/business\/petrol-diesel-prices-today-october-6-petrol-diesel-rates-in-new-delhi-mumbai-kolkata-chennai-1927810","urlToImage":"https:\/\/c.ndtvimg.com\/2018-09\/uf4atlfo_petrol-diesel-fuel-reuters-_625x300_10_September_18.jpg","relevancy":28},{"author":null,"content":"Arun Jaitley said high crude oil price in international markets is affecting fuel rate in India New Delhi: Finance Minister Arun Jaitley has taken a swipe at the opposition over its math on runaway fuel price rise. In a post on Facebook, Mr Jaitley linked the… [+1781 chars]","description":"Finance Minister Arun Jaitley has taken a swipe at the opposition over its math on runaway fuel price rise. In a post on Facebook, Mr Jaitley linked the weakening rupee and widening current account deficit or CAD to high international price of crude oil. \"The…","publishedAt":"2018-10-06T08:42:43Z","source":{"id":null,"name":"Ndtv.com"},"title":"Can't Solve Oil Price Rise With Tweets: Arun Jaitley's Dig At Opposition","url":"https:\/\/www.ndtv.com\/india-news\/cant-solve-oil-price-rise-with-tweets-arun-jaitleys-dig-at-opposition-1927811","urlToImage":"https:\/\/i.ndtvimg.com\/i\/2018-04\/arun-jaitley_650x400_61523287203.jpg","relevancy":42},{"author":null,"content":"With non-BJP ruled states refusing to cut taxes on fuel, Finance Minister Arun Jaitley on Saturday questioned Congress President Rahul Gandhi and his \"reluctant allies\" if they are only committed to tweets and television bytes when it comes to giving relief t… [+3620 chars]","description":"Jaitley said the political crisis in Venezuela and Libya has adversely impacted oil producing countries and the US sanctions on Iran also have increased uncertainties over supplies.","publishedAt":"2018-10-06T08:50:05Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"Arun Jaitley questions commitment of Rahul Gandhi, his allies to cut fuel taxes","url":"https:\/\/www.moneycontrol.com\/news\/politics\/arun-jaitley-questions-commitment-of-rahul-gandhi-his-allies-to-cut-fuel-taxes-3019581.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2018\/08\/Arun-Jaitley_Finance-minsiter-770x433.jpg","relevancy":8},{"author":"Press Trust of India","content":"With non-BJP ruled states refusing to cut taxes on fuel, Finance Minister Arun Jaitley Saturday questioned Congress President Rahul Gandhi and his \"reluctant allies\" if they are only committed to tweets and television bytes when it comes to giving relief to t… [+3617 chars]","description":"Non-BJP ruled states like Kerala, Karnataka and West Bengal have refused to cut taxes","publishedAt":"2018-10-06T08:55:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"Rahul, allies focused on TV bytes & tweets, drag feet on fuel price cut: FM","url":"https:\/\/www.business-standard.com\/article\/current-affairs\/rahul-allies-focused-on-tv-bytes-tweets-drag-feet-on-fuel-price-cut-fm-118100600307_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-09\/16\/full\/1537037810-6618.jpg","relevancy":35},{"author":"PTI","content":"With non-BJP ruled States refusing to cut taxes on fuel, Finance Minister Arun Jaitley on Saturday questioned Congress president Rahul Gandhi and his reluctant allies if they are only committed to tweets and television bytes when it comes to giving relief to … [+3710 chars]","description":"States collect extra taxes when oil prices go up since their taxes are ad valorem, the Finance Minister said","publishedAt":"2018-10-06T09:27:18Z","source":{"id":"the-hindu","name":"The Hindu"},"title":"Petrol price cut: Jaitley questions commitment of Rahul, his allies","url":"https:\/\/www.thehindu.com\/news\/national\/petrol-price-cut-jaitley-questions-commitment-of-rahul-his-allies\/article25143542.ece","urlToImage":"https:\/\/www.thehindu.com\/news\/national\/w2cf3q\/article22947228.ece\/ALTERNATES\/LANDSCAPE_615\/VBK-ARUN-JAITLEY-2","relevancy":2},{"author":null,"content":"The low base due to GST effect no longer exist and may no more work in favour of companies in second quarter, says Mayuresh Joshi, Fund Manager at Angel Broking. In an interview to ET Now, the expert said festive season in September quarter of last year may i… [+4928 chars]","description":"A natural devaluation is happening in the Chinese Yuan.","publishedAt":"2018-10-06T09:43:34Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"Investors should calibrate their Q2 earnings expectations: Mayuresh Joshi","url":"https:\/\/economictimes.indiatimes.com\/markets\/expert-view\/investors-should-calibrate-their-q2-earnings-expectations-mayuresh-joshi\/articleshow\/66097812.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66097857,width-1070,height-580,imgsize-12072,overlay-etmarkets\/photo.jpg","relevancy":4},{"author":"PTI","content":"With non-BJP ruled states refusing to cut taxes on fuel, Finance Minister Arun Jaitley Saturday questioned Congress President Rahul Gandhi and his \"reluctant allies\" if they are only committed to tweets and television bytes when it comes to giving relief to t… [+3618 chars]","description":"In a Facebook post titled 'The oil prices and the hypocrisy of the opposition', Jaitley accused the government critics of doing a 'volte face' by terming the cut in petrol and diesel prices by Rs 2.5 per litre by the Centre as 'bad economics'.","publishedAt":"2018-10-06T09:56:42Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"Petrol price cut: Arun Jaitley questions commitment of Rahul Gandhi, his allies","url":"https:\/\/economictimes.indiatimes.com\/news\/politics-and-nation\/petrol-price-cut-arun-jaitley-questions-commitment-of-rahul-gandhi-his-allies\/articleshow\/66097974.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66097989,width-1070,height-580,imgsize-231036,overlay-economictimes\/photo.jpg","relevancy":54},{"author":"Cathy Young","content":"This year, with the start of a new presidential term that runs out in 2024, Vladimir Putin has achieved the dubious milestone of having been in power longer than Leonid Brezhnev, who led the country from 1964 to 1982. It is an apt comparison, since the age of… [+29811 chars]","description":"The authoritarian president's hold on power may be shakier than it looks.","publishedAt":"2018-10-06T10:00:00Z","source":{"id":null,"name":"Reason.com"},"title":"Dissent and Disarray in Putin's Russia","url":"https:\/\/reason.com\/archives\/2018\/10\/06\/dissent-and-disarray-in-putins","urlToImage":"https:\/\/d1jn4vzj53eli5.cloudfront.net\/db\/15371970832749.jpg","relevancy":75},{"author":null,"content":"(In this October 5 story corrects number of candidates in third paragraph, removes former candidate's name in paragraph 12) By Alexis Akwagyiram ABUJA (Reuters) - Nigeria's main opposition party, which this weekend selects its candidate to challenge President… [+3889 chars]","description":"(In this October 5 story corrects number of candidates in third paragraph, removes former candidate's name in paragraph 12) By Alexis Akwagyiram ABUJA (Reuters) - Nigeria's main opposition party, which this weekend selects its candidate to challenge President…","publishedAt":"2018-10-06T10:31:39Z","source":{"id":null,"name":"Yahoo.com"},"title":"Nigerian opposition to pick presidential candidate as northwest takes center stage","url":"https:\/\/www.yahoo.com\/news\/nigerian-opposition-pick-presidential-candidate-northwest-takes-center-103139536.html","urlToImage":"https:\/\/s.yimg.com\/os\/mit\/media\/m\/social\/images\/social_default_logo-1481777.png","relevancy":39},{"author":"Hoya Capital Real Estate","content":"Real Estate Weekly Review The sudden surge in the 10-Year yield to levels last seen in 2011 pressured interest rate-senstive sectors this week, along with the broader US equity market. The S&amp;P 500 ( SPY ) retreated more than 1% this week despite strong ec… [+12274 chars]","description":"Homebuilders and REITs dipped for the second consecutive week, pressured by the sudden surge in the 10-Year yield. Homebuilders have lost nearly a quarter of th","publishedAt":"2018-10-06T10:36:23Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"Brutal Week For Real Estate As Rates Surge","url":"https:\/\/seekingalpha.com\/article\/4210200-brutal-week-real-estate-rates-surge","urlToImage":"https:\/\/static1.seekingalpha.com\/uploads\/2018\/10\/1723581_15387707831822_rId8_thumb.jpg","relevancy":86},{"author":"InsightsIAS","content":"Insights Daily Current Affairs, 06 October 2018 Paper 2: Topic : Development processes and the development industry the role of NGOs, SHGs, various groups and associations, donors, charities, institutional and other stakeholders. Swachh Survekshan Grameen Awa… [+17052 chars]","description":"Insights Daily Current Affairs, 06 October 2018 Paper 2: Topic: Development processes and the development industry the role of NGOs, SHGs, various groups and associations, donors, charities, institutional and other stakeholders. Swachh Survekshan Grameen Awar…","publishedAt":"2018-10-06T10:39:12Z","source":{"id":null,"name":"Insightsonindia.com"},"title":"Insights Daily Current Affairs, 06 October 2018","url":"http:\/\/www.insightsonindia.com\/2018\/10\/06\/insights-daily-current-affairs-06-october-2018\/","urlToImage":"http:\/\/www.insightsonindia.com\/wp-content\/uploads\/2018\/10\/GI-Tag-for-Alphonso-from-Konkan-300x225.jpg","relevancy":70},{"author":"https:\/\/www.dailymail.co.uk\/home\/search.html?s=&authornamef=Afp","content":"Despite its oil riches, the majority of Gabonese live in abject poverty Oil-rich Gabon, ruled by the same political dynasty for nearly half a century, started voting Saturday in long-delayed legislative and municipal polls, the first since a presidential elec… [+3665 chars]","description":"Oil-rich Gabon, ruled by the same political dynasty for nearly half a century, started voting Saturday in long-delayed legislative and municipal polls, the...","publishedAt":"2018-10-06T10:57:42Z","source":{"id":"daily-mail","name":"Daily Mail"},"title":"Gabon votes for first time since violence-marred 2016...","url":"https:\/\/www.dailymail.co.uk\/wires\/afp\/article-6246925\/Gabon-votes-time-violence-marred-2016-election.html","urlToImage":"https:\/\/i.dailymail.co.uk\/1\/2018\/10\/06\/11\/wire-4816642-1538823457-799_636x382.jpg","relevancy":58},{"author":"ISNA News Agency","content":"Tehran (ISNA) - The US has reportedly discussed possible waivers on sanctions targeting countries that fail to stop importing Iranian oil, which will be introduced next month. Washington is in the midst of an internal process of considering significant reduct… [+971 chars]","description":"Tehran (ISNA) - The US has reportedly discussed possible waivers on sanctions targeting countries that fail to stop importing Iranian oil, which will be introduced next month.","publishedAt":"2018-10-06T11:00:29Z","source":{"id":null,"name":"Isna.ir"},"title":"US administration considering waivers for Iranian sanctions","url":"https:\/\/en.isna.ir\/news\/97071407813\/US-administration-considering-waivers-for-Iranian-sanctions","urlToImage":"https:\/\/cdn.isna.ir\/d\/2018\/09\/10\/4\/57742775.jpg","relevancy":77},{"author":"Fear & Greed Trader","content":"\"The older I get, the more I realize how many kinds of smart there are. There are a lot of kinds of smart. There are a lot of kinds of stupid, too.\" - Jeff Bezos When we talk about the stock market, the questions remain. What about: Rising interest rates? Eme… [+29664 chars]","description":"New highs registered in the Dow Industrials, then investor panic sets in. Plenty of reasons given for the two-day selling event. Forget that noise; it’s a norma","publishedAt":"2018-10-06T11:12:43Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"S&P 500 Weekly Update: An Opportunity; The Pullback That Everyone Was Looking For Is Here","url":"https:\/\/seekingalpha.com\/article\/4210203-s-and-p-500-weekly-update-opportunity-pullback-everyone-looking","urlToImage":"https:\/\/static3.seekingalpha.com\/uploads\/2018\/10\/5\/saupload_g4TxvW2jHpaiggp-_s646j341kOS_WlmDMvDb9oE6aaFITL5Hjy-teIHZLDzeXjK7dI-H6d4Oq9ylVkoejnGps9JaI8ZRkxwXpeKOFfyVxMNpeO_dtMoUGUBI1oHfjjIMms7RMle.jpeg","relevancy":80},{"author":null,"content":"(Bloomberg) -- Saudi Crown Prince Mohammed bin Salman praised his relationship with President Donald Trump, days after the U.S. leader warned that the oil-rich kingdoms leadership might not last two weeks without American support. I love working with him, Pri… [+4506 chars]","description":"Yahoo News Saudi Crown Prince Says He Loves Working With Trump Yahoo News (Bloomberg) -- Saudi Crown Prince Mohammed bin Salman praised his relationship with President Donald Trump, days after the U.S. leader warned that the oil-rich kingdom's leadership migh…","publishedAt":"2018-10-06T11:19:46Z","source":{"id":null,"name":"Yahoo.com"},"title":"Saudi Crown Prince Says He Loves Working With Trump - Yahoo News","url":"https:\/\/finance.yahoo.com\/news\/saudi-crown-prince-says-loves-173024946.html","urlToImage":"https:\/\/s.yimg.com\/uu\/api\/res\/1.2\/H_bkecbHAzy8MzK_LRpPFg--~B\/aD03NTc7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-\/http:\/\/media.zenfs.com\/en-US\/homerun\/bloomberg_markets_842\/3955db3c620de0a65bf626e828f2e219","relevancy":3},{"author":"Sheela Tobben | Bloomberg","content":"Even though Beijing hasn’t sanctioned American oil imports yet, Chinese buyers aren’t taking any chances. The world’s second largest economy halted purchases of US crude in August for the first time since September 2016, according to US Census Bureau data rel… [+1248 chars]","description":"China's interest in American oil has diminished amid the escalating trade spat between the two nations","publishedAt":"2018-10-06T11:21:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"Trade war impact: Wary Chinese buyers slam brakes on US Crude Oil Imports","url":"https:\/\/www.business-standard.com\/article\/international\/trade-war-impact-wary-chinese-buyers-slam-brakes-on-us-crude-oil-imports-118100600413_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-09\/29\/full\/1538240192-3062.jpg","relevancy":52},{"author":"Reuters Editorial","content":"NEW DELHI, Oct 6 (Reuters) - India may be forced to delay selling its stake in Axis Bank Ltd because of a weak stock market, The Economic Times newspaper reported on Saturday, citing unnamed market sources and an investment banker aware of the development. In… [+1289 chars]","description":"India may be forced to delay selling its stake in Axis Bank Ltd because of a weak stock market, The Economic Times newspaper reported on Saturday, citing unnamed market sources and an investment banker aware of the development.","publishedAt":"2018-10-06T11:51:13Z","source":{"id":"reuters","name":"Reuters"},"title":"India may be forced to delay Axis Bank stake sale - ET","url":"https:\/\/www.reuters.com\/article\/axis-bank-india-divestiture\/india-may-be-forced-to-delay-axis-bank-stake-sale-et-idUSL4N1WL26F","urlToImage":"https:\/\/s4.reutersmedia.net\/resources_v2\/images\/rcom-default.png","relevancy":82},{"author":"Alexis Akwagyiram","content":"ABUJA (Reuters) - Nigeria’s main opposition party, which this weekend selects its candidate to challenge President Muhammadu Buhari in an election in February, is aiming to make his northwestern power base a main battleground in the contest. To do so, however… [+3743 chars]","description":"Nigeria's main opposition party, which this weekend selects its candidate to challenge President Muhammadu Buhari in an election in February, is aiming to make his northwestern power base a main battleground in the contest.","publishedAt":"2018-10-06T11:54:14Z","source":{"id":"reuters","name":"Reuters"},"title":"Nigerian opposition to pick presidential candidate as northwest takes centre stage","url":"https:\/\/af.reuters.com\/article\/topNews\/idAFKCN1MG0C5-OZATP","urlToImage":"https:\/\/s3.reutersmedia.net\/resources\/r\/?m=02&d=20181006&t=2&i=1311866914&w=1200&r=LYNXNPEE950BK-OZATP","relevancy":87},{"author":"Reuters Editorial","content":"NEW DELHI (Reuters) - India may be forced to delay selling its stake in Axis Bank Ltd because of a weak stock market, The Economic Times newspaper reported on Saturday, citing unnamed market sources and an investment banker aware of the development. India was… [+1281 chars]","description":"India may be forced to delay selling its stake in Axis Bank Ltd because of a weak stock market, The Economic Times newspaper reported on Saturday, citing unnamed market sources and an investment banker aware of the development.","publishedAt":"2018-10-06T11:57:15Z","source":{"id":"reuters","name":"Reuters"},"title":"India may be forced to delay Axis Bank stake sale: ET","url":"https:\/\/in.reuters.com\/article\/axis-bank-india-divestiture\/india-may-be-forced-to-delay-axis-bank-stake-sale-et-idINKCN1MG0CE","urlToImage":"https:\/\/s3.reutersmedia.net\/resources\/r\/?m=02&d=20181006&t=2&i=1311867322&w=1200&r=LYNXNPEE950BQ","relevancy":64},{"author":"Reuters Editorial","content":"NEW DELHI (Reuters) - India on Saturday sought to assure investors that the government would not go back to regulating fuel prices, a day after oil company shares tumbled on concerns about a return to a regime that has hurt their profits in the past. The gove… [+1533 chars]","description":"India on Saturday sought to assure investors that the government would not go back to regulating fuel prices, a day after oil company shares tumbled on concerns about a return to a regime that has hurt their profits in the past.","publishedAt":"2018-10-06T11:59:24Z","source":{"id":"reuters","name":"Reuters"},"title":"India seeks to reassure markets on deregulation of fuel prices","url":"https:\/\/uk.reuters.com\/article\/us-india-oil\/india-seeks-to-reassure-markets-on-deregulation-of-fuel-prices-idUKKCN1MG0D2","urlToImage":"https:\/\/s4.reutersmedia.net\/resources\/r\/?m=02&d=20181006&t=2&i=1311867673&w=1200&r=LYNXNPEE950BV","relevancy":84},{"author":"No Author, No Author","content":"ABUJA Nigeria’s main opposition party, which this weekend selects its candidate to challenge President Muhammadu Buhari in an election in February, is aiming to make his northwestern power base a main battleground in the contest. To do so, however, it needs t… [+3595 chars]","description":"Nigeria’s main opposition party, which this weekend selects its candidate to challenge President Muhammadu Buhari in an election in February, is aiming to make his...","publishedAt":"2018-10-06T12:00:51Z","source":{"id":null,"name":"Japantimes.co.jp"},"title":"As northwestern region takes center stage, Nigerian opposition to pick presidential candidate","url":"https:\/\/www.japantimes.co.jp\/news\/2018\/10\/06\/world\/politics-diplomacy-world\/northwestern-region-takes-center-stage-nigerian-opposition-pick-presidential-candidate\/","urlToImage":"https:\/\/cdn.japantimes.2xx.jp\/wp-content\/uploads\/2018\/10\/f-nigeriaelection-a-20181007-870x611.jpg","relevancy":90},{"author":null,"content":"India may be forced to delay selling its stake in Axis Bank Ltd because of a weak stock market, a report said on Saturday, citing unnamed market sources and an investment banker aware of the development. India was planning to raise Rs 7,000 crore ($950 millio… [+1157 chars]","description":"The situation has been exacerbated by a series of defaults at Infrastructure Leasing Financial Services (ILFS) which has undermined confidence in India#39;s financial sector","publishedAt":"2018-10-06T12:05:10Z","source":{"id":null,"name":"Moneycontrol.com"},"title":"Govt may be forced to delay Axis Bank stake sale: Report","url":"https:\/\/www.moneycontrol.com\/news\/business\/govt-may-be-forced-to-delay-axis-bank-stake-sale-report-3019821.html","urlToImage":"https:\/\/static-news.moneycontrol.com\/static-mcnews\/2018\/06\/AxisBank-770x433.jpg","relevancy":16},{"author":null,"content":"October 6, 2018 NEW DELHI (Reuters) – India on Saturday sought to assure investors that the government would not go back to regulating fuel prices, a day after oil company shares tumbled on concerns about a return to a regime that has hurt their profits in th… [+1571 chars]","description":"NEW DELHI - India on Saturday sought to assure investors that the government would not go back to regulating fuel prices, a day after oil company shares tumbled on concerns about a return to","publishedAt":"2018-10-06T12:05:40Z","source":{"id":null,"name":"Oann.com"},"title":"India seeks to reassure markets on deregulation of fuel prices","url":"http:\/\/www.oann.com\/india-seeks-to-reassure-markets-on-deregulation-of-fuel-prices\/","urlToImage":null,"relevancy":91},{"author":"Reuters Editorial","content":"NEW DELHI (Reuters) - The Indian government on Saturday sought to assure investors that the government would not go back to regulating fuel prices, a day after oil company shares tumbled on concerns about a return to a regime that has hurt their profits in th… [+1512 chars]","description":"The Indian government on Saturday sought to assure investors that the government would not go back to regulating fuel prices, a day after oil company shares tumbled on concerns about a return to a regime that has hurt their profits in the past.","publishedAt":"2018-10-06T12:08:36Z","source":{"id":"reuters","name":"Reuters"},"title":"Indian government seeks to reassure markets on deregulation of fuel prices","url":"https:\/\/in.reuters.com\/article\/india-oil\/indian-government-seeks-to-reassure-markets-on-deregulation-of-fuel-prices-idINKCN1MG0CY","urlToImage":"https:\/\/s4.reutersmedia.net\/resources\/r\/?m=02&d=20181006&t=2&i=1311868394&w=1200&r=LYNXNPEE950BU","relevancy":57},{"author":"Alfonso Esparza","content":"The US dollar was mixed Friday. The greenback advanced against the commodity currencies (CAD, AUD, and NZD) edging higher against the CHF, but was lower against the JPY and the EUR. The GBP deserves a special mention as positive Brexit rumors pushed it 0.61 p… [+5515 chars]","description":"The US dollar was mixed Friday. The greenback advanced against the commodity currencies (CAD, AUD, and NZD) edging higher against the CHF, but was lower against","publishedAt":"2018-10-06T12:09:51Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"Week Ahead - Dollar Slows Down After U.S. Jobs Miss","url":"https:\/\/seekingalpha.com\/article\/4210207-week-ahead-dollar-slows-u-s-jobs-miss","urlToImage":"https:\/\/static2.seekingalpha.com\/uploads\/2018\/10\/6\/saupload_EUR_USD_18-10-01_5d_m.png","relevancy":9},{"author":null,"content":"\"There is no going back on deregulation of oil prices,\" Finance Minister Arun Jaitley said NEW DELHI: The government on Saturday sought to assure investors that it would not go back to regulating fuel prices, a day after oil company shares tumbled on concerns… [+1485 chars]","description":"Government seeks to assure investors that it would not go back to regulating fuel prices, a day after oil company shares tumbled on concerns about a return to a regime that has hurt their profits in the past.","publishedAt":"2018-10-06T12:16:29Z","source":{"id":null,"name":"Ndtv.com"},"title":"No Reversal In Deregulation Of Petrol, Diesel Prices, Says Arun Jaitley","url":"https:\/\/www.ndtv.com\/business\/petrol-diesel-prices-arun-jaitley-insists-no-reversal-in-deregulation-of-fuel-prices-1927901","urlToImage":"https:\/\/c.ndtvimg.com\/2018-10\/8edeksdk_petrol_625x300_06_October_18.jpg","relevancy":50},{"author":null,"content":"Arun Jaitley said challenges of high crude oil prices can't be resolved by tweets or bytes New Delhi: With non-BJP ruled states refusing to cut taxes on fuel, Finance Minister Arun Jaitley today questioned Congress President Rahul Gandhi and his \"reluctant al… [+3743 chars]","description":"With non-BJP ruled states refusing to cut taxes on fuel, Finance Minister Arun Jaitley today questioned Congress President Rahul Gandhi and his \"reluctant allies\" if they are only committed to tweets and television bytes when it comes to giving relief to the …","publishedAt":"2018-10-06T12:17:19Z","source":{"id":null,"name":"Ndtv.com"},"title":"Arun Jaitley Questions Commitment Of Rahul Gandhi Over Fuel Price","url":"https:\/\/www.ndtv.com\/india-news\/arun-jaitley-questions-commitment-of-rahul-gandhi-his-allies-1927903","urlToImage":"https:\/\/c.ndtvimg.com\/arun-jaitley_625x300_1529665890804.jpg","relevancy":46},{"author":"Sputnik","content":"India and Russia have signed a multibillion deal on the purchase of S-400 missile systems. The delivery of the five advanced S-400 Triumf squadrons will begin in October 2020. The $5bn arms deal was finalized by Indian Prime Minister Narendra Modi despite the… [+4379 chars]","description":"India and Russia have signed a multibillion deal on the purchase of S-400 missile systems. The delivery of the five advanced S-400 Triumf squadrons will begin in October 2020. The $5bn arms deal was finalized by Indian Prime Minister Narendra Modi despite the…","publishedAt":"2018-10-06T12:23:00Z","source":{"id":null,"name":"Sputniknews.com"},"title":"India to Avoid US Sanctions Over S-400 Purchase, Journalist Predicts","url":"https:\/\/sputniknews.com\/analysis\/201810061068654968-india-us-sanctions\/","urlToImage":"https:\/\/cdn2.img.sputniknews.com\/images\/103233\/77\/1032337723.jpg","relevancy":43},{"author":"Marc Chandler","content":"The US dollar advanced against most of the major currencies last week, with Brexit hopes on the upswing helping sterling, the only major currency to resist the pressure. If players were looking for an excuse to sell the dollar, the disappointing September job… [+6963 chars]","description":"On a number of currency pairs, the dollar's technical condition warns of risk of a near-term setback. US 10-year yields and Treasuries are also stretched and a","publishedAt":"2018-10-06T12:56:55Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"Beware: Dollar's Technical Condition Is Stretched, Lookout For Reversals","url":"https:\/\/seekingalpha.com\/article\/4210212-beware-dollars-technical-condition-stretched-lookout-reversals","urlToImage":"https:\/\/static2.seekingalpha.com\/uploads\/2018\/10\/6\/saupload_fx.jpg","relevancy":24},{"author":"Reuters","content":"New Delhi: India on Saturday sought to assure investors that the government would not go back to regulating fuel prices, a day after oil company shares tumbled on concerns about a return to a regime that has hurt their profits in the past. The government said… [+1227 chars]","description":"There is no going back on deregulation of oil prices: Finance minister Arun Jaitley in a Facebook post","publishedAt":"2018-10-06T13:10:46Z","source":{"id":null,"name":"Livemint.com"},"title":"India seeks to reassure markets on deregulation of fuel prices","url":"https:\/\/www.livemint.com\/Industry\/4v29Mk5ovFxUkKALt1aEZJ\/India-seeks-to-reassure-markets-on-deregulation-of-fuel-pric.html","urlToImage":"https:\/\/www.livemint.com\/rf\/Image-621x414\/LiveMint\/Period2\/2018\/10\/08\/Photos\/Processed\/petrol-kCQE--621x414@LiveMint-0185.JPG","relevancy":44},{"author":"Reuters","content":"India on Saturday sought to assure investors that the government would not go back to regulating fuel prices, a day after oil company shares tumbled on concerns about a return to a regime that has hurt their profits in the past. The government said on Thursda… [+1495 chars]","description":"The government said on Thursday it was cutting gasoline and diesel by 2.50 rupees per litre to help Indians struggling to pay fuel prices","publishedAt":"2018-10-06T13:18:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"Jaitley reassures markets, says no going back on fuel prices deregulation","url":"https:\/\/www.business-standard.com\/article\/economy-policy\/jaitley-reassures-markets-says-no-going-back-on-fuel-prices-deregulation-118100600545_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-09\/16\/full\/1537037810-6618.jpg","relevancy":63},{"author":"Amit Mudgill","content":"NEW DELHI: The announcement of elections in five states will only add to the ongoing volatility in the market, which is already bogged down by a free fall in the rupee, rising crude oil prices and liquidity crunch in the system. Analysts said the market had n… [+3104 chars]","description":"Chhattisgarh will be the first state to go on polls. It will see voting in two phases.","publishedAt":"2018-10-06T13:24:04Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"State elections will add to market volatility: How to position yourself","url":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/state-elections-will-add-to-market-volatility-how-to-position-yourself\/articleshow\/66100021.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66100059,width-1070,height-580,imgsize-60864,overlay-etmarkets\/photo.jpg","relevancy":67},{"author":"Bloomberg","content":"In June, Beijing threatened to slap a 25% tariff on crude imports in response to US President Donald Trumps US$50 billion levy on Chinese imports. (Bloomberg pic) NEW YORK: Even though Beijing hasnt sanctioned American oil imports yet, Chinese buyers arent ta… [+1312 chars]","description":"The world’s second largest economy halted purchases of US crude in August for the first time since September 2016.","publishedAt":"2018-10-06T13:30:26Z","source":{"id":null,"name":"Freemalaysiatoday.com"},"title":"China slams brakes on US crude oil imports","url":"https:\/\/www.freemalaysiatoday.com\/category\/business\/2018\/10\/06\/china-slams-brakes-on-us-crude-oil-imports\/","urlToImage":"https:\/\/s3media.freemalaysiatoday.com\/wp-content\/uploads\/2018\/10\/us-china-061018.jpg","relevancy":14},{"author":"Reuters","content":"India may be forced to delay selling its stake in Axis Bank Ltd because of a weak stock market, The Economic Times newspaper reported on Saturday, citing unnamed market sources and an investment banker aware of the development. India was planning to raise Rs … [+1181 chars]","description":"The government holds a 9.6 per cent stake in Axis Bank through state-owned entity Specified Undertaking of Unit Trust of India","publishedAt":"2018-10-06T13:31:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"India may be forced to defer Axis Bank stake sale due to weak stock market","url":"https:\/\/www.business-standard.com\/article\/finance\/india-may-be-forced-to-defer-axis-bank-stake-sale-due-to-weak-stock-market-118100600563_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-08\/28\/full\/1535400826-9898.jpg","relevancy":59},{"author":"PTI","content":"New Delhi: With non-BJP ruled states refusing to cut taxes on fuel, Finance minister Arun Jaitley on Saturday questioned Congress president Rahul Gandhi and his “reluctant allies” whether they were only committed to tweets and television bytes when it came to… [+3459 chars]","description":"In a Facebook post, finance minister Arun Jaitley accuses government critics of doing a ‘volte face’ by terming the cut in petrol and diesel prices by Rs 2.5 per litre by the Centre as ‘bad economics’","publishedAt":"2018-10-06T14:01:11Z","source":{"id":null,"name":"Livemint.com"},"title":"Petrol price cut: Jaitley questions commitment of Rahul Gandhi, his allies","url":"https:\/\/www.livemint.com\/Politics\/iMiRuhFmmm7wZPvVxoBYiJ\/Petrol-price-cut-Jaitley-questions-commitment-of-Rahul-Gand.html","urlToImage":"https:\/\/www.livemint.com\/rf\/Image-621x414\/LiveMint\/Period2\/2018\/10\/08\/Photos\/Processed\/picture-kpiG--621x414@LiveMint-6e79.jpg","relevancy":33},{"author":null,"content":"Saudi Crown Prince Mohammed bin Salman praised his relationship with President Donald Trump, days after the U.S. leader warned that the oil-rich kingdom's leadership might not last \"two weeks\" without American support. \"I love working with him,\" Prince Mohamm… [+4058 chars]","description":"President Donald Trump has heaped particular pressure on Saudi Arabia to do more to ease crude prices, by linking the American military presence in the Persian Gulf to the kingdom's oil-production policy. Yet Saudi Crown Prince Mohammed bin Salman praised his…","publishedAt":"2018-10-06T14:12:18Z","source":{"id":null,"name":"Stripes.com"},"title":"Saudi crown prince says he loves working with Trump","url":"https:\/\/www.stripes.com\/news\/middle-east\/saudi-crown-prince-says-he-loves-working-with-trump-1.550677?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+starsandstripes%2Fgeneral+%28Stars+and+Stripes%29","urlToImage":"https:\/\/www.stripes.com\/polopoly_fs\/1.550686.1538835067!\/image\/image.jpg_gen\/derivatives\/landscape_490\/image.jpg","relevancy":49},{"author":"Nayla Razzouk & Stephanie Flanders, Bloomberg","content":"Dubai\/London: Saudi Arabia’s crown prince, facing US pressure to tame surging oil prices, insisted that the kingdom is fulfilling promises to make up for Iranian crude supplies lost to American sanctions. “The request that America made to Saudi Arabia and oth… [+2711 chars]","description":"A coalition of producers from OPEC and beyond has recently boosted output by 1.5 million barrels a day, double the 700,000-barrel decline suffered so far by Iran, according to crown prince Mohammed Bin Salman","publishedAt":"2018-10-06T14:24:33Z","source":{"id":null,"name":"Livemint.com"},"title":"Saudi crown prince to Trump: We have replaced all Iran’s lost oil","url":"https:\/\/www.livemint.com\/Money\/E7PeXqtAZziKdPeP86Hy2M\/Saudi-crown-prince-to-Trump-We-have-replaced-all-Irans-los.html","urlToImage":"https:\/\/www.livemint.com\/rf\/Image-621x414\/LiveMint\/Period2\/2018\/10\/08\/Photos\/Processed\/crudeoil-kR5F--621x414@LiveMint-9802.jpg","relevancy":47},{"author":"Reuters","content":"India’s finance minister Arun Jaitley said in a Facebook post that there is no going back on deregulation of oil prices. (AFP pic) NEW DELHI: India on Saturday sought to assure investors that the government would not go back to regulating fuel prices, a day a… [+1546 chars]","description":"Modi's government assures investors it will not go back to regulating fuel prices.","publishedAt":"2018-10-06T14:25:17Z","source":{"id":null,"name":"Freemalaysiatoday.com"},"title":"India seeks to reassure markets on deregulation of fuel prices","url":"https:\/\/www.freemalaysiatoday.com\/category\/business\/2018\/10\/06\/india-seeks-to-reassure-markets-on-deregulation-of-fuel-prices\/","urlToImage":"https:\/\/s3media.freemalaysiatoday.com\/wp-content\/uploads\/2018\/10\/india-finance-061018.jpg","relevancy":37},{"author":"Dean Popplewell","content":"By Stephen Innes What a barn burner of a week!! Fixed income took centre stage, but the lingering odour from risk aversion and choppy intraday moves will continue to challenge traders at every twist and turn. With US yields remaining at multi-year highs and b… [+7981 chars]","description":"By Stephen Innes What a barn burner of a week!! Fixed income took centre stage, but the lingering odour from risk aversion and choppy intraday moves will contin","publishedAt":"2018-10-06T14:30:29Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"More Yielding To Yields Next Week?","url":"https:\/\/seekingalpha.com\/article\/4210220-yielding-yields-next-week","urlToImage":"https:\/\/static3.seekingalpha.com\/assets\/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png","relevancy":71},{"author":"Lokeshwarri SK","content":"Indian equity investors have gone through one of the worst weeks in recent memory with the Sensex and the Nifty shedding more than 5 per cent in the past week. For investors who have just joined the stock-market fraternity, this would have come as an unpleasa… [+5368 chars]","description":"Play your cards well now to cash in when the markets revive","publishedAt":"2018-10-06T14:39:38Z","source":{"id":null,"name":"Thehindubusinessline.com"},"title":"Dos and don’ts in a falling market","url":"https:\/\/premium.thehindubusinessline.com\/portfolio\/personal-finance\/dos-and-donts-in-a-falling-market\/article25144999.ece","urlToImage":"https:\/\/premium.thehindubusinessline.com\/portfolio\/personal-finance\/wqve1\/article25144998.ece\/ALTERNATES\/LANDSCAPE_615\/po08Growthpix","relevancy":55},{"author":"Bloomberg","content":"Mohammed Bin Salman, heir to the Saudi throne. (Bloomberg pic) Saudi Arabias crown prince, facing US pressure to tame surging oil prices, insisted that the kingdom is fulfilling promises to make up for Iranian crude supplies lost to American sanctions. The re… [+2629 chars]","description":"The action appears lost on President Donald Trump, who continues to attack the OPEC for letting prices rally while he seeks to choke off supplies from Iran.","publishedAt":"2018-10-06T14:47:38Z","source":{"id":null,"name":"Freemalaysiatoday.com"},"title":"Saudi crown prince to Trump: We’ve replaced all Iran’s lost oil","url":"https:\/\/www.freemalaysiatoday.com\/category\/business\/2018\/10\/06\/saudi-crown-prince-to-trump-weve-replaced-all-irans-lost-oil\/","urlToImage":"https:\/\/s3media.freemalaysiatoday.com\/wp-content\/uploads\/2018\/10\/saudi-prince-061018.jpg","relevancy":36},{"author":"Adam Vaughan","content":"F racking is due to return to the UK this week, as the shale gas company Cuadrilla prepares to start operations at a well in Lancashire provided it can see off a last-minute legal challenge. It will be the first horizontal shale well to be fracked in the UK. … [+7546 chars]","description":"Pending a legal challenge, Cuadrilla will start work on a well this week – and answer key questions about the industry’s viability Fracking is due to return to the UK this week, as the shale gas company Cuadrilla prepares to start operations at a well in Lanc…","publishedAt":"2018-10-06T15:00:25Z","source":{"id":"the-guardian-au","name":"The Guardian (AU)"},"title":"The frackers are back: but will there ever be a British shale gas boom?","url":"https:\/\/www.theguardian.com\/business\/2018\/oct\/06\/frackers-back-will-there-be-british-shale-gas-boom","urlToImage":"https:\/\/i.guim.co.uk\/img\/media\/c498d0801fa5617c3a706ed4cd6d69ea5ea82f77\/0_0_6720_4032\/master\/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly9hc3NldHMuZ3VpbS5jby51ay9pbWFnZXMvb3ZlcmxheXMvZjZlYzA2YWNlZGUwZWRmMDNiMDM3MmE1Y2VkZWJmZTIvdG8tZGVmYXVsdC5wbmc&s=8abe373b1462a900f55c3b3be5795e8d","relevancy":56},{"author":null,"content":"The U.S. oil drilling rig count fell for a third consecutive week even though crude prices hit four-year highs this week, as rising costs and pipeline bottlenecks in the nation's largest oil field have hindered new drilling since June. Drillers cut two oil ri… [+214 chars]","description":"The U.S. oil drilling rig count fell for a third consecutive week even though crude prices hit four-year highs this week, as rising costs and pipeline bottlenecks in the nation&#39;s largest oil field have hindered new drilling since June. Drillers cut two oi…","publishedAt":"2018-10-06T15:20:31Z","source":{"id":null,"name":"Topix.com"},"title":"U.S. oil drillers cut rigs for third week in a row -Baker Hughes","url":"http:\/\/www.topix.com\/business\/oil-gas\/2018\/10\/u-s-oil-drillers-cut-rigs-for-third-week-in-a-row-baker-hughes?fromrss=1","urlToImage":"http:\/\/picproxy.topixcdn.com\/pics\/up-","relevancy":21},{"author":"Richard Meadows","content":"OPINION: Petrol prices have topped $2.40 for the first time. If you thought that was scary, you better buckle upwe may be in for a white-knuckle ride. Aucklanders are already paying a regional fuel tax of 11.5c per litre. As of last week, taxes went up by an … [+3690 chars]","description":"OPINION: Record petrol prices are forcing many Kiwi families to rethink their budgets, and, as Richard Meadows explains, it's time to make major lifestyle changes.","publishedAt":"2018-10-06T16:00:00Z","source":{"id":null,"name":"Stuff.co.nz"},"title":"Budget Buster: How to stop the government siphoning your petrol tank","url":"https:\/\/www.stuff.co.nz\/business\/money\/107620735\/Budget-Buster-How-to-stop-the-government-siphoning-your-petrol-tank","urlToImage":"https:\/\/resources.stuff.co.nz\/content\/dam\/images\/1\/s\/2\/o\/n\/c\/image.related.StuffLandscapeSixteenByNine.1420x800.1s2oov.png\/1538685728502.jpg","relevancy":89},{"author":"newsfeeds@nzherald.co.nz","content":"COMMENT: Rising petrol prices pose a bigger threat to this Government than any of the management controversies they've been grappling with in the past few months. While I've been fascinated, for example, by the bungling of the appointment of a chief technolog… [+4728 chars]","description":"COMMENT: Rising petrol prices pose a bigger threat to this Government than any of the management controversies they've been grappling with in the past few months.While I've been fascinated, for example, by the bungling of the appointment...","publishedAt":"2018-10-06T16:09:03Z","source":{"id":null,"name":"Nzherald.co.nz"},"title":"Liam Dann: Petrol prices the big risk for Government right now","url":"https:\/\/www.nzherald.co.nz\/business\/news\/article.cfm?c_id=3&objectid=12136863","urlToImage":"https:\/\/www.nzherald.co.nz\/resizer\/G2B0ZSZdBI5Hx4uSWXDbuMPSeDI=\/1200x0\/smart\/filters:quality(70)\/arc-anglerfish-syd-prod-nzme.s3.amazonaws.com\/public\/7HMTBR6Y5RBMFAZA7PMIVMK3BU.jpg","relevancy":83},{"author":"PTI","content":"By: PTI | Mumbai | Updated: October 6, 2018 9:49:13 pm Drawing attention to the 2009 loan waiver, undertaken when he was Chief Minister, Chavan claimed that the promises of the Devendra Fadnavis-led government existed only on paper. (Representational Image) M… [+4029 chars]","description":"Ashok Chavan said that farmlands there were parched despite the Jalyukt Shivar programme of the Devendra Fadnavis government.","publishedAt":"2018-10-06T16:16:23Z","source":{"id":null,"name":"Indianexpress.com"},"title":"Declare drought in north Maharashtra, Marathwada: Ashok Chavan","url":"https:\/\/indianexpress.com\/article\/india\/declare-drought-in-north-maharashtra-marathwada-ashok-chavan-5389856\/","urlToImage":"https:\/\/images.indianexpress.com\/2016\/08\/droughtfarmers1.jpg?w=759","relevancy":19},{"author":"Reuters","content":"NEW DELHI: India on Saturday sought to assure investors that the government would not go back to regulating fuel prices, a day after oil company shares tumbled on concerns about a return to a regime that has hurt their profits in the past. The government said… [+1422 chars]","description":"Shares in the companies fell more than 20 percent to multi-year lows on Friday before recovering marginally.","publishedAt":"2018-10-06T17:55:50Z","source":{"id":"the-times-of-india","name":"The Times of India"},"title":"India seeks to reassure markets on deregulation of fuel prices","url":"https:\/\/economictimes.indiatimes.com\/industry\/energy\/oil-gas\/india-seeks-to-reassure-markets-on-deregulation-of-fuel-prices\/articleshow\/66102588.cms","urlToImage":"https:\/\/img.etimg.com\/thumb\/msid-66102621,width-1070,height-580,imgsize-849140,overlay-economictimes\/photo.jpg","relevancy":61},{"author":"Stephen Lendman","content":"In New Delhi on Friday October 4, 2018, Russia’s President Putin and India’s Prime Minister Modi signed a $5.4 billion agreement to purchase five S-400 air defense systems, delivery scheduled for 2020 – ignoring the threat of possible US sanctions. Asked if t… [+5259 chars]","description":"In New Delhi on Friday October 4, 2018, Russia’s President Putin and India’s Prime Minister Modi signed a $5.4 billion agreement to purchase five S-400 air defense systems, delivery scheduled for 2020 – ignoring the threat of possible US sanctions. … The post…","publishedAt":"2018-10-06T17:56:25Z","source":{"id":null,"name":"Globalresearch.ca"},"title":"India Buying Russian S-400s Air Defense Systems, Defies US Sanctions Threat","url":"https:\/\/www.globalresearch.ca\/india-buying-russian-s-400s-air-defense-systems-defies-us-sanctions-threat\/5656269","urlToImage":"https:\/\/www.globalresearch.ca\/wp-content\/uploads\/2018\/10\/India-Russia-Clinch-S-400-Missile.jpg","relevancy":18},{"author":"Indivjal Dhasmana & PTI","content":"Union Finance Minister Arun Jaitley on Saturday promised more steps to cut the current account deficit (CAD) and bolster foreign exchange inflows, seeking to calm frayed nerves amid a stock market crash and falling rupee. Jaitley said India would continue to … [+3933 chars]","description":"FM says the way crude oil prices are going up, there will be some adverse impact","publishedAt":"2018-10-06T18:05:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"Govt will meet fiscal deficit goals, fresh steps on cards to narrow CAD: FM","url":"https:\/\/www.business-standard.com\/article\/economy-policy\/govt-will-meet-fiscal-deficit-goals-fresh-steps-on-cards-to-narrow-cad-fm-118100600822_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-10\/05\/full\/1538686119-6703.jpg","relevancy":41},{"author":"FerdiS","content":"Monitoring dividend increases for stocks on my watch is one way to identify candidates for further analysis. Companies can only raise their dividends regularly and sustainably if they grow earnings sufficiently. The CCC List provides a good starting point, bu… [+8758 chars]","description":"Companies that regularly increase dividends show confidence in future earnings growth potential. Monitoring dividend increases for stocks on my watch list helps","publishedAt":"2018-10-06T18:07:36Z","source":{"id":null,"name":"Seekingalpha.com"},"title":"5 Dividend Increases: October 1-5, 2018","url":"https:\/\/seekingalpha.com\/article\/4210227-5-dividend-increases-october-1minus-5-2018","urlToImage":"https:\/\/static3.seekingalpha.com\/uploads\/2018\/10\/6\/saupload_divgro-dividends-small.png","relevancy":78},{"author":"Raghavan Srinivasan","content":"I must confess to feeling a little sorry for Finance Minister Arun Jaitley. The poor man had barely returned after a grievous illness when he was hit with the double whammy of a plunging rupee and soaring fuel prices. There was little he could do about the fo… [+4545 chars]","description":"Or, why the Sensex doesn’t indicate voting patterns","publishedAt":"2018-10-06T18:23:35Z","source":{"id":"the-hindu","name":"The Hindu"},"title":"The politics of populism","url":"https:\/\/www.thehindu.com\/opinion\/op-ed\/the-politics-of-populism\/article25146280.ece","urlToImage":"https:\/\/www.thehindu.com\/opinion\/op-ed\/zhdc6x\/article25146279.ece\/ALTERNATES\/LANDSCAPE_615\/07THiStock-924697738","relevancy":13},{"author":"BS Web Team","content":"Govt will meet fiscal deficit goals, fresh steps on cards to narrow CAD: FM Union Finance Minister Arun Jaitley on Saturday promised more steps to cut the current account deficit (CAD) and bolster foreign exchange inflows, seeking to calm frayed nerves amid a… [+3556 chars]","description":"Five states -Chhattisgarh, Rajasthan, Madhya Pradesh, Mizoram and Telangana - would go to the polls between second week of Nov and first week of Dec","publishedAt":"2018-10-06T18:46:00Z","source":{"id":null,"name":"Business-standard.com"},"title":"News Digest: FM to take steps to cut CAD, Foxconn's Odisha plan, and more","url":"https:\/\/www.business-standard.com\/article\/current-affairs\/news-digest-fm-to-take-steps-to-cut-cad-foxconn-s-odisha-plan-and-more-118100700005_1.html","urlToImage":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2018-10\/07\/full\/1538851367-3876.jpg","relevancy":72},{"author":"RT","content":"\"Netanyahu should know that there is no way for him except fleeing the region and so he needs to learn how to swim in the Mediterranean Sea,\" Brigadier-General Hossein Salami said during a Friday address to a group of IRGC commanders and officers in the centr… [+2595 chars]","description":"An official with Iran's Revolutionary Guards has warned Israeli PM Netanyahu to \"practice swimming,\" saying he'll soon have no other choice but to flee the region. It comes as Tehran accuses Israel of spreading Iranophobia. Read Full Article at RT.com","publishedAt":"2018-10-06T21:05:46Z","source":{"id":"rt","name":"RT"},"title":"'Practice swimming': Iranian official warns Netanyahu will be forced to flee across the sea","url":"https:\/\/www.rt.com\/news\/440513-netanyahu-flee-region-iran\/?utm_source=rss&utm_medium=rss&utm_campaign=RSS","urlToImage":"https:\/\/cdni.rt.com\/files\/2018.10\/article\/5bb9218ffc7e93d40a8b45cd.JPG","relevancy":20},{"author":"Haley Zaremba","content":"Oman has long been nicknamed the “Switzerland of the Middle East” thanks to the nation’s peace-focused diplomacy measures and a tendency toward neutrality and mediation. Despite being geographically surrounded by conflict and political turmoil, Oman has been … [+4046 chars]","description":"Oman has long been nicknamed the “Switzerland of the Middle East” thanks to the nation’s peace-focused diplomacy measures and a tendency toward neutrality and mediation. Despite being geographically surrounded by conflict and political turmoil, Oman has been …","publishedAt":"2018-10-06T23:00:00Z","source":{"id":null,"name":"Oilprice.com"},"title":"This Country Strengthens Ties With Iran As U.S. Sanctions Loom","url":"https:\/\/oilprice.com\/Geopolitics\/International\/This-Country-Strengthens-Ties-With-Iran-As-US-Sanctions-Loom.html","urlToImage":"https:\/\/d32r1sh890xpii.cloudfront.net\/article\/718x300\/be8b4b07493c0c4069ead7900bf6c1fa.jpg","relevancy":76},{"author":"By MICHAEL WILNER","content":"X Dear Reader, As you can imagine, more people are reading The Jerusalem Post than ever before. Nevertheless, traditional business models are no longer sustainable and high-quality publications, like ours, are being forced to look for new ways to keep going. … [+3685 chars]","description":"May grant waivers to good-faith allies.","publishedAt":"2018-10-06T23:02:29Z","source":{"id":"the-jerusalem-post","name":"The Jerusalem Post"},"title":"US reconsiders 'zero tolerance' policy on Iran oil imports","url":"https:\/\/www.jpost.com\/Israel-News\/US-reconsiders-zero-tolerance-policy-on-Iran-oil-imports-568787","urlToImage":"https:\/\/images.jpost.com\/image\/upload\/f_auto,fl_lossy\/t_Article2016_Control\/267845","relevancy":29}]